{
    "Name": "Aylwin Sports Therapy\n",
    "Products": {},
    "Address": "20 Kramat Lane #04-04 United House, #04-04, 228773",
    "Opening Hours": "Tuesday\n(Lunar New Year)\nClosed\nWednesday\n(Lunar New Year)\n1–8pm\nHours might differ\nThursday 1–8pm\nFriday 1–7pm\nSaturday 11am–7pm\nSunday 1–7pm\nMonday 1–8pm\nSuggest new hours",
    "Rating": "5.0\n365 reviews",
    "Reviews": [
        "Jun Ming\n4 reviews\nRated 5.0 out of 5,\nAylwin is friendly and approachable. The sport massage was superb and he was constantly checking up how i was feeling. The result was evident straight as I could the difference in my leg and shoulder mobility on the spot once the treatment was done. Muscle tightness was relieved and would definitely recommend people to try it\n\n",
        "Fariq Said\n2 reviews\nRated 5.0 out of 5,\nThe sports therapy provided by Aylwin is great and really helped me to relieve a lot of the tightness that had built up in my body. Aylwin is very professional and knowledgeable when carrying out the sports massage, and works to get all the knots and tightness out of the muscles. The compression therapy machine that he uses after the sports massage compliments the massage provides for even better recovery.\n\n",
        "Mohammed Adib Abdullah\n1 review\nRated 5.0 out of 5,\nThis is my second visit to Aylwin and it has been excellent both times. His sports massage is legit and the best I had. He managed to work my tight neck and shoulder muscles and release the tension. I highly recommend to everyone whether you do sports or sitting at a desk all day. He can relief all your pain. You should definitely give the compression therapy a try as well. Really relaxing and loosen up you body. Looking forward to my next visit!\n\n",
        "Jun Ming\n4 reviews\nRated 5.0 out of 5,\nAylwin is friendly and approachable. The sport massage was superb and he was constantly checking up how i was feeling. The result was evident straight as I could the difference in my leg and shoulder mobility on the spot once the treatment was done. Muscle tightness was relieved and would definitely recommend people to try it\n\n",
        "Fariq Said\n2 reviews\nRated 5.0 out of 5,\nThe sports therapy provided by Aylwin is great and really helped me to relieve a lot of the tightness that had built up in my body. Aylwin is very professional and knowledgeable when carrying out the sports massage, and works to get all the knots and tightness out of the muscles. The compression therapy machine that he uses after the sports massage compliments the massage provides for even better recovery.\n\n",
        "Mohammed Adib Abdullah\n1 review\nRated 5.0 out of 5,\nThis is my second visit to Aylwin and it has been excellent both times. His sports massage is legit and the best I had. He managed to work my tight neck and shoulder muscles and release the tension. I highly recommend to everyone whether you do sports or sitting at a desk all day. He can relief all your pain. You should definitely give the compression therapy a try as well. Really relaxing and loosen up you body. Looking forward to my next visit!\n\n",
        "Sean Neo\n2 reviews·1 photo\nRated 5.0 out of 5,\nVisited Aylwin for the first time after a few friends recommended me. Honestly, I was overwhelmed by his massage because it was by far the best I've ever encountered. Aylwin was professional and gave me advice on how I could further do my own stretching before and after sports. I'd definitely recommend people who are in need of a sports therapy. Look no further than Aylwin Sports Therapy.\n\n",
        "Yvelyn Seow\n4 reviews\nRated 5.0 out of 5,\nBrought my husband to Aylwin as he had severe pains in his lower back caused by injuries in the past. Within one session, his pain level went down by 90%. From not being able to walk or get out of bed to being able to walk down flights of stairs. Aylwin is really friendly, knowledgeable and not pushy when it comes to sales at all. We highly recommend him to everyone and will definitely be back.\n\n",
        "陈洁慧\n1 review\nRated 5.0 out of 5,\nHow I wished my bf could have brought me to Aylwin earlier. The tension on my lower back has been effectively relieved from 80% down to single digit. I also enjoyed his compression session very much. I can’t imagine how amazing his magic works, and now I managed to stretch further and perform my Cobra pose easily.\n\n",
        "Kevin Wang\n1 review\nRated 5.0 out of 5,\nAylwin did a really fantastic job in quickly resolving the pain issues that I have been dealing with over the past 2 months. Upper body also felt a lot more mobile after the sports massage, IASTM and clinical dry cupping. My lower back did not feel as locked up anymore. Definitely recommend his services!\n\n",
        "Jasmine Tan\n1 review\nRated 5.0 out of 5,\nI had a positive experience at aylwin sports therapy. My muscles felt looser after the massage and my range of mobility has increased after the session. He is professional and friendly, will recommend to friends!\n\n",
        "louis lau\n8 reviews\nRated 5.0 out of 5,\nA unique and overall satisfying experience! First time doing cupping and the other types of treatment, and I must say it was immediately effective! My right knee pain instantly became better and left shoulder became more flexible. Definitely recommend!\n\n",
        "Ben Koh\n2 reviews\nRated 5.0 out of 5,\nI’ve been dealing with a recurring elbow injury for several years now due to my lifestyle and training. I found out about Aylwin after doing some research online on reliable sports therapists and decided to give his clinic a try. Though I was a little skeptical over the dry cupping treatment initially. My first session has already made me a believer.\n\nAfter some deliberation, I decided on the complete treatment including the compress & relax sports recovery system. Aylwin comes across as someone both friendly and professional. He explained each phase of the treatment very thoroughly and was able to target the areas that contributed to the pain I was having very effectively. I felt an immediate relief after the treatment but I was even more astounded by the results the day after. I woke up with much more mobility in my injured arm and the pain was almost fully gone. All this in just one treatment.\n\nI’m truly glad that I made the decision to give Aylwin Sports Therapy a go. Truly money well spent and highly recommended! One of the best sports therapists that I’ve known of to date.\n\n",
        "Calvin Wong\n3 reviews\nRated 5.0 out of 5,\nHighly recommended! Aylwin was very friendly and knowledgeable. He could tell from the start where my problem area was and informed me that my neck and shoulders looked very tight. He was very professional and my muscles felt much better after the session.\n\n",
        "Nasri Mahmud\n1 review\nRated 5.0 out of 5,\nGreat experience with Aylwin Sports Therapy! Felt so much better after visiting him for a session. He managed to work on my sore muscles and tight shoulders. The compression managed to loosen up my glutes! Alywin is very friendly, attentive, open to sharing and a genuine guy. He willing to go the extra mile to make you feel better. Do try it out!\n\n",
        "lionel pang\n2 reviews\nRated 5.0 out of 5,\nAs a cyclist that just started cycling last year, after the IASTM CLINICAL dry cupping and sports massage And recovery system that Aylwin had provided I had felt less soreness and it helped lots. Back to cycling for 2022. Highly recommended if anyone seeks a sports massage do visit Aylwin Sports Therapy.\n\n",
        "Fenghang Lei\n3 reviews·3 photos\nRated 5.0 out of 5,\nWas recommended to go to Aylwin by a colleague, as I had been dealing with foot pain from running and training. Aylwin was very attentive during the consultation, and very detailed in the treatment. It was definitely very painful during some parts of the sports massage but that had to do with my really stiff and sore muscles. The dry cupping and compression boots therapy after the massage really helped to loosen my tight legs! I'll definitely be coming back again!\n\n",
        "Cinnamon Stix8\n3 reviews\nRated 5.0 out of 5,\nWe engage Aylwin to sort out our teenage daughter's stiff & tight muscles from her regular boulder sessions. He is such a friendly & experienced guy, providing great, genuine sports massage service! Thumbs up, Aylwin!!\n\n",
        "Vincent Li\nLocal Guide·86 reviews·31 photos\nRated 5.0 out of 5,\nI went to Aylwin Sports Therapy with my wife, who has been dealing with recurring shoulder issues.  Aylwin was friendly, attentive and most importantly effective in what he does.  His treatment was expertly carried out and my wife's shoulder issue has not recurred since.  On top of this, Aylwin was able to provide suitable treatment for my frozen shoulder from a brief chat I had with him while waiting in the consultation room, so I can vouch first-hand the effectiveness of his treatment.\n\nNeedless to say, we are glad to have found Aylwin.  His passion and dedication to his craft is greatly appreciated.\n\n",
        "Gwen L\n1 review\nRated 5.0 out of 5,\nI was recommended by a friend and have been to Aylwin's a couple times now. My muscles get really tight easily due to some old sports injuries on my shoulder and elbow. He is super knowledgeable and helpful, and I always feel better after the session. Highly recommend :)\n\n",
        "Chia MeiLing\n4 reviews\nRated 5.0 out of 5,\nI was facing with lower back pain for a few weeks and contemplating if I should try out sports massage and cupping. My first ever experience with sports massage and Aylwin Sports Therapy is definitely a good choice to consider!\n\nAylwin was kind and helpful in explaining what the different treatments does. I could feel less pain and increase in my range of motion after the treatment.\n\n",
        "Cazanne Lee\n1 review\nRated 5.0 out of 5,\nThe persistent tension in my hamstring and glute area was instantly relieved after one session of sports massage and compression therapy from Aylwin! That was the main reason why I visited him and surprisingly I also managed to relieve the tension in other muscle groups. Aylwin is indeed professional, knowledgeable and passionate in what he does! And, he listens to my issue and customises his treatment accordingly :)\n\n",
        "aqil\n2 reviews\nRated 5.0 out of 5,\nI'm a goalkeeper in soccer hence i strain my shoulder alot but after the sports massage it has helped me feel relief on my shoulders. i feel much more lighter and can jump with much more ease. feel much more flexible as well. would recommend going\n\n",
        "Sakthivel Ganapathy\n1 review\nRated 5.0 out of 5,\nAlwyn was professional and provided instant pain relief through his various techniques. His genuine character is also one of the reasons I will go back there. He incorporates modern techniques such as dry cupping and IASTM to increase the effectiveness of his sports massage!\n\n",
        "Andrea Seet\n4 reviews\nRated 5.0 out of 5,\nAylwin is very meticulous and careful. He listens to your issues and problems, then zeroes in on them.\n\nI’ve been experiencing hips and glutes issues due to a desk-bound job, so much so that whenever I sit, the pain is affecting my nerves. I’ve been to a handful of massage places where they only alleviate the pain momentarily and not address it.\n\nBut with Aylwin’s The Complete Package, I’m slowly seeing the progress and the pain being relieved. Thank you so much Aylwin, I’m hopeful about being able to sit without experiencing any pain in my lower-half once again 😄👍🏼\n\n",
        "Jason Han\n2 reviews·1 photo\nRated 5.0 out of 5,\nAlways awesome to meet Aylwin to help sort out any tense muscles and speed up recovery. It’s great that any muscle groups that you are feeling more trouble with (Lower back/Neck/hamstrings etc.), he will ensure that he gives more attention to and checks in if it is better after every session.\n\nI feel much better after the session and strongly recommend Aylwin! Thanks bro!\n\n",
        "Saharol Rahman\n1 review\nRated 5.0 out of 5,\nA great experience from the first time entering the nice place and meeting Aylwin himself a very helpful, understanding and skillful guy. He will listen to you and will try to help you as much as he can. He will even go extra mile to help and giving me complimentary compression treatment to relax my body further. He really serve you with his heart. 👍🏻\n\n",
        "zack zack\n4 reviews\nRated 5.0 out of 5,\nAlywin is very knowledgeable and professional. Have back ache problems before I came to him. After one session , I can feel drastic improvement . I can actually bend my back easily without feeling pain now .\n\n",
        "dazri hanif\n1 review\nRated 5.0 out of 5,\nHands down the best in town!! Always feeling rejuvenated after my visits with Aylwin, clock in your session for both upper and lower body sessions, you won’t regret it :,)\n\nP.s. if you’re visiting come mentally prepared - he’s always hitting all the sweet spots on your muscle fibres , might just cry a little during the session itself 😂\n\n",
        "Rajiv\n6 reviews\nRated 5.0 out of 5,\nAylwin was extremely knowledgeable having worked with several professional athletes and it shows in his treatment. His therapy and approach was extremely professional and effective, and both the cupping and compression focus did wonders in helping restore flexibility and strength. I will be going back!\n\n",
        "Darren Sim\n3 reviews\nRated 5.0 out of 5,\nAlywin is a man with passion and drive. He helped me with my shoulder pain and tight hips. I felt much better after the massage and definitely recommend this.\n\n",
        "Tzi-Yang Seow\n3 reviews·2 photos\nRated 5.0 out of 5,\nThe Great Reset. Aylwin’s sessions are not for the faint hearted. The more intense the pain, the more it proves how much you have been mistreating your body by sitting too long in front of a desk or having poor posture. I was close to tears but he returned my mobility and ROM to me almost instantly. Thanks bro.\n\n",
        "Mai Chi Tran\n1 review\nRated 5.0 out of 5,\nI went to see Aylwin for treatment of stiff back, hips and legs and received the most intense sports massage. I will admit that it was quite painful but he found all the tight spots and I definitely felt less stiff immediately afterwards. I also suffer from pincer hip / hip impingement which limits my range of motion, however he treated that area, I was able to increase my range of motion by more than 50%! That was pretty impressive as I've never had that happen before.I had dry cupping done as well as compression. I would absolutely recommend Aylwin as your go-to person for sports therapy massages!\n\n"
    ],
    "Phone": null,
    "Website": "http://aylwinsportstherapy.com/",
    "Message": null
}