{
    "Name": "Core Concepts Physiotherapy Novena Square\n",
    "Products": {},
    "Address": "238 Thomson Road, #03-32 Velocity, Novena Square, 307683",
    "Opening Hours": "Wednesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nThursday 9am–6pm\nFriday 9am–6pm\nSaturday 9am–6pm\nSunday Closed\nMonday 9am–6pm\nTuesday 9am–6pm\nSuggest new hours",
    "Rating": "4.9\n100 reviews",
    "Reviews": [
        "Shaun Quek\nLocal Guide·28 reviews·32 photos\nRated 5.0 out of 5,\nWent to have a sports massage for my lower back issue. Therapist Johanna did an amazing job! She not only attacked the main problem but the peripherals too. On top of that, she held conversations well, and constantly check up on how I was doing. The room wasn't silent and awkward. After the session, my back muscle pain was thoroughly relieved. So good. Will go again!\n\n",
        "KH Tay\n2 reviews\nRated 5.0 out of 5,\nGreat experience with Isaac of Core Concepts Novena. Front desk staff also very helpful. Had bad back sprain and Isaac helped me thoroughly with his very professional ministrations and advice. Wouldn't hesitate to recommend to anyone needing physio.\n\n",
        "P Liew\n5 reviews·3 photos\nRated 5.0 out of 5,\nKnowledgeable and Professional Physiotherapists at  Core Concepts guided me in my shoulder post-ops recovery.\n\nTheir clinics are well equipped &  the expert Physiotherapists work as a team to seamlessly manage my recovery program.\n\nGreat customer service in scheduling and reminding me about my appts, with multiple location easily accessible by Public Transport is a big plus.\n\nThank you Core Concepts for taking great care of your clients.\n\n",
        "Shaun Quek\nLocal Guide·28 reviews·32 photos\nRated 5.0 out of 5,\nWent to have a sports massage for my lower back issue. Therapist Johanna did an amazing job! She not only attacked the main problem but the peripherals too. On top of that, she held conversations well, and constantly check up on how I was doing. The room wasn't silent and awkward. After the session, my back muscle pain was thoroughly relieved. So good. Will go again!\n\n",
        "KH Tay\n2 reviews\nRated 5.0 out of 5,\nGreat experience with Isaac of Core Concepts Novena. Front desk staff also very helpful. Had bad back sprain and Isaac helped me thoroughly with his very professional ministrations and advice. Wouldn't hesitate to recommend to anyone needing physio.\n\n",
        "P Liew\n5 reviews·3 photos\nRated 5.0 out of 5,\nKnowledgeable and Professional Physiotherapists at  Core Concepts guided me in my shoulder post-ops recovery.\n\nTheir clinics are well equipped &  the expert Physiotherapists work as a team to seamlessly manage my recovery program.\n\nGreat customer service in scheduling and reminding me about my appts, with multiple location easily accessible by Public Transport is a big plus.\n\nThank you Core Concepts for taking great care of your clients.\n\n",
        "Dinesh Silva\n1 review\nRated 5.0 out of 5,\nWent to visit Core Concepts because  I was suffering from a stiff shoulder and muscle pain. Johanna the one who attended to me, was very patient and meticulous with my shoulder issue.\n\nShe provided explanation and ensured that I was comfortable throughout my session as my shoulder area was very painful. A the end of my session my shoulder and neck area was feeling better.\n\nHighly recommend to visit her for a strong massage session at the Novena Outlet.\n\n",
        "Si Hui Lee\n2 reviews\nRated 5.0 out of 5,\nFollowing recommendations from family members, I visited Core Concepts to treat my back pain as I didn't want to rely on pain medications and injections. With the care from Yi Ren, Sara and Cheryl, my back issue has now been resolved and they have patiently introduced exercises to correct my poor posture as well. I'm glad that my standard of living has improved greatly without the need for medication and will highly recommend their service for anyone facing similar issues as well!\n\n",
        "Shen K\n12 reviews\nRated 1.0 out of 5,\nExcellent and prompt customer service. Unfortunately, my pain issues were not addressed after attending 4 sessions.\n\nI do like the idea of having a team to look into your case, but that also means you have to repeat yourself several times. In my case, I was attended by 3 different therapists. The 2 therapists (who were not involved in my initial diagnosis) needed clarification/confirmation before starting the treatment as they were looking into my case based on the data displayed on their system. I could feel that there's an obvious communication gap between the therapists - they didn't seem to have had discussed my case internally for further diagnosis and progression check as they were relying very much on the system (which provided limited information). They are probably so used to doing it that they have subconsciously lost the personal touch with the patient. Due to the communication gap, my condition was not further scoped/diagnosed/fine-tuned, despite I had clearly mentioned that there was no sign of improvements after the treatments.\n\nBesides, they focused very much on manual therapy and exercises - they did not suggest any alternative treatment (e.g. shockwave therapy, dry needling etc.) in an attempt to combine various approaches in tackling my pain issues from different angles. I can't be sure if this is due to the lack of communication among the therapists as I mentioned above, or they were trying to make me attend more sessions.\n\nIf you are looking for a well-rounded service with a personal touch and prompt corrective actions, I don't think this is the right place. I sought treatment from another provider and I was treated by a therapist (as opposed to a team of therapists) who knows my case very well and therefore able to continuously diagnose my case and provide adjustments/alternative treatments based on my progression. My pain level has subsided about 50% after the first treatment, and my condition has vastly improved on the next day!\n\nI hope this review gives you a fair perspective so you could make the right decisions.\n\n",
        "Wanyi Lee\nLocal Guide·34 reviews·27 photos\nRated 5.0 out of 5,\nCore concepts has really professional physiotherapists and massage therapists! They always solve my issues whenever I have injuries or experience pain on the wrist, back, shoulder, and legs. Shane, Felicia, Weijuan are very professional and helpful, and they also share good methods for me to maintain my regime so that I don’t have to come back once my treatments are done. They’re also really friendly and personable! Their receptionists are also very friendly, helpful, and always help in my queries. Thanks everyone!\n\n",
        "M. Loh\n1 review\nRated 5.0 out of 5,\nI had sprained my left ankle about 3 weeks prior to my first consultation for my ankle. I had been informed by a GP that my sprain that it would take 3 to 4 weeks to heal. But after 3 weeks, I still couldn't even walk for 5 minutes without a walking aid.\n\nUpon walking into Core Concepts, Addy, one of the counter staff, noticed that I couldn't walk and immediately offered to help me get drinks and snacks. Louis, the other counter staff, repeated his offer in earnest. I was surprised that they noticed my situation and their kindness warmed my heart. Though I didn't need anything, it left a deep impression on me as I've never known any establishment to go out of their way to make a customer feel comfortable.\n\nThe first therapist to be assigned to me upon my arrival was Chye Tuan. I was greatly impressed by how quickly and definitively he assessed my ankle. He had assessed my injury far better than a GP! He told me that it was actually still sprained and it was an eversion sprain that would need 6 to 8 weeks to heal instead. He propped my left leg up and massaged it to get the fluids around my swollen ankle to drain away, and when he was done, I could walk again without aid! It felt like a miracle just happened to me. Though my ankle was still sprained and the pain returned sometime later, it was an incredible relief to walk without a walking aid.\n\nAnother counter staff, Joanna's bright and cheerful personality and helpful nature was always a warm welcome whenever I step into the reception. Her friendliness made the waiting time go by quickly. She was also helpful in telling me that if I ever needed advice in between sessions, I merely needed to drop a line to the Core Concepts number. It shows the company cares a good deal about their patients.\n\nMy subsequent physiotherapy sessions were covered by Isaac Tai, with Chye Tuan reviewing my progress every couple of weeks in separate sessions. From the very first session I had with Isaac, he had been friendly, gentle, enthusiastic, patient and very kind to me. He never failed to go the extra mile, like showing me pictures of foot anatomy because he realised that I was a visual person and learned by seeing, he even taught me a new exercise on how to improve my flat feet which I did find interesting as he said I would. I still remember them and practise them whenever I can, and I pay attention to how my feet land on the ground because of his explanations and instructions. Isaac is an amazingly intelligent and analytical therapist as he would constantly observe and assess my condition and what I needed, and he would address every single one of my concerns and questions patiently. I was very impressed by his maturity, self-control and professionalism at handling trying moments, especially moments where I had unwittingly tested his patience a few times. He always made the effort to explain many things to me just so I could understand. Isaac's intention to help me recover and keep me safe was so steadfast that I came to trust him explicitly.\n\nIsaac was particularly good with teaching me the exercises I had to do. He started off demonstrating what I needed to do, then got me to try them and gradually corrected me. Without his specific instructions, observation, guidance and patience, I would not have been able to do them well. Because of his efforts, I came to appreciate them and I could feel myself gaining strength as time passed.\n\nIsaac made the sessions fun and enjoyable too. He cared and treated me as a real person with a life outside and, not some patient and merely did his job which would've been acceptable and pragmatic too. As a result, I felt at home, safe, heard and understood.\n\nI highly recommend Core Concepts and give their staff my highest commendation for their amazing attitude, impressive work ethics and outstanding work as it was due to their efforts that I recovered well and had a pleasant experience through the process.\n\n",
        "Su lala\n1 review\nRated 5.0 out of 5,\nVery good experience with this place. Professional physiotherapist Shane, massage therapist Felicia and functional trainer Li Hoon has helped me with my recovery for shoulder dislocation and calves pain. Felicia really have goods hands and I always enjoyed every sports massage session.\n\n",
        "Pang Meng Chye Anthony\n1 review\nRated 5.0 out of 5,\nKnowledgeble physiotherapist who was able to resolve the pain from the muscle spasm in my lower back. Front-desk staff was friendly and welcoming regardless whether you are new or returning patient. Highly recommended.\n\n"
    ],
    "Phone": "6226 3632",
    "Website": "https://www.coreconcepts.com.sg/?utm_source=GMBlisting&utm_medium=Organic",
    "Message": null
}