{
    "Name": "FootNote Reflexology - Body & Foot Massage\n",
    "Products": {},
    "Address": "10 Paya Lebar Rd, #04-15 PLQ Mall, Singapore 409057",
    "Opening Hours": "Tuesday\n(Lunar New Year)\n11am–10pm\nHours might differ\nWednesday\n(Lunar New Year)\n11am–10pm\nHours might differ\nThursday 11am–10pm\nFriday 11am–10pm\nSaturday 11am–10pm\nSunday 11am–10pm\nMonday 11am–10pm\nSuggest new hours",
    "Rating": "4.8\n62 reviews",
    "Reviews": [
        "Poh Jun Wei\n2 reviews\nRated 5.0 out of 5,\nVery satisfied with the foot massage done by Aaron - the pressure point was just nice and just right on the aching part too.\n\nHad bought the member package (Mini) after that, and would like to get the massage done by the others.\n\nWould like to give feedback in providing bottled water after the massage services (even though due to covid can't drink water - so bottled water will be good)\n\n",
        "Miranda Ng\n7 reviews\nRated 5.0 out of 5,\nI have been feeling soreness and pain in my feet for the past weeks and I couldn't take it this morning and decided to search for one massage place and I found FootNote. I booked a session in the afternoon via WhatsApp with them.\n\nI had a 60 mins foot massage with Sam and it was great! He noticed I was cold half way through the session and got another blanket to lay over my upperbody. Very attentive. And the force on the foot is just right and he checked in a few times with me too. I felt asleep halfway through the session and he just went on with the the massage without losing any strength or force.\n\nWhen the massage is done, they introducd a package for me and wasn't pushy at all. Very pleasant visit. I will definitely bring my mom back for another session and sign up !!\n\nThank you for the great service and work, really appreciate a safe place without feeling the pressure to sign up after.\n\n",
        "Vanessa Low\n3 reviews\nRated 5.0 out of 5,\nI really enjoyed my 60 mins full body message at FootNote Reflexology. Linda, the massage therapist was really attentive to my needs and was very professional in her use of massage techniques. She made sure to cater the pace of the massage session to make it comfortable for me and was very warm and friendly. Christine, the front of house, was personable and helpful to answer any queries I had and was very kind to  give me a free detox foot patch upon purchase of a package. There was no hardselling on their end, the prices will speak for themselves. Highly recommended place to get frequent massages!\n\n",
        "Poh Jun Wei\n2 reviews\nRated 5.0 out of 5,\nVery satisfied with the foot massage done by Aaron - the pressure point was just nice and just right on the aching part too.\n\nHad bought the member package (Mini) after that, and would like to get the massage done by the others.\n\nWould like to give feedback in providing bottled water after the massage services (even though due to covid can't drink water - so bottled water will be good)\n\n",
        "Miranda Ng\n7 reviews\nRated 5.0 out of 5,\nI have been feeling soreness and pain in my feet for the past weeks and I couldn't take it this morning and decided to search for one massage place and I found FootNote. I booked a session in the afternoon via WhatsApp with them.\n\nI had a 60 mins foot massage with Sam and it was great! He noticed I was cold half way through the session and got another blanket to lay over my upperbody. Very attentive. And the force on the foot is just right and he checked in a few times with me too. I felt asleep halfway through the session and he just went on with the the massage without losing any strength or force.\n\nWhen the massage is done, they introducd a package for me and wasn't pushy at all. Very pleasant visit. I will definitely bring my mom back for another session and sign up !!\n\nThank you for the great service and work, really appreciate a safe place without feeling the pressure to sign up after.\n\n",
        "Vanessa Low\n3 reviews\nRated 5.0 out of 5,\nI really enjoyed my 60 mins full body message at FootNote Reflexology. Linda, the massage therapist was really attentive to my needs and was very professional in her use of massage techniques. She made sure to cater the pace of the massage session to make it comfortable for me and was very warm and friendly. Christine, the front of house, was personable and helpful to answer any queries I had and was very kind to  give me a free detox foot patch upon purchase of a package. There was no hardselling on their end, the prices will speak for themselves. Highly recommended place to get frequent massages!\n\n",
        "M T\n3 reviews·1 photo\nRated 1.0 out of 5,\nI used to speak highly and recommend this shop to my friends until today. I bought a package before Covid really became widespread. Then during Covid, obviously we were unable to utilise the package as there was a period of time massages were not allowed. As such, my package was untouched. As I noticed that my package was expiring on 20 Jan, I texted the shop to make an appointment as well as to ask about an extension, to which I was given a no. I was told that if I would like to extend my package, I needed to buy more packages. How absurd. After more probing, the person on the other side of the message just gave a “I will check and get back to you.”  When I asked for a name, I was blueticked. Not recommended! I take back all the good words I used to say about this place.\n\n",
        "Ho\n6 reviews\nRated 2.0 out of 5,\n90min body massage turned out to be just 60min, after which they apologized as the therapist thought it was supposed to be 60min.\nThey suggested to replace the remaining 30min with foot reflexology instead, to which I agreed (I could have just paid for the 60min body massage and leave).\nI thought the price would be the same as the 90min body massage since it was their oversight and it would be a good way to make up for the 30min. It turned out I was charged the more expensive price of 60min body massage + 30min foot reflex.\nNot that I can’t afford to pay, but I think they could have put in more thoughts dealing with this.\nMassage wise: Adequate but not one of the best I had. With the kind of pricing, I think places like Emperor Spa and NatureLand offer better deal, in terms of both skills and ambience.\n\n",
        "Blue J\nLocal Guide·281 reviews·313 photos\nRated 5.0 out of 5,\nHonestly, I didn't expect the acupressure massage to be great although they look professional.\n\nI came with a backache which caused me to not be able to breathe properly (right lung somehow felt squeezed). After an hour of the massage I felt normal again.\n\n",
        "Amy Y.\n1 review\nRated 5.0 out of 5,\n[edited]\nthere was some bad first bad experience in the first visit, however the owner contacted us and made it up with an awesome follow up and session.\noverall, this place is good in the ambience and service. perhaps it was just an unlucky day for us in the first visit but i would say it's all good now. i will visit them again! thank you!\n\n",
        "Rohaini Shaikh\n1 review\nRated 5.0 out of 5,\nWe family of 3, went there thrice, really had very good foot reflexology massage and also full body massage for husband. Special thanks to Mr Ray, Ms Sharon and Mr Ryan. They are very professional. Especially Mr Ray. 👍👍👍👍👍\n\n",
        "Edwin Loh\n1 review\nRated 5.0 out of 5,\nJust had a massage at FootNote Reflexology. Masseuse was extremely skilled and took care to ask if the pressure was alright. Massage was extremely relaxing and therapeutic. The service provided by both the masseuse and the receptionist was extremely commendable. Very friendly people, and most certainly a great place to relax and unwind! I'll definitely come back again!\n\n",
        "KATHERINE CHING\n2 reviews\nRated 5.0 out of 5,\nYati is a very nice massager...\nShe is very patient and care for the customer\nFriendly, Cheerful and Attentive\n\n",
        "Renee Kee\n3 reviews·1 photo\nRated 5.0 out of 5,\nI’m not one to write reviews unless I believe the place deserve it ! One of the best massage I had in my life !! And what’s even better is the price range is not over the top compare to other massage places in Singapore! It’s always either too expensive or if it’s too cheap the ambience and hygiene is not up to standard. This place literally check all my criteria! Good price! Good ambience and good hygiene practices! Will definitely come back !\n\nIf you’re looking for affordable massage with great ambience, this is the perfect place to go!\n\n",
        "Reina Peh\n7 reviews\nRated 5.0 out of 5,\nI’ve have been coming here for the past 6 months for their foot, back & shoulder and body massages. Managed to try different therapists and I feel that they have very competent and service-oriented therapists here. I’m pleased that they actually take the time to evaluate my areas of pain first, and will always check if I’m okay with the pressure from time to time during the session because it shows that they care. Also, the receptionists are smiley and gentle whenever I see them! Gonna make here my regular go-to place for massages :)\n\n",
        "Yi Lyn Tan\n2 reviews\nRated 5.0 out of 5,\nYou wont need to get undressed for a back/body service, which is cleaner for all parties in my opinion! They pull a full-body towel over you and towels are laundered and smell fresh. I've seen a couple of masseuse and theyre all very strong. They also ask if you have any target problem areas before they start the timer. Bought a package immediately. Great service!\n\n",
        "Tommy Leong\nLocal Guide·39 reviews·69 photos\nRated 5.0 out of 5,\nAttended to their massage twice, so far so good without any complaint.\n\nWould like to credit Ray for his massage techniques and most importantly he always check with you if you would like more massage on certain area before moving on, he focuses on your need instead of blindly massage throughout the session.\n\nHave also bought their 500sgd credit (:\n\nPerhaps one thing to take note, the Aircon was quite cold today. Not sure if its because the weather or Aircon temp was adjusted.\n\n",
        "Clement Tan\n2 reviews·1 photo\nRated 5.0 out of 5,\nGreat experience with great customer service. Reasonably priced for the 45 mins neck and back acupressure massage (even better with the member rates). Will definitely go back to relive the tensions from working in front of the computer daily!\n\n",
        "Rachel Marie\n6 reviews·3 photos\nRated 5.0 out of 5,\nTried their full body massage with oil and it was really good. My masseuse was Sharon and she did a great job especially with releasing tension on my neck and head!! The massage was really relaxing that I fell asleep halfway through it 😂\n\n",
        "Jonathan Lim\n2 reviews\nRated 5.0 out of 5,\nThis place is the best massage place I have ever been to! I'm not a big fan of foot massages, but the exceptional skill and professionalism of the masseuse really made me change my mind and I'll definitely come back to pamper my feet! Very glad that I chose this place!\n\n",
        "Adeline Tan\n1 review\nRated 5.0 out of 5,\nThe customer services  was super nice and helpful, and the masseuse is very skillful. Their packages are super affordable. I have an hours of shoulder  massage that was actually more like a full back, so it gave the package that much more worth! It highly recommended . 👍👍👍👍👍\n\n",
        "Huikyy tan\n1 review\nRated 5.0 out of 5,\nVery good service and skill. Massage is on point on the pressure ! First time trying and decided  to sign up a package due to Christine and Lynda  excellent service !\n\n",
        "Azerai Zahari\n10 reviews·6 photos\nRated 5.0 out of 5,\nToday I had a world class experience at footnote reflexology. The moment I check in, I was treated like a king.  The place was very clean and top notch service was provided.  The therapist was very professional and I was very satisfied. Thank you so much for pampering my body and legs. I would recommend this place to all my friends\n\n"
    ],
    "Phone": null,
    "Website": "http://footnotereflexology.com.sg/",
    "Message": null
}