{
    "Name": "Healing Thai Massage\n",
    "Products": {},
    "Address": "39 Jln Besar, Singapore 208802",
    "Opening Hours": "Tuesday\n(Lunar New Year)\n10am–10:30pm\nHours might differ\nWednesday\n(Lunar New Year)\n10am–10:30pm\nHours might differ\nThursday 10am–10:30pm\nFriday 10am–10:30pm\nSaturday 10am–10:30pm\nSunday 10am–10:30pm\nMonday 10am–10:30pm\nSuggest new hours",
    "Rating": "4.4\n247 reviews",
    "Reviews": [
        "Gabrielle Chua\nLocal Guide·23 reviews·1 photo\nRated 5.0 out of 5,\nI've been visiting this massage place for about 4 years now, would go once a month, and I really love their services. I've always asked for M to do my massage as she's really good at it, the strength is just right and she's always able to help me relieve my aches. Would really recommend her if you're looking for authentic and good Thai massage!\n\n",
        "Riz Perreras\n10 reviews\nRated 1.0 out of 5,\nThe massage seems to be random massaging here and there. I said softer but the lady did not understand and continue giving really hard massage. I went with a friend and she feels the same way. Not worth the money and i came out the spa with more pain than when i came in. Not even worth a star.\n\n",
        "Doris Leung\n1 review\nRated 5.0 out of 5,\nTotally 5 stars. I usually go to chinatown for thai massage but they were fully booked so I decided to give this place a chance and no regrets at all!\nTheir style of thai massage is a combination of traditional thai and deep tissue - less twisting of your body but more pressing of your muscle. My masseuse is a thai lady and she gave a very strong massage which totally untied all my knots. I will for sure be back.\n\n",
        "Gabrielle Chua\nLocal Guide·23 reviews·1 photo\nRated 5.0 out of 5,\nI've been visiting this massage place for about 4 years now, would go once a month, and I really love their services. I've always asked for M to do my massage as she's really good at it, the strength is just right and she's always able to help me relieve my aches. Would really recommend her if you're looking for authentic and good Thai massage!\n\n",
        "Riz Perreras\n10 reviews\nRated 1.0 out of 5,\nThe massage seems to be random massaging here and there. I said softer but the lady did not understand and continue giving really hard massage. I went with a friend and she feels the same way. Not worth the money and i came out the spa with more pain than when i came in. Not even worth a star.\n\n",
        "Doris Leung\n1 review\nRated 5.0 out of 5,\nTotally 5 stars. I usually go to chinatown for thai massage but they were fully booked so I decided to give this place a chance and no regrets at all!\nTheir style of thai massage is a combination of traditional thai and deep tissue - less twisting of your body but more pressing of your muscle. My masseuse is a thai lady and she gave a very strong massage which totally untied all my knots. I will for sure be back.\n\n",
        "Pramod Nair\nLocal Guide·160 reviews·687 photos\nRated 4.0 out of 5,\nVisit here for no frills authentic massage. $60 for 60 mins is higher than average for the curtain partitioned massage beds.\nApparently the price hike by $5:is recent as I see a 4 month old review at older rates.\n\nOn the plus side it appears comparatively easier to just walk in or book appointments at short notice on most days as the have many therapists.\n\n",
        "Jaron Chua\nLocal Guide·381 reviews·2,437 photos\nRated 4.0 out of 5,\nSlightly pricey but they are professional masseurs. They have two choices; Thai/oil massage, or the aroma hot oil massage. Prices are as listed in the attached image.\n\nIt was painful during the massage but I felt relaxed afterwards. You may let the masseur know how much pressure to you prefer. However I gave only 4 stars as the masseur tend to press very hard on my bones. There was also a time when she was pressing hard on my spine that my legs felt numb.\n\nOtherwise, all was good. Will return if I am in need of a massage\n\n",
        "Mehar Dadhich\nLocal Guide·89 reviews·125 photos\nRated 3.0 out of 5,\nFor me personally this place was good as the massage was good. However, my wife had a bitter experience as her body started to ache as soon as the massage got over. Therefore, 3 starts!\n\n",
        "Scott HH\n1 review\nRated 4.0 out of 5,\nI paid 80 dollars for a 90mins oil massage therapy. The Thai masseur speaks English and get down to business. No time wasting and not rushing. She finished the massage at 90mins. The session is very good i must say compare to many other spa. she knows exactly what is required for the pressure points. The rooms are clean but a bit dated. That is what you will get. No frills. The receptionist at the desk is strict. Perhaps she can be more polite and friendly instead of only instructing customers i.e. hand sanitizer for cleaning your hands ; take off your shoes .etc. she should have said thank to  a few walk in customers including myself  which she didn't. I was observing when i was at the front desk waiting area. I could have rated them 5 stars. On a whole, it was a pleasant experience to me as the massage is good. No pushing of selling massage package or snake oil.\n\n",
        "Fiona Chin\nLocal Guide·15 reviews·24 photos\nRated 5.0 out of 5,\nSuper good massage, we had the traditional oil massage for 90 mins, the masseuse hit every pain spots and cracked my back. It’s really just exactly what I wanted and needed, thank you May! You are really great.\n\n",
        "HanJie Cheng\nLocal Guide·31 reviews·83 photos\nRated 1.0 out of 5,\ncounter staff was alright and that's it. I don't feel any lighter anywhere in the body. in fact I had to go for another round of massage the next day...\n\n",
        "Christian Branzuela\n3 reviews·1 photo\nRated 1.0 out of 5,\nWorst massage experience ever. The lady didn’t understand I needed a softer massage. I ended up feeling stressed instead of relaxed. I also need to take painkillers after due to pain. Not recommended for people who just want a relaxing chill massage.\n\n",
        "Ben\n15 reviews·1 photo\nRated 5.0 out of 5,\nNeed a professional massage? This is the place to go to! Decent pricing and the masseuse always does a great job! Clean place too!\n\n",
        "Jun\n4 reviews\nRated 1.0 out of 5,\nMostly painful when the masseuse press even after asking her to press softly. Not sure why the reviews give 4 stars.\n\n",
        "Krishnakumar Selvaraj\nLocal Guide·12 reviews·18 photos\nRated 5.0 out of 5,\nI feel good for their massage. I spend 60 dollar for one hour massage. No stressful. Feel better\n\n",
        "Upender Rao\nLocal Guide·45 reviews·17 photos\nRated 5.0 out of 5,\nMy fav massage spot. Good for family as well. Been going there for 10 years now.\n\n",
        "Jack Le\n3 reviews\nRated 5.0 out of 5,\nThis is always my go-to massage place. I've been visiting this place monthly to relieve my my muscle pain in shoulder, back and neck. I would recommend Jasmine as my favorite but other masseurs are also very nice. Thank you!\n\n",
        "Yashwant Aditya\n4 reviews·2 photos\nRated 4.0 out of 5,\nStaff are good and well trained. Frankly, my first experience was awesome but last one was definitely not..\n\n",
        "Kevin\n15 reviews·3 photos\nRated 5.0 out of 5,\nLegit clean and good massage place.\nDoes a good job to ease my muscles aches and \"cracking\" / loosening my joints.\n\n",
        "Jane 서현 Park\nLocal Guide·113 reviews·83 photos\nRated 2.0 out of 5,\nI had jasmine as my masseuse and she was so kind and strong. She tailors it according to where you feel more need for. It was so good i initially paid for 60 min and extended it to 90. Strongly recommend!\n\nEdit: went a second time, had a different lady and it felt like she was just going thru the motions instead of truly massaging. Didnt feel that great after paying a steep 75 dollars for 90 min. Waste of money and time\n\n",
        "Woo Cher Chong Joe\nLocal Guide·60 reviews·689 photos\nRated 5.0 out of 5,\n2nd time over period of 6 days to relief my super tensed muscle, from shoulder to calves. It's definitely a place to recommend.\nWill be returning for few more sessions to lessen especially tight calves which is affecting my walking normally.\n\n",
        "Catherine Chien\n17 reviews·1 photo\nRated 4.0 out of 5,\nNo frills thai massage - quality of the massage was high and the price was reasonable. The masseuse put her knees on my super stiff back and that helped loosen up the knots. Deco could be improved.\n\n"
    ],
    "Phone": "6294 0139",
    "Website": "http://www.healingthaimassage.com.sg/contact-us",
    "Message": null
}