{
    "Name": "Lyna Viet Massage & Spa\n",
    "Products": {},
    "Address": "33 Erskine Rd, #01-07 The Scarlet Hotel, Singapore 069333",
    "Opening Hours": "Saturday 9:30am–10:30pm\nSunday 9:30am–10:30pm\nMonday 9:30am–10:30pm\nTuesday 9:30am–10:30pm\nWednesday 9:30am–10:30pm\nThursday 9:30am–10:30pm\nFriday 9:30am–10:30pm\nSuggest new hours",
    "Rating": "4.9\n50 reviews",
    "Reviews": [
        "chetna vatsa\nLocal Guide·13 reviews\nRated 5.0 out of 5,\nI wish there was an option to give more than 5 stars to this place. BEST FOOT MASSAGE i have ever received by Simon here. I was feeling like walking on  clouds after that foot massage. Absolutely amazing! It is not a very private place therefore I have only tried foot massage here but my partner have tried full body massage as well and he was very happy with the service. The staff is very polite and they put a timer for the massage duration for complete transparency. Pricing is very reasonable too.\n\n",
        "Everly Toribio\n2 reviews\nRated 5.0 out of 5,\nI've got my 90mins. Foot massage done by Simon.  And it was perfectly amazing. He is very gentle. The ambiance of the spa is a totally relaxing feels. Thank you for a job well done 💋\n\n",
        "L A\n12 reviews·3 photos\nRated 5.0 out of 5,\nGreat massage at a great price. Tried the 60 minute foot massage, which made me feel like walking on clouds, and the full body massage, which was 90 minutes of pure relaxation, after which i felt amazing! Can absolutely recommend, very clean and professional place.\n\n",
        "chetna vatsa\nLocal Guide·13 reviews\nRated 5.0 out of 5,\nI wish there was an option to give more than 5 stars to this place. BEST FOOT MASSAGE i have ever received by Simon here. I was feeling like walking on  clouds after that foot massage. Absolutely amazing! It is not a very private place therefore I have only tried foot massage here but my partner have tried full body massage as well and he was very happy with the service. The staff is very polite and they put a timer for the massage duration for complete transparency. Pricing is very reasonable too.\n\n",
        "Everly Toribio\n2 reviews\nRated 5.0 out of 5,\nI've got my 90mins. Foot massage done by Simon.  And it was perfectly amazing. He is very gentle. The ambiance of the spa is a totally relaxing feels. Thank you for a job well done 💋\n\n",
        "L A\n12 reviews·3 photos\nRated 5.0 out of 5,\nGreat massage at a great price. Tried the 60 minute foot massage, which made me feel like walking on clouds, and the full body massage, which was 90 minutes of pure relaxation, after which i felt amazing! Can absolutely recommend, very clean and professional place.\n\n",
        "Shalini Wimal\n1 review\nRated 5.0 out of 5,\nExcellent full body massage! The hot stones and warm pillow felt amazing :) Not very private, but the price and massage makes up for it.  Will definitely try the foot massage too next time.\n\n",
        "Joshua Simon\n4 reviews·1 photo\nRated 4.0 out of 5,\nReally good massage, but I really hate the fact that there wasn't any privacy. I could see the person opposite and had no way of changing in the area without customers looking at me. Please improve on the privacy of each booth. I think it's best to cover up totally.\n\n",
        "YC Tsang\nLocal Guide·29 reviews·38 photos\nRated 5.0 out of 5,\nWent there after seeing all the good reviews.\nHad a very relaxing full body massage at a valued price. Lack of privacy for full body massage but for this price and quality, it's okay for me.\n\n",
        "Nadzrul Akmal\n4 reviews\nRated 5.0 out of 5,\nVery professional, very skillful. My wife and me really enjoyed ourselves. Highly recommended. Kelly & Cindy are superb.\n\n",
        "Musho Pea\nLocal Guide·1,125 reviews·6,379 photos\nRated 5.0 out of 5,\nCindy really tries to ease all your tensions away. I feel much lighter after my massage.\n\nFor $66 and 90min, I feel it's one of the more affordable massages, however the space is cramped and tiny.\n\nBut the massage is still very good and they use hot stones and hot cushions which is very relaxing.\n\n",
        "Haida Ismail\nLocal Guide·71 reviews·65 photos\nRated 5.0 out of 5,\nJust had a foot massge at Lyna Vietnam Massage & Spa. Been quite a few foot massage around this area including People's Park, and I think I found that suits my liking. The staffs was very welcoming. My masseur was called, Simon. He's a wonderful masseur and makes me feel relax. There are some bruises on my knee and he is very careful with it. At the end of the message, he applied some ointment on my bruised knee and gently rubbed on it - appreciate this little thing. I will definitely come back again !\n\n",
        "Ace Max\n2 reviews·7 photos\nRated 5.0 out of 5,\nGood service with good masseuse. My back pain, after the hot stone massage with cupping, it healed 80%. Keep up the good work and will recommend more people here.\n\n",
        "Dave Wang\n1 review\nRated 5.0 out of 5,\nMy first visit and was Assigned to Kelly. She is very professional, applied enough strength and paid attention to pressure points. Highly recommended !\n\n",
        "May Tan\n1 review\nRated 5.0 out of 5,\nI came twice for foot and shoulders massage, service done by Simon. Excellent service, really make me relax. Keep up the good service 👍\n\n",
        "Scarlet La\n1 review\nRated 5.0 out of 5,\nIt was nice.\nI visit twice. Every massager was nice and had good skills. In additionally I was happy with not crowded and quite mood\n\n",
        "Maiko Watanabe\n1 review\nRated 5.0 out of 5,\nCindy is very good. Kelly also helped me do a full body massage and is highly recommended.\n\n",
        "Suzannah Abraham\nLocal Guide·23 reviews·132 photos\nRated 5.0 out of 5,\nHave you’ll tried Vietnamese massage? This place is underrated! Excellent service with reasonable price. Our new favourite massage place in the City!\n\n",
        "Restless Buddha\nLocal Guide·153 reviews·1,002 photos\nRated 5.0 out of 5,\nAmazing experience, please take the hot stone!\n\n",
        "Keithon Ng Jun Hao\n1 review\nRated 5.0 out of 5,\nSimon is a very courteous gentlemen providing services with his heart, highly recommend this place\n\n",
        "Ang Chee Beng\n1 review\nRated 5.0 out of 5,\nIvy is the good massage girl she did good massage  for me tks\n\n",
        "Zhi. Sheng Li\n2 reviews·63 photos\nRated 5.0 out of 5,\nIvy is a good masseuse. Strongly reccomend!\n\n",
        "Soh Eric\n1 review\nRated 5.0 out of 5,\nIvy is very professional, nice to chat , recommended\n\n"
    ],
    "Phone": "6980 0769",
    "Website": "http://www.facebook.com/vietmassagespa",
    "Message": null
}