{
    "Name": "NING Foot & Back Massage Spa\n",
    "Products": {},
    "Address": "78 Airport Boulevard #04 - 215 / 216 Jewel, Singapore Changi Airport, 819666",
    "Opening Hours": "Tuesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nWednesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nThursday Closed\nFriday 11am–9pm\nSaturday 11am–9pm\nSunday 11am–9pm\nMonday 11am–9pm\nSuggest new hours",
    "Rating": "4.7\n121 reviews",
    "Reviews": [
        "Alicia\n1 review\nRated 5.0 out of 5,\nFirst time leaving review. first time visiting this spa. Spontaneous visit. Firm but relaxing 60 mins back and shoulder massage. Paid $72. They sanitised after each customer.\nI had a tight neck muscle on my left. Left the place with more relax shoulders. Only me and other customer on Thur late afternoon. They have lowered the price. Remember to refer to the printed copy pasted in front of counter as good. Copy on Google review is outdated.\nWill visit again.\n\n",
        "Sie Yen Ng\n1 review\nRated 5.0 out of 5,\nDiscovered this gem at Jewel today. My masseuse, Irene, was super nice, friendly, working hard on all my knots, especially where I told her that I was feeling sore. The ambience was really relaxing and I could just sink into the very comfortable chair. Irene told me their business is very badly affected by the pandemic though. Do support them!\n\n",
        "The Pink geEk\n1 review\nRated 5.0 out of 5,\nThe massage was very relaxing. Irene did a very good job and all my aches melted away. Thank you. The place is also very relaxing and i loved their tea. Will be coming back.\n\n",
        "Alicia\n1 review\nRated 5.0 out of 5,\nFirst time leaving review. first time visiting this spa. Spontaneous visit. Firm but relaxing 60 mins back and shoulder massage. Paid $72. They sanitised after each customer.\nI had a tight neck muscle on my left. Left the place with more relax shoulders. Only me and other customer on Thur late afternoon. They have lowered the price. Remember to refer to the printed copy pasted in front of counter as good. Copy on Google review is outdated.\nWill visit again.\n\n",
        "Sie Yen Ng\n1 review\nRated 5.0 out of 5,\nDiscovered this gem at Jewel today. My masseuse, Irene, was super nice, friendly, working hard on all my knots, especially where I told her that I was feeling sore. The ambience was really relaxing and I could just sink into the very comfortable chair. Irene told me their business is very badly affected by the pandemic though. Do support them!\n\n",
        "The Pink geEk\n1 review\nRated 5.0 out of 5,\nThe massage was very relaxing. Irene did a very good job and all my aches melted away. Thank you. The place is also very relaxing and i loved their tea. Will be coming back.\n\n",
        "Jas Pn\n9 reviews\nRated 1.0 out of 5,\nLousy back and foot massage, feels like a back rub than massage. Therapists does not ask if the massage strength is ok or not. Don't feel any relief after the massage, will not visit again.\n\n",
        "Chay Daniel\n1 review\nRated 5.0 out of 5,\nToday my family had 03 masseurs (May, Irene & Koo) for Foot Massages. It was good, professional and friendly. The ambience was nice. Definitely will go back again\n\n",
        "Hermann Loy\nLocal Guide·52 reviews·155 photos\nRated 5.0 out of 5,\nHad the 70min Foot and Back massage before my Long flight. Karen was my therapist and she did a amazing job of working out the knots. Flying, especially in economy Long haul puts a lot of pressure in the lumbar area so it was good to get some relief before another Long haul flight. Ambience and setting is nice.\n\n",
        "KD is Kindness Daily\n4 reviews·2 photos\nRated 5.0 out of 5,\nWonderful soothing massage from June in a beautiful professional location. What a treat! Thank you June and staff for being open and available during this special time in the world.\n\n",
        "aria eu\n3 reviews\nRated 5.0 out of 5,\nAwesome and therapeutic experience at Ning spa!😍\nHighly recommend (Irene) for foot and leg massage,\nShe’s my fav masseur♥️\nShe’s has very warm personality and she will share with you the details of our leg and feet so we know better why are certain parts so sore💯\n\n",
        "Yuri Ko\n9 reviews\nRated 5.0 out of 5,\nGood atmosphere and quiet. Very relaxed and rejuvenated after the 40 mins massage.\n\n",
        "Olivier Le Sayec\n11 reviews·12 photos\nRated 2.0 out of 5,\nHad an overpriced foot massage for 1 hour. The massage was average and they let you clean your feet by yourself at the begining of the session.\nI gave my card and realised that they have charged me $85 (or $10 more than advertised). I asked for rectification and got just $5 back.\nThey advertise $75 but have a hand written tiny note that say (exl of 7% gst).\nOverall, i felt ripped off by this massage place.\n\n",
        "Jolyne Tan\n2 reviews\nRated 5.0 out of 5,\nThe massage was great by the therapist Irene. The amount of pressure was just on-point and relaxing!\n\n",
        "hanwei ng\n5 reviews·1 photo\nRated 5.0 out of 5,\nGood massage, clean and great environment! Receptionist is super friendly\n\n",
        "Meli\n7 reviews·1 photo\nRated 4.0 out of 5,\nWe opted for the 100 minute massage today - the service is good. My therapist got rid of the tight knot at my back which I really appreciate. I'd recommend dropping by the place when you're in Jewel.\n\n",
        "Simin Liu\n6 reviews\nRated 1.0 out of 5,\nWent for a foot spa and it an extremely poor experience. It was already strange at the start that we had to dry our own feet after the foot bath and the spa scrub was outright painful. Therapist did not pay attention to blisters or cuts on the feet and pulled the skin off a fresh blister. Would not return\n\n",
        "Angela Ng\nLocal Guide·96 reviews·62 photos\nRated 2.0 out of 5,\nShould have paid more attention to the reviews. Lots of 5 star reviews by people who only have one review on their profiles... 😒\n\nThere's only a single masseuse who doesn't seem to know what she's doing. Lots of pressing with thumbs on the same spots. I left feeling more sore than refreshed. Didn't seem to know how to adjust the chair properly either, which left me seated in an uncomfortable position.\n\n",
        "nur hafizah\n1 review\nRated 5.0 out of 5,\nGreat foot reflexology done by Mary. The pressure is fantastic and the strokes of the massage was good. Recommended place to go for the quick fix for the tired feet!\n\n",
        "Avelyn Cho\n1 review\nRated 5.0 out of 5,\nLooking for a massage place with hubby and chances upon NING FOOT & BACK SPA. Chosen a 40 min back and shoulder massage, therapists are KATHERINE and KAREN. They are very professional, it was so comfortable and techniques used were great. Place is clean and music is soothing.\n\n",
        "Charli Mocon\n5 reviews·1 photo\nRated 1.0 out of 5,\nDecided to get the 60min shoulder and back massage despite it being a bit pricey. The chair wasn't adjusted properly and incredibly uncomfortable. The 'massage' was a back rub at best and gave me zero relief from the knots in my neck and shoulders.\nCouldn't wait for it to be over. Easily the worst massage I've ever had.\n\n",
        "michelle yow\nLocal Guide·35 reviews·43 photos\nRated 5.0 out of 5,\nGreat massage skills! Went in to get my very sore back and shoulders sorted and the therapist did not disappoint at all! She found every knot and sore point and after 40 minutes, my back felt so much 'lighter' and the soreness has completed disappeared. Highly recommend this spa joint\n\n",
        "Annie Cahill\n1 review\nRated 5.0 out of 5,\nIrene, Jason, and Katherine were truly wonderful. After months of living in a developing country under stressful circumstances, it was lovely to be brought back with a massage here. Irene was able to relieve a lot of stress and I feel great.\n\n"
    ],
    "Phone": "6612 1313",
    "Website": "https://ningspa.com/",
    "Message": null
}