{
    "Name": "Oriental Therapy Pte Ltd\n",
    "Products": {},
    "Address": "354 Alexandra Rd, #01-16 Alexis on, Singapore 159948",
    "Opening Hours": "Tuesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nWednesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nThursday Closed\nFriday 9am–10:30pm\nSaturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.7\n115 reviews",
    "Reviews": [
        "Bonan Zhang\nLocal Guide·233 reviews·1,039 photos\nRated 5.0 out of 5,\nHad my chiropractic here, very experienced chiropractor, she knows where is my pain spot and how to relieve my pain. Cupping/guasha is complementary, too. Very worthy. The shop is nicely decorated, free bottled waters are provided, will definitely visit again.\n\n",
        "Juz Interior\n2 reviews\nRated 5.0 out of 5,\nI went for Tuina for the first time, upon following my husband. I was not really into massage and stuff, but after this session i can really feel my body was lighter, relaxed, and overall better. The therapist is friendly and helpful, so does the receptionist. She knows what she pressed, not just simply rub. Will come again for more session\n\n",
        "Tamago\n20 reviews\nRated 5.0 out of 5,\nClean environment and polite staff who were not pushy. Tuina massage was good (painful but that is what tuina is). Will recommend Le Le and Rachel! Do call to book a slot before heading down. For those who are driving, you can park in the condominium's carpark.\n\n",
        "Bonan Zhang\nLocal Guide·233 reviews·1,039 photos\nRated 5.0 out of 5,\nHad my chiropractic here, very experienced chiropractor, she knows where is my pain spot and how to relieve my pain. Cupping/guasha is complementary, too. Very worthy. The shop is nicely decorated, free bottled waters are provided, will definitely visit again.\n\n",
        "Juz Interior\n2 reviews\nRated 5.0 out of 5,\nI went for Tuina for the first time, upon following my husband. I was not really into massage and stuff, but after this session i can really feel my body was lighter, relaxed, and overall better. The therapist is friendly and helpful, so does the receptionist. She knows what she pressed, not just simply rub. Will come again for more session\n\n",
        "Tamago\n20 reviews\nRated 5.0 out of 5,\nClean environment and polite staff who were not pushy. Tuina massage was good (painful but that is what tuina is). Will recommend Le Le and Rachel! Do call to book a slot before heading down. For those who are driving, you can park in the condominium's carpark.\n\n",
        "Alvin Lau\n1 review\nRated 5.0 out of 5,\nIt's not easy to find great foot reflexology that meets expectations but Oriental Therapy quite literally hits the spot! My masseuse Joyce was great - applying the right amount of pressure and ensuring I was comfortable throughout. Cozy interiors and warm, friendly staff. 10/10 will come back and am considering signing up for a package when I do.\n\n",
        "Kok Heng Kam\n3 reviews\nRated 5.0 out of 5,\nI went for the first time after 2 friends both recommended Susan. I got preexisting condition n Susan take note about that seriously. She is able to identify what are my issues, and relieving them. Staff are all friendly and helpful. Will be back for more session.\n\n",
        "Eliz Kuan\n1 review\nRated 5.0 out of 5,\nMy back pain had troubled me for a long long time. I have been searching for a good chiropractor but to avail. I found them and tried their service, it works perfectly for me. The pain is gone and I have adjusted my backbone and it’s better than before.\n\nThey have TCM treatment and massage too\n\nHighly recommended to try out their treatments. It might cure your body ache and give you a healthy body too.\n\n",
        "Fiona Leong\n9 reviews·3 photos\nRated 5.0 out of 5,\nCame across Oriental Therapy while searching on Google for Tuina Massage located nearer to the west as I plan for treatment on weekdays after working hours to destress.\n\nReached out to them via WhatsApp message on last Monday afternoon, Amelia was very quick to respond. They have female masseuse which matches my own preference, Orthopedist too. She is very helpful in giving recommendations to what kind of treatment is suited for me and my partner. E.g. Mentioning that if having muscle pain or sore, she recommends normal Tuina, as for me I have a permanent swell hence she recommend orthopedist but only if I'm comfortable.\n\nI made an appointment with her for the next day evening. Location-wise, it is easy to find - one of the shops located right along Alexis Condo (nearest MRT station will be Queenstown). We drove there so there is no problem parking at the condo carpark with ease. Went in being surprised with how spacious, relaxed and calm setting they have!\n\nI personally really enjoy my Tuina experience with Elaine and for my partner (his first time trying out Tuina) with LeLe. Also get to try cupping for my very first time!\n\nAlso chatted a little and got to know they were previously located at Club Street and has been around for 22 years.\n\nThank you Amelia, Elaine and LeLe once again for the great experience!\nWill recommend to others and come back again.\n\nFiona\n\n",
        "Alexis Loo\n1 review\nRated 5.0 out of 5,\nPlace is clean and nicely decorated. The masseuse was great as well - she checked in on me from time to time, asking if the pressure was ok and if I was feeling cold. Left the place with my stiff neck, shoulders and back gaining a new lease of life!\n\n",
        "suxian soo\n1 review\nRated 5.0 out of 5,\nMy therapist was very skilled and managed to release my knots and cures my aches! Highly recommend and would definitely return.\n\n",
        "Jewel Angy\nLocal Guide·54 reviews·77 photos\nRated 5.0 out of 5,\nVery clean and well decorated place..\nI've this massage lady name Alice.. she is very professional and able to spot on my \"frozen shoulder\" and tui na in order.  Thumbs up :)\n\n",
        "Chih Chwen Heng\n1 review\nRated 5.0 out of 5,\nNot a fan of tui na massages, so I asked for a gentle therapist and it was a great experience. She was skillful and attentive, constantly checking in to make sure the pressure was good and my problem areas (neck and back) was properly treated. Bought a $500 package after and have been coming back regularly.\n\n",
        "Olivia Lim\n1 review\nRated 5.0 out of 5,\nHardly one to do write a review but I totally feel this place deserves a good write-up - their staff are polite and I had a superb experience with Alice.\n\nI have a desk-bound job and pretty much on my computer/phone most times thus the stiff shoulders, knots all over and Alice was very specific to target those knots (btw, my knots are really very tight and deep)\n\nWhat I loved about it was that, it wasn't one of those massages that's too light, too fast or too rough - she was quick to share with me what are the problematic areas on the body.\n\nIt was a very good massage altogether and I am looking forward to my next week's appointment with Alice!\n\n",
        "Joelle Ng\n3 reviews\nRated 5.0 out of 5,\nBeen there a few times but tried essential oil therapy this time for the first time; very impressive, smooth and relaxing. The price of it is fair and staff are all polite and professional. Would recommend visit this nice place and to try their essential oil therapy\n\n",
        "Joanna T\nLocal Guide·36 reviews·254 photos\nRated 5.0 out of 5,\nI’ve had chronic shoulder issues for many years, and with a job that requires me to be in front of a computer regularly, I am constantly experiencing pain in my shoulders. I have tried many other Tuina places in the past, but was never able to find any therapist that can help with my pain as well as Alice has.\n\nI’ve frequented Oriental for the past 1.5 months weekly and the pain has become a lot more manageable. Alice always makes me feel at ease. Her tuinas are forceful and will not provide a relaxing session that some people might expect, but to me it’s necessary. I consistently feel refreshed after every session, and the discomfort in my shoulders do not return so quickly (this is something I’ve noticed with other Tuina places, which suggests they might only be providing temporary relief).\n\nThe space is conveniently located, very clean, and easy to make an appointment. At $64 for a 1-hour session, their rates are also affordable and comparable to other establishments.  I will definitely recommend them, be sure to look for Alice!\n\n",
        "JJ C\n1 review\nRated 5.0 out of 5,\nChiropractor Susan and Masseur LuLu are great; Shoulder pain was relieved after one treatment; Will definitely visit again;\n\n",
        "Prayas Gautam\n2 reviews\nRated 5.0 out of 5,\nI did the tuina plus the cupping therapy. They were very professional and did the massage very nicely. Would recommend it to others as well. Definitely going there for my next appointment.\n\n",
        "wahlaueh anyhow\n10 reviews·11 photos\nRated 3.0 out of 5,\nMy go-to tuina place for the past 1 year. Frequent this outlet at least once a month without package. Staff turnover is quite high so I always get a different masseur every time. The skills of the masseur vary so it's really a hit or miss if you don't have a regular one, but out of 15 times visited- it's about 30% of the time I got a less skillful massage experience, the rest was fine\n\nThey have 2 outlets- with the smaller one at tiong baru and the rooms there are also more squeezy.\n\nRooms are quite clean however they only have a mixed toilet in the premise so gotta queue up during peak hours.\n\nRecommend to book if you are coming during the weekends!\n\n",
        "Sharon Jieling\nLocal Guide·8 reviews·91 photos\nRated 5.0 out of 5,\nSusan, the senior orthopedic, is extremely professional and cares for her patients. She is dedicated in treating the problems and focuses on helping her patients feel better.\n\n",
        "Carina Lim\n3 reviews\nRated 5.0 out of 5,\nPlace is serene and relaxing. My therapist, Alice kept her room clean, cares for her customers’ well being and dedicated in solving my body aches. My health has certainly improve under her care. Thanks Alice for help. 谢谢。你最棒！\n\n",
        "Alice Goh\nLocal Guide·14 reviews·28 photos\nRated 5.0 out of 5,\nThe therapist very professional here. Checked my needs, could kwa sha and chi guan too. Super happy and satisfied\n\n"
    ],
    "Phone": "6334 1678",
    "Website": "https://orientalthsg.com/",
    "Message": null
}