{
    "Name": "Precious Foot Reflexology - Massage | Tui na | Foot Massage | Gua Sha - Toa Payoh\n",
    "Products": {
        "40 mins Foot Reflexology + 20 mins Back & Shoulder": "$58.00",
        "60 mins Foot Reflexology + 30 mins Back & Shoulder Massage": "$70.00",
        "Back & Shoulder Massage": "$38.00 – $58.00",
        "Body Massage": "$45.00 – $112.00",
        "Ba Guan (20mins)": "$38.00",
        "90 mins Foot Reflexology + 30 mins Back & Shoulder Massage": "$90.00",
        "Foot Reflexology": "$28.00 – $75.00"
    },
    "Address": "177 Toa Payoh Central, #01-134, Singapore 310177",
    "Opening Hours": "Tuesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nWednesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nThursday 10am–10pm\nFriday 10am–10pm\nSaturday 10am–10pm\nSunday 10am–10pm\nMonday 10am–10pm\nSuggest new hours",
    "Rating": "4.7\n203 reviews",
    "Reviews": [
        "hakasson\n3 reviews·1 photo\nRated 5.0 out of 5,\nIt's my very first massage experience here. I was warmly welcomed by a friendly and spontenous lady, introduced herself as Linda.  Front desk counter linda is professional, prompt and quick to attend to customers. Even though the place is almost full, she is very professional, always carry a smiling face. The Chinese massue did an awesome job! Had a 2 hour body massage with Sandalwood Essential Oil. Massaue's techniques are really excellent. Room is clean and tidy with soothing music. Definitely will return for massage again!\n\n",
        "Guay Gen Phua\n5 reviews·5 photos\nRated 5.0 out of 5,\nWent there first time after seeing some good reviews and did not disappoint! Jackson was explaining in detail the different parts of foot massage linking to the bdifferent body parts. He's very skilled and did not\njust use brute forces like some other massage place. No hard sell, will recommend! Thanks for the great massage!\n\n",
        "Natalie Tay\n1 review\nRated 5.0 out of 5,\nChanced upon this gem on google and requested for Jackson due to the many good reviews here. On my first visit, my main concern was to resolve my excruciating daily migraine which recently worsened. 1 week later, my migraine is almost 90 percent cured. Today was my second visit and I opted for the 2 hour body therapy addon 0.5 hrs to slim my bloated and protruding tummy due to stagnated qi and water. And to my astonishment, he managed to flatten my tummy significantly within half an hour. It has never been so flat in 2 years! Another thing which amazes me is that he is able to pinpoint and target problem areas instantly, instead of the systematic steps (123, abc) monotonous massages offered in many other places.\n\n",
        "hakasson\n3 reviews·1 photo\nRated 5.0 out of 5,\nIt's my very first massage experience here. I was warmly welcomed by a friendly and spontenous lady, introduced herself as Linda.  Front desk counter linda is professional, prompt and quick to attend to customers. Even though the place is almost full, she is very professional, always carry a smiling face. The Chinese massue did an awesome job! Had a 2 hour body massage with Sandalwood Essential Oil. Massaue's techniques are really excellent. Room is clean and tidy with soothing music. Definitely will return for massage again!\n\n",
        "Guay Gen Phua\n5 reviews·5 photos\nRated 5.0 out of 5,\nWent there first time after seeing some good reviews and did not disappoint! Jackson was explaining in detail the different parts of foot massage linking to the bdifferent body parts. He's very skilled and did not\njust use brute forces like some other massage place. No hard sell, will recommend! Thanks for the great massage!\n\n",
        "Natalie Tay\n1 review\nRated 5.0 out of 5,\nChanced upon this gem on google and requested for Jackson due to the many good reviews here. On my first visit, my main concern was to resolve my excruciating daily migraine which recently worsened. 1 week later, my migraine is almost 90 percent cured. Today was my second visit and I opted for the 2 hour body therapy addon 0.5 hrs to slim my bloated and protruding tummy due to stagnated qi and water. And to my astonishment, he managed to flatten my tummy significantly within half an hour. It has never been so flat in 2 years! Another thing which amazes me is that he is able to pinpoint and target problem areas instantly, instead of the systematic steps (123, abc) monotonous massages offered in many other places.\n\n",
        "Isha Edzy\n1 review\nRated 5.0 out of 5,\nMy 3rd time visit . It was never a disappointment !! Their professional masseuse , Jason , can explain in detailed the pains u had & the caused of it n even give advises ! Not every masseuse can do that , thumbs up 👍👍👍👍👍👍, & thank you 🙏🙏 will definitely return again ✌️✌️\n\n",
        "Joseph Tan\n2 reviews\nRated 5.0 out of 5,\nGreat massage experience! My assigned masseur was Mr. Chong and he was professional and polite. I really enjoyed my 1 hour foot massage. The 3 very friendly ladies at the counter were very courteous as well! Love the cosy environment! Keep it up!\n\n",
        "jaswinder kaur\n1 review\nRated 5.0 out of 5,\nI would highly recommend massuer Jackson from TP outlet. He is so experienced in his skills that I feel very comfortable & relaxed when he massages my legs & feet. He doesn't make it painful for me and uses the right strength & acupressure to help resolve my issue of poor blood circulation. I can say that definitely my legs feel much better after each message session. Thks Jackson.\n\n",
        "Roseanne Peh\n11 reviews·2 photos\nRated 5.0 out of 5,\nThis is my first Visit to this outlet due to neck strain and purchased 45 mins for neck shoulder treatment. Jackson is very good masseur and help to resolve my issue. He also identified that I have vertigo in which I did not even realised myself (I do have height phobia + easily get dizziness) His acupressure skills were good and no need to apply medicated oil. Will look for him again to resolve my vertigo issue! Price there is reasonable!\n\n",
        "Wong Teck Jung\nLocal Guide·197 reviews·327 photos\nRated 4.0 out of 5,\nI have been a patron of this massage center. Most masseurs are good and provide comfortable massages (foot massage is highly recommended). One particular masseur (Jackson) has good skill for head and shoulder massage.\n\n",
        "Woi Cye Lee\nLocal Guide·74 reviews·9 photos\nRated 5.0 out of 5,\nHad a massage from Jackson. I went to do a massage with ba guan as I suddenly lost hearing on left ear. I tried ENT and ate steroids. Just feel like to try tcm way. Surprisingly after Jackson's ba guan, I recover on the next day. Strongly recommend Jackson. He is good and experienced.\n\n",
        "Shira Imura Rozali\n2 reviews\nRated 5.0 out of 5,\nJust had my Prenatal massage. Ivy is quite good. Feel very relaxed and actually fall asleep. Really enjoyed the experience. Thank you so much. Will discuss with husb if will sign up for a package.\n\n",
        "CHUI WEN Annie Yap\n1 review\nRated 5.0 out of 5,\nIs quite a good experience for me & my mother in law. We’ve enjoyed it so much for our 60mins foot + 30mins neck & shoulder. My masseuse Jackson & my mother in law have met a malay masseuse really help alot to soothe the stiffness of our foot & shoulder.\n\n",
        "hau teng\n5 reviews·4 photos\nRated 5.0 out of 5,\nHad a 2 hours full body message session with masseur Jackson.\nHe is very professional and knowledgeable. His skilful techniques helped greatly in relieving my long backache and stiff shoulder. Strongly recommended and will be back again 👍\n\n",
        "ChauChyi Tai\n5 reviews\nRated 5.0 out of 5,\nJackson is a very excellent and professional therapist. I have experienced long period of lower back pain. He has resolved all of my problems. High recommending him.\n\nJackson is very skillful in treatment of 经络推拿，a very effective TCM treatment of pain relief as well pain recovery.\n\n",
        "Ruwi MK\nLocal Guide·22 reviews·32 photos\nRated 5.0 out of 5,\nBlessings to Jackson. I came here because of the google reviews, thought I’d take a chance. My legs were swollen, and for weeks I’ve felt fatigue, lack of energy. Jackson was amazing, he knew most of the issues I had and after the foot reflexology I felt so much better. Very healing! Thank you so much!!\n\n",
        "Bell Flower\n1 review\nRated 1.0 out of 5,\nIt was the worst massage I ever encountered theres ' The lady masseur does not have any technique. The pressure used was wrong, and she pinched the calf instead of pressing on them .  She doesn’t have any idea what she’s doing. My legs felt much more painful after visiting them. It’s unfair n unethical for the shop to send an untrained masseur just cos they are busy yet want business. Disappointed 😡\n\n",
        "Edward Lee W Y\n3 reviews\nRated 2.0 out of 5,\nMasseurs are good. problem is the counter staff who is quite absent minded and in conflict with the masseurs sometimes which ruins the massage experience. Hard to get appointment slots from the counter lady wearing specs.\n\n",
        "Jacyln Tan\n3 reviews\nRated 5.0 out of 5,\nWent to do foot, neck and shoulder massage. Mr Chong is able to use the right strength and pin point to the area that I am facing issues and tips on how to make it better. Thanks Mr Chong:)\n\n",
        "Syafiqah Suhaimi\n3 reviews\nRated 5.0 out of 5,\nWent over a few days ago! I was searching on Google the best reflexology place nearby. I somehow injured my foot and was unwell for two weeks, had to take a lot of medicine, on bed rest for 7 days and went to the doctor 3 times.. so I finally decided to go for a foot massage to see if it would help. It has been a few days after the massage and amazingly my foot has recovered like 90%! I would like to thank Jackson so much for attending to my needs and making sure that I will heal faster and better :) He definitely knows his forte! I recommend you to ask for Jackson when you come over/or make an appointment as he really takes care of the client. He also knew the problem as soon as he started the massage. Turns out I'm just very dehydrated and also overweight haha! I really have him to thank as if it wasn't for him I would still be on MC. Didn't have any cash on me to give tips but I'll be sure to give some the next time I'm there :) Thanks so much, he's a keeper, I hope you'll give him a raise! (Went to the TPY Outlet)\n\n",
        "Kiam Chew Sim\n1 review\nRated 5.0 out of 5,\nLast Night went to here at 8.40pm with my boss and colleague.Meet a foot massage shifu call Jackson.He is really very knowleagable & well versed in this line.Know exactly where your body pain is while by massaging your foot.Highly recommended!\n\n",
        "Yiwen Gan\n1 review\nRated 5.0 out of 5,\nTried the foot and neck massage by Jackson. The massage is great, and my neck ache felt much better. Strength is good too, recommended !\n\n",
        "candy Lee\n1 review\nRated 5.0 out of 5,\nI suppose to feedback 2 to 3 weeks ago.\nI went to this place 4 times already . Each time the service is always good.  The last time I went is a Saturday with my sister. The lady that handle me is very good . At the end of the session I ask for her name. She told me she is Teresa, I was surprise as I knew the boss of this company is Ms Teresa . I am so lucky abs thank her for the services.\nThis place the staff is very good in massage . They have package but they never hard sales , this is the best part.\nI will continue to support this place. On the outside it look like a small place but they have 2nd level with lots of room.\nThe boss and staff all have good skill and the place is comfortable .\n\n",
        "Qi Lun Tan\nLocal Guide·20 reviews·85 photos\nRated 5.0 out of 5,\nTook combo 1 - 40 mins foot massage and 20 mins - neck and back massage. Overall is a good massage by Hong Mei and Joyce. Strength is adequate. Will visit again.\n\n",
        "Ong Xue Ting\nLocal Guide·19 reviews·27 photos\nRated 4.0 out of 5,\nGood service, felt the tension release with the massage strokes.\n\nPS - minused one star because they made customers input 5 stars for the review.\n\n",
        "C Ng\nLocal Guide·115 reviews·211 photos\nRated 1.0 out of 5,\nwhatsapp for appt..more than a day had past and did not receive any response. business so good until can't be bothered? saw gd reviews initially and thought of visiting but now my opinion changed. foc give me i also don't want.\n\n",
        "Victoria Huang\n5 reviews·2 photos\nRated 5.0 out of 5,\nHad the best reflexology here with my therapist, Albert. He really focused on the pain points of my feet, and spent time to fix them. Really rare for any reflexology session, which is usually more of an overall comforting massage. My foot and back feels so much looser and lighter now. Highly recommend!\n\n",
        "Sanskar D. Verma\n5 reviews\nRated 5.0 out of 5,\nUncle Richard is the best. He is 70 but is stronger than me. He is highly skilled and really loves his job. I felt renewed after coming out after foot, shoulder and neck massage. This place is highly recommended.\n\n",
        "Irene Zhuang\n1 review\nRated 5.0 out of 5,\nHave been coming to Theresa for a year plus for body treatments. The masseurs are really good and the admin staff are friendly, especially Evon.\n\n",
        "Bryan Toy\n5 reviews·4 photos\nRated 5.0 out of 5,\nNice quaint establishment with great overall atmosphere.\nMasseur's skill (rani) was excellent - very experienced and able to press with a good amount of pressure to relieve pain points.\nService was great as well. Make sure to book an appointment beforehand, especially on weekends.\n\n",
        "Marites Cabildo\n1 review\nRated 5.0 out of 5,\nI come to this place to do my lower back pain...and i will feel so good..that my massage from jackson was excellent...\n\n",
        "Swister Yong\n2 reviews\nRated 5.0 out of 5,\nI went to their outlet in Toa Payoh many times. Each time was attended by different staff. Their skill are very good\n\nWent 3 weeks ago and was attended by a lady. Her skill is very good especially the back and head massage.\n\nAfter asking her name than I realized she is the boss of the place.\n\nThe outlet have 2 level and the 2nd level with lots of room. So far this is the place I like most with good skill abs environment is clean and comfortable. They also not hard sales their package.\n\nWill continue to support. You can book Thru  their webpage and will have some discount\n\n"
    ],
    "Phone": "6354 1911",
    "Website": "http://www.preciousfoot.com.sg/",
    "Message": null
}