{
    "Name": "Sabaai Sabaai Traditional Thai Massage\n",
    "Products": {
        "Thai Tradition": "$55.00 – $135.00",
        "Thai Signature": "$85.00 – $145.00",
        "Thai Herb": "$95.00 – $145.00",
        "Head Neck Shoulder Massage": "$58.00 – $68.00",
        "Foot Massage": "$40.00 – $90.00",
        "Thai Traditional Massage": "$55.00 – $135.00",
        "Signature Thai Massage (90Mins)": "$115.00",
        "Signature Thai Massage (60Mins)": "$85.00"
    },
    "Address": "49A Boat Quay, Singapore 049838",
    "Opening Hours": "Tuesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nWednesday\n(Lunar New Year)\nClosed\nHoliday opening hours\nThursday Closed\nFriday Closed\nSaturday Closed\nSunday 11am–10pm\nMonday 11am–10pm\nSuggest new hours",
    "Rating": "4.7\n276 reviews",
    "Reviews": [
        "Lilian Tan\n7 reviews\nRated 5.0 out of 5,\nChanced upon this place while looking for massages nearby and picked it solely based on the high Google review ratings. Best decision made! Tried the Thai Aroma massage which has four scents to choose from, and the masseuse really worked hard on those knots in my back 😆 my whole body felt so relieved after 90 min! The staff were really friendly and the place was well decorated. Price is a bit higher than some other common massage parlours I think (?) but totally worth it. Already planning the next trip, and thinking of getting a package 🤭 looking forward to going back there soon!\n\n",
        "SL\n4 reviews·13 photos\nRated 5.0 out of 5,\nWas trawling through reddit for some good places to get a massage and chanced upon this gem. It was defs worth the price and the good reviews! Went for the Thai Signature with my partner and we both loved it. He commented that he would 100% recommend it and he found the massage comprehensive with excellent back manipulation 😍 Just as other commenters remarked, our masseuses managed to hit the right spots with just the right amount of pressure.\n\nMy masseuse (Sophia) was really strong and responsive to my verbal/non-verbal cues. We will definitely be back for more!\n\n",
        "Chia Joel\nLocal Guide·282 reviews·4,421 photos\nRated 5.0 out of 5,\nOne of the best thai massage places you can find here in singapore.\n\nSuper clean place - nice robes for you to change into, toilet though a bit small was clean - had kirei kirei!\n\nThough prices are a little premium as compared to overseas or in JB. You really get a quality full body thai traditional Thai massage that will leave you wanting more.\n\nThey have a chop system as well as you can collect and get discounts if you are a loyal returning customer...\n\nDefinitely book a slot and try it for yourself!\n\n75 for an hour of Thai traditional massage!\n\nOnly bummer is that somehow their payment system doesn't accept contactless paywave options and you have to bring your physical credit card if you'll like to use your credit card to pay!\n\n",
        "Lilian Tan\n7 reviews\nRated 5.0 out of 5,\nChanced upon this place while looking for massages nearby and picked it solely based on the high Google review ratings. Best decision made! Tried the Thai Aroma massage which has four scents to choose from, and the masseuse really worked hard on those knots in my back 😆 my whole body felt so relieved after 90 min! The staff were really friendly and the place was well decorated. Price is a bit higher than some other common massage parlours I think (?) but totally worth it. Already planning the next trip, and thinking of getting a package 🤭 looking forward to going back there soon!\n\n",
        "SL\n4 reviews·13 photos\nRated 5.0 out of 5,\nWas trawling through reddit for some good places to get a massage and chanced upon this gem. It was defs worth the price and the good reviews! Went for the Thai Signature with my partner and we both loved it. He commented that he would 100% recommend it and he found the massage comprehensive with excellent back manipulation 😍 Just as other commenters remarked, our masseuses managed to hit the right spots with just the right amount of pressure.\n\nMy masseuse (Sophia) was really strong and responsive to my verbal/non-verbal cues. We will definitely be back for more!\n\n",
        "Chia Joel\nLocal Guide·282 reviews·4,421 photos\nRated 5.0 out of 5,\nOne of the best thai massage places you can find here in singapore.\n\nSuper clean place - nice robes for you to change into, toilet though a bit small was clean - had kirei kirei!\n\nThough prices are a little premium as compared to overseas or in JB. You really get a quality full body thai traditional Thai massage that will leave you wanting more.\n\nThey have a chop system as well as you can collect and get discounts if you are a loyal returning customer...\n\nDefinitely book a slot and try it for yourself!\n\n75 for an hour of Thai traditional massage!\n\nOnly bummer is that somehow their payment system doesn't accept contactless paywave options and you have to bring your physical credit card if you'll like to use your credit card to pay!\n\n",
        "Aer V\n4 reviews\nRated 5.0 out of 5,\nHighly recommended. The masseuse I had, Li Ping, was very skillful. She was very attentive and was able to find the accurate spots I was having problems with. I had 1hr Traditional Thai + 2hrs Aroma massage. Was a great combo to get rid of all body aches and stiffness. Will definitely return again.\n\n",
        "Weihoe Ow\nLocal Guide·18 reviews·36 photos\nRated 5.0 out of 5,\nFirst time doing Full body Thai massage, and Sabaai Sabaai Traditional Thai Massage provided an excellent experience.\n\nThe place is easy to miss, and you have to lookout for the sign. Overall a good experience!\n\n",
        "Jennifer MacGregor\nLocal Guide·20 reviews·233 photos\nRated 5.0 out of 5,\nSuch great expertise at a great price and a great location. Always friendly and helpful, there are two hour traditional Thai massage is the absolute best for a full body release and loosening.\n\n",
        "Richard Fahy\n60 reviews\nRated 5.0 out of 5,\nTried this place for first time today as my usual place was fully booked. Awesome thai massage, aches and pains gone. Highly recommended\n\n",
        "Kin Jun Lee (Iunius)\nLocal Guide·34 reviews·6 photos\nRated 5.0 out of 5,\nVery good massage service. Place is extremely clean. Nice music and relaxing atmosphere. Price is on higher range but definitely value for money! Highly recommended\n\n",
        "Ahmad Soltani\nLocal Guide·160 reviews·1,238 photos\nRated 5.0 out of 5,\nThe best traditional Thai massage place I've ever been to. Had a long term pain in neck.. gone! The masseuse know what they are doing and are absolutely professional. Every single time I come out of there thinking when is the next time I'll get to go. Highly recommend!\n\n",
        "Dalis Chan\n22 reviews·25 photos\nRated 5.0 out of 5,\nExtremely clean place. Pleasant smelling. Quite environment for body massage. Had the Thai Aroma massage.\n\n",
        "L S\n2 reviews\nRated 5.0 out of 5,\nClean & Professional.\nMy partner and I went for 90mins traditional thai massage and overall was great. Shout out to Cha Ling and she is very professional. Definitely comeback!\n\n",
        "Aviroop Sircar\nLocal Guide·22 reviews·216 photos\nRated 5.0 out of 5,\nAmazing experience. Feel relieved of all the back and neck issues. I would like to visit again and would recommend others looking for an amazing and relaxing massage ☺️\n\n",
        "Lawrence Tan\nLocal Guide·448 reviews·1,319 photos\nRated 5.0 out of 5,\nMe and my wife truly enjoyed our 90 mins massage it was money well spent! Will return!\n\n",
        "Asha Mahesha\n6 reviews\nRated 5.0 out of 5,\nGreat massage, strong and really stretched + cracked well. Masseuse did a great job with the gradual slow pressure that felt very relaxing.\n\n",
        "ChinRui Chew\n12 reviews·14 photos\nRated 5.0 out of 5,\nDid a 1 hour Traditional Thai Massage. A little bit on the expensive side but the service was excellent and the staff was very friendly.\n\n",
        "Kai Ling Koh\nLocal Guide·90 reviews·69 photos\nRated 4.0 out of 5,\nGotten the traditional thai massage. 45mins for $65. Not the cheapest in the area. Service was excellent. Massage is not too bad. Would come back if in the area\n\n",
        "CHAE U RI LEE\n2 reviews·2 photos\nRated 1.0 out of 5,\nI took “30 minutes/ foot massage. “\n\nI'd like to make a reservation at 8 pm. But at 7:13 pm the massage club called me and said “8 pm is full booking, so I have to come by 7:30 pm.”\n\nI called on time without being late. I visited at the time they wanted, hoping for better service. (If they had at least the average massage level, I wouldn't have written this review.)\n\nAt The first time it wasn't bad. (Greeting service, beverage service etc..)\nDesk staff were friendly and beverage service was good. And the tea was also good.\n—\n< Foot Massage started. >\n\n* massage\nThe first pressure to me for left foot massage was weak and insincere.\nI majored in art, knows a little bit of anatomy. Also Massage experience is a lot as well.\n\nUnfortunately, the pressure is too weak to a viable level for baby. (This is not a massage, just touching.)\n\nBut I did not say any compliments at first.\n\nBecause I thought there will be the therapist’s intention or purpose of the first time introduction stage and still believe.....\n\n15 minutes left. To be honest, At that time feel bad. (There’s no therapist’s intention or purpose. She just... It became apparent that the time was being spent by forcefully.)\n\nBut the therapist condition is good or thought there may be many other reasons.. So I told her\nsoftly, just “press more than the left foot.”\n\nThe right foot was better than the left touch level. I'm not satisfied with my right side, but I'm just touching my left foot.\n\nI thought I waste of money and time.\n\nNo difference whatsoever after the massage are tired of the foot and calf.\n\n< 5 minutes left. >\n\nI saw a new guest wash her by other therapist.\n\nSo I ask the my therapist.\n\n“Why I never wash my feet like her?”\nThen my therapist replied.\n“Because I am taking a half-hour massage. And\nthis massage is not included the washing feet service. So I took just wash your feet as a wet towel.\nIf you want to wash your feet service,\nYou have to pay an additional $ 10. Would you take a feet washing service?\n\nThe massage was only five minutes remaining in. (Also, If the foot service is not to be included in a 30-minute period, the massage club or therapist should have made the announcement beforehand.)\n\nWast time and money...\n\nIf I was satisfied with today, I would visit again tomorrow with my friend, but I never will. Never go.\n\n",
        "Aye Chan\n4 reviews·1 photo\nRated 5.0 out of 5,\nI had a THAI SIGNATURE massage and its very nice. Highly recommend! Staffs are very professional and the place is very pleasant and clean. Will Definitely go there again.\n\n",
        "WenD Tan\nLocal Guide·460 reviews·1,231 photos\nRated 5.0 out of 5,\nUpdate on 6/3/18 : price has increased to $80 for Thai massage. Didn’t inquire about massage. Still  reasonable pricing. Previous review: $68 for 60mins. Jasmine: recommend for females (medium strength) Great masseur, know what she's doing. Went for traditional Thai massage (no oil) and she helped relieved many knots which I didn't even know I had! Bought a package for $620 (10 times) 👍🏻\n\n",
        "Constance Yeo\n3 reviews·1 photo\nRated 5.0 out of 5,\nGreat place for Traditional Thai Massage. Went on a Sunday evening. Very serene and comfortable. My masseuse was Zhang Qin. I walked in with back aches and walked out with none. They are good at identifying the pressure points to release the pains.\n\n"
    ],
    "Phone": null,
    "Website": "http://www.sabaaisabaai.com/",
    "Message": null
}