{
    "Name": "TD Spa ~ Traditional Thai Massage\n",
    "Products": {},
    "Address": "122 Bedok North Street 2, #01-132, Singapore 460122",
    "Opening Hours": "Saturday 10am–1:30am\nSunday 10am–1am\nMonday Closed\nTuesday 10am–12am\nWednesday 10am–12am\nThursday 10am–1am\nFriday 10am–1:30am\nSuggest new hours",
    "Rating": "4.4\n134 reviews",
    "Reviews": [
        "Felicia Prasetya\nLocal Guide·16 reviews·3 photos\nRated 5.0 out of 5,\nManaged to book a last min slot at this place. Good quality and authentic Thai massage. Similar to what you will get if you are in Thailand. Price is also reasonable. I was a bit worried at first since this is my first time trying but I really liked the massage.\n\nUncle at counter was also polite to clients.\n\n",
        "Mal C\nLocal Guide·37 reviews·29 photos\nRated 1.0 out of 5,\nThis is not authentic Thai massage. The women aren't trained. I asked for extra hard thai massage and was terribly let down. I wanted to walk out after 5 mins into the massage but was told that another massuse who could massage hard and well would be available in about 30mins. I waited as I had already prepaid. It was the most hyped up massage that left me disappointed and totally unrelieved. I felt more stiff after than I did walking in there. I asked for more pressure but received less pressure. I also asked for shoulders and traps but got my arms massaged instead. I asked for glutes and hamstrings but got my calves massaged instead. I then got told I should stretch everyday and that I worked on a keyboard that's why I have tight traps. Both comments were not relevant as I do stretch everyday and I dont use a keyboard ever. Its like the massuse was making it up as she went along. She was saying how she has massaged for over 20years but she was atrociously inaccurate in her diagnosis and inaccurate with her massage. Both massuses were terrible. I wasted $55 and 90mins of my life there.\nIn conclusion, this place is good for people who don't know what thai massage is and who want untrained women hitting your spine with their elbow and not knowing anything about the human body. How this place has over a 4 star rating is beyond me.\n\n",
        "Chong Shiun Hoong\nLocal Guide·102 reviews·2,550 photos\nRated 4.0 out of 5,\nOnline booking and confirmation immediately. Went over today,was massage by Kim. Even she is small size but she have a good strength and will concentrate on your request of where should get more attention. Overall very good session will visit again.\n\n",
        "Felicia Prasetya\nLocal Guide·16 reviews·3 photos\nRated 5.0 out of 5,\nManaged to book a last min slot at this place. Good quality and authentic Thai massage. Similar to what you will get if you are in Thailand. Price is also reasonable. I was a bit worried at first since this is my first time trying but I really liked the massage.\n\nUncle at counter was also polite to clients.\n\n",
        "Mal C\nLocal Guide·37 reviews·29 photos\nRated 1.0 out of 5,\nThis is not authentic Thai massage. The women aren't trained. I asked for extra hard thai massage and was terribly let down. I wanted to walk out after 5 mins into the massage but was told that another massuse who could massage hard and well would be available in about 30mins. I waited as I had already prepaid. It was the most hyped up massage that left me disappointed and totally unrelieved. I felt more stiff after than I did walking in there. I asked for more pressure but received less pressure. I also asked for shoulders and traps but got my arms massaged instead. I asked for glutes and hamstrings but got my calves massaged instead. I then got told I should stretch everyday and that I worked on a keyboard that's why I have tight traps. Both comments were not relevant as I do stretch everyday and I dont use a keyboard ever. Its like the massuse was making it up as she went along. She was saying how she has massaged for over 20years but she was atrociously inaccurate in her diagnosis and inaccurate with her massage. Both massuses were terrible. I wasted $55 and 90mins of my life there.\nIn conclusion, this place is good for people who don't know what thai massage is and who want untrained women hitting your spine with their elbow and not knowing anything about the human body. How this place has over a 4 star rating is beyond me.\n\n",
        "Chong Shiun Hoong\nLocal Guide·102 reviews·2,550 photos\nRated 4.0 out of 5,\nOnline booking and confirmation immediately. Went over today,was massage by Kim. Even she is small size but she have a good strength and will concentrate on your request of where should get more attention. Overall very good session will visit again.\n\n",
        "Fadz Lee\n1 review\nRated 5.0 out of 5,\nI would like to give compliment to a masseur named Kim. She has small fingers but strong pressure.Hence giving a very good deep point massage. i would highly recommend kim\n\n",
        "R. Perrie\nLocal Guide·25 reviews·11 photos\nRated 1.0 out of 5,\nEXTREMELY RUDE STAFF. DO NOT GO.\n\nFirst time going. Booked a session for my mum and me at 1050pm for 90mins. Told the lady I am looking forward to the massage as I heard good review- I am coming all the way from Tampines.\n\nArrived around 1030pm and sat at coffeeshop to drink water and got a call- hello can shift to 1120pm? I said I was already outside 1120 quite late what happened? Plus I booked for 90mins! Got no bus later. Mentioned that a customer came late. I said, oh dear should have told them to shorten as you have other customer- or inform me earlier. ( i don't think this is an unfair request- massage is  at least 1hour long- u inform me only 20mins before for a 30min++ delay??)\n\nMan started to yell me at me 'BOOKING IS A PREVILEGE! WE  NEVER EVEN TAKE MONEY FOR YOUR BOOKING! AT LEAST WE COURTESY CALL YOU!'\n\nTo which i hung up because no one should listen to such rudeness. Standards so low- apparently we must be happy they never ask money for booking and be grateful that they give a call when they the ones that screw up.\n\nThere are many other places in this times of covid that need business- this place apparently business too good so staff can afford to be so rude to customer! MUST AVOID. Not worth the time.\n\n",
        "Ashyikin\n1 review\nRated 5.0 out of 5,\nI had Ms Kim twice as my masseur and she is aaaamazing! She helped me with my backpain and joint stiffness and I went home feeling alive! She is attentive and very professional, def knows what she's doing.\n\n",
        "jewel lim\n1 review\nRated 5.0 out of 5,\nThe masseuse Lynn was really great, she knows all of my pressure points and was able to hit each and every one of them. Highly recommended!\n\n",
        "Jude T\n5 reviews·1 photo\nRated 5.0 out of 5,\nGood decent massage.  Professional and of good strength. Would go again if in the area.\n\n",
        "Shin\n6 reviews\nRated 2.0 out of 5,\nI was here due to the good reviews, but was terribly disappointed. My masseuse was inexperienced although she had a pretty good attitude, but the experience was unpleasant and non thai-like, where pressure applied on bones and wrists? light squeezes on arms, thighs and unusually long rubs on neck. Did not alleviate muscle soreness.\n\nI did overhear the next door customer complimenting the other masseuse, so I think experience varies with who you are allocated.\n\nAmendment: there was a mistake in my pricing comment, so I have redacted it.\n\n",
        "Nurhidayah Aziz\n2 reviews\nRated 5.0 out of 5,\nFor me its the best thai message I've ever experienced. At first I was skeptical as rarely do massage parlours have their massages on the floor. However, after going through the massage I think all massage parlours should do their massages on the floor. Only then can the massage be done with full effort and those hard to reach places like inner thighs can be stretched. I fully recommend this place.\n\n",
        "Azroy\n2 reviews\nRated 5.0 out of 5,\nFirst time been there, good massage by the thailand woman. She did well compare to other spa that i've been to. Clean enviroment no hanky panky feel much better after massage. Recommended!\n\n",
        "Ashton Chong\nLocal Guide·26 reviews·1 photo\nRated 5.0 out of 5,\nStrong authentic Thai massage, with the masseuse constantly asking you if the pressure is good enough. Indeed the pressure was good! For those who are wondering I'm 6ft tall and generally people who try to crack my back often lose balance and fall down, this lady steady can crack my back without losing balance. Not for the weak minded looking for a gentle backrub.\n\n",
        "Jeremiah Wee\nLocal Guide·21 reviews·1 photo\nRated 5.0 out of 5,\nWent down after having 5 days of bad neck sches, severe enough to prevent me from turning my head left to right fully. Had a solid 1hr massage and left being able to turn without pain again! I'll be making this a regular massage place for sure...\n\n",
        "Zack Goh\n7 reviews\nRated 5.0 out of 5,\nBest late night legit massage. A gem in Singapore. Kim is a very good massesue. Strongly recommend place to come. Thanks!\n\n",
        "Vishnu Suresh\nLocal Guide·18 reviews·5 photos\nRated 5.0 out of 5,\nCame here with a neck pain due to wrong sleeping prosture and body fatigue accumulated over running.\nThe Thai massage offered by Lily was amazing and helped me relieve the neck. Worth the price. Thanks.\n\n",
        "Urvashi Bhalode\nLocal Guide·22 reviews·13 photos\nRated 5.0 out of 5,\nOne of the best massages I've had in Singapore. Thanks a lot to the lady, Da, who was great with the back massage!\n\n",
        "zealous lim\n10 reviews·5 photos\nRated 3.0 out of 5,\nEdit: reduced to 3 stars due to an unpleasant visit on 23/12/20 after being a regular here for 3 years.\n\nA new hire was assigned who was inexperienced and had a big room for improvement. Better QC should have been in place to Ensure competency of masseuse.\n\nIt was so bad I had to stop the massage halfway approx 25 mins left. Shop offered refund $7 for my 25/60 mins ($55) massage left which left me confused. Rejected the refund and left an unhappy customer.\n\nPrevious review:\n\nExcellent authentic massage service in the heartlands. May wish to call for an appointment before heading down. Wendy is an excellent masseuse, never fails to knead those aches away. Price is reasonable and facilities are clean and comfortable.\n\n",
        "Alex “Gramsturn Null”\n13 reviews\nRated 1.0 out of 5,\nHad at 90 mins body massage yesterday that was just dreadful. The masseuse was inexperienced and not using any kind of massage technic. All she was doing was pressing her hands and elbows into my skin repeatedly with her full body weight, this is not massage!. I came here because of the high reviews but the reviews do not match with the massage i received yesterday.\n\n",
        "Andy Low\nLocal Guide·121 reviews·11 photos\nRated 5.0 out of 5,\nReally cozy and clean Thai massage establishment in Bedok. A hidden gem. Very friendly reception service and masseuses. Also they are much more cheaper than the other establishments in the city area. I can't recommend this place enough.\n\n",
        "ben chin\n1 review\nRated 5.0 out of 5,\nIt was my first time over here and I had an amazing experience. The owner of this place is polite and answers your queries honestly. The interior of this establishment is clean and cozy. Therapists are experienced and know exactly what they are doing. Do not be afraid of Therapists using too much/little strength. There was clear communication between therapist and customer as well. Good location I must say for east siders! I will definitely recommend anyone, from having a relaxing massage, or to the fitness enthusiasts. This is the place to be 👍🏻\n\n"
    ],
    "Phone": "6445 0466",
    "Website": "https://www.tdspacompany.com/",
    "Message": null
}