{
    "Name": "Yue Yuan Beauty Spa\n",
    "Products": {},
    "Address": "805 North Bridge Rd, Singapore 198773",
    "Opening Hours": "Tuesday\n(Lunar New Year)\nOpen 24 hours\nHours might differ\nWednesday\n(Lunar New Year)\nOpen 24 hours\nHours might differ\nThursday Open 24 hours\nFriday Open 24 hours\nSaturday Open 24 hours\nSunday Open 24 hours\nMonday Open 24 hours\nSuggest new hours",
    "Rating": "3.7\n32 reviews",
    "Reviews": [
        "Musho Pea\nLocal Guide·1,123 reviews·6,370 photos\nRated 5.0 out of 5,\nDisturbed by some of these reviews, I asked for someone strong and got ah mei. She is chatty but will seek your feedback to adjust her pressure level. She's definitely strong and knows the pressure points and immediately spots knots to smooth them out! I chose to tolerate the pain and emerged feeling more loose and relaxed.\n\nEdit: place is kinda rundown and don't forget to check Aircon temperature if you feel hot.\n\n",
        "Jaycob Vanderson\n1 review\nRated 1.0 out of 5,\nHorrible place. Avoid like a plague. Walked pass their spa after having supper in the area and decided to give it a shot. Right from the start the counter staff consistently pushed for the higher priced package claiming it is the best and most common one that their customers choose. I conceded as I was in need of a massage.\n\nSubsequently, the massage was absolutely horrendous, the worst massage i have ever received from any spa. My masseuse was simply arbitrarily tapping all over my body, as if she was playing the piano, completely devoid of skill or technique. To make matters worse, she consistently fell asleep throughout the massage. At one point she sat on the chair and had her head on my back completely motionless for a good 3-4 minutes and after i woke her up and asked what is happening she said she is too tired. Thereafter, i when to the reception to ask for a partial refund or change of masseuse but the male receptionist simply said \"sorry nothing can be done\".\n\nIt is a given that sometimes it is a matter of luck on whether you receive a good masseuse. But shouldn't any respectable establishment train all of their staff to adhere to basic customer service? Fervently avoid unless you want to play a game of masseuse roulette, leaving it to chance on whether you will get a decent masseuse.\n\n",
        "Orion Beltin\n2 reviews\nRated 1.0 out of 5,\nActually the worst massage i have ever received. It appears that their masseuse are untrained and simply unskilled. This spa is almost akin to a  scam whereby the reception will constantly try to upsell you in exchange for a horrible experience. An automatic massage chair can provide a much better massage experience than this place ever can. Also, seems like their 5 star reviews are bogus ratings created by their own people.\n\n",
        "Musho Pea\nLocal Guide·1,123 reviews·6,370 photos\nRated 5.0 out of 5,\nDisturbed by some of these reviews, I asked for someone strong and got ah mei. She is chatty but will seek your feedback to adjust her pressure level. She's definitely strong and knows the pressure points and immediately spots knots to smooth them out! I chose to tolerate the pain and emerged feeling more loose and relaxed.\n\nEdit: place is kinda rundown and don't forget to check Aircon temperature if you feel hot.\n\n",
        "Jaycob Vanderson\n1 review\nRated 1.0 out of 5,\nHorrible place. Avoid like a plague. Walked pass their spa after having supper in the area and decided to give it a shot. Right from the start the counter staff consistently pushed for the higher priced package claiming it is the best and most common one that their customers choose. I conceded as I was in need of a massage.\n\nSubsequently, the massage was absolutely horrendous, the worst massage i have ever received from any spa. My masseuse was simply arbitrarily tapping all over my body, as if she was playing the piano, completely devoid of skill or technique. To make matters worse, she consistently fell asleep throughout the massage. At one point she sat on the chair and had her head on my back completely motionless for a good 3-4 minutes and after i woke her up and asked what is happening she said she is too tired. Thereafter, i when to the reception to ask for a partial refund or change of masseuse but the male receptionist simply said \"sorry nothing can be done\".\n\nIt is a given that sometimes it is a matter of luck on whether you receive a good masseuse. But shouldn't any respectable establishment train all of their staff to adhere to basic customer service? Fervently avoid unless you want to play a game of masseuse roulette, leaving it to chance on whether you will get a decent masseuse.\n\n",
        "Orion Beltin\n2 reviews\nRated 1.0 out of 5,\nActually the worst massage i have ever received. It appears that their masseuse are untrained and simply unskilled. This spa is almost akin to a  scam whereby the reception will constantly try to upsell you in exchange for a horrible experience. An automatic massage chair can provide a much better massage experience than this place ever can. Also, seems like their 5 star reviews are bogus ratings created by their own people.\n\n",
        "Lester Poon Yu Da\n3 reviews\nRated 1.0 out of 5,\nFirst and foremost, don’t go to this spa if you want to have a peaceful massage without being upsell.\n\n2nd.. I was told that when I signed up for the 90 mins package, will be given either gua sha or ba guan. But end up none of it was given. When I asked the front desk lady, she said I have to tell the masseuse myself but when I ask the masseuse, she said she wasn’t told to provide that service.\n\n3rd, aircon was spoilt in the room, I was perspiring half way into my 90 mins massage.\n\nOverall if there is a negative star, I will not be hesitate to provide it...Terrible place to massage in. Totally wasted my $80 bucks\n\n",
        "Jones Ng\nLocal Guide·193 reviews·1,308 photos\nRated 1.0 out of 5,\nThe first time today I met a masseuse who has the worst skill. Totally strengthless, very slowly and can even stopped. It just like touching your feet only and she herself can even fell asleep while doing job. I felt wasting of my time and money. My last time to come here. Forgot to say I was here for a foot massage.\n\n",
        "Tuan Ting\n6 reviews\nRated 5.0 out of 5,\nhad a East malaysian lady Liza massagiing me today. she is customer centric and spends a lot of time on where i ache the most. massage was good and strong. had to extend half hour to soothe my tired neck, shoulder and legs. will definitely go back again\n\n",
        "Vicissitude24\nLocal Guide·69 reviews·558 photos\nRated 5.0 out of 5,\n2 november 2016: I just went here last week, the staff are great. of course it is not like the expensive place that is spaceous, but if you are looking for a great massage with an decent price, this is the right place to be. They got steam bath offered to you. Massage is wonderful, although most of them speak chinese, the receptionist can speak english and you can give your instructions if you got certain areas you want to focus on.\n\nI am coming back again as I learned to love the place and finally found a permanent massage place for me.\n\n",
        "Wayne Fitzgibbons\n10 reviews·14 photos\nRated 1.0 out of 5,\nDO NOT COME HERE. Waste of time and money. Touch as soft as a baby, asked to massage lower back but kept rubbing shoulders. All the tile talking to other girls. Didn’t wipe off oil or tell me she had finished, just walked away.\nComplete junk.\n\n",
        "Ng Robett\n4 reviews\nRated 3.0 out of 5,\nI very sad why they did not cook the green bean desert which is my favourite.  I hope they will resume cooking this desert very soothing for a massage.\nThe TV was spoiled for so long n no action taken to resolve it.  Very poor service to we customers.\nI will come back if those things are rectify promptly. Thanks.\nRobert.\n\n",
        "Gavin McCloy\nLocal Guide·90 reviews·227 photos\nRated 5.0 out of 5,\nFeeling like walking on the clouds after amazing relaxing body massage thank you so much lovely staff, very good service, lady at reception also very polite and smart and very friendly and very helpful 100 out of 10\n\n",
        "Chanleo Chanleo\n10 reviews\nRated 4.0 out of 5,\nPrice is reasonable but just never accept credit card. Its cash, nets or mastercard.\nThe masseurs were skilled depending on who.\nEnvironment is clean and not sleazy.\n\n",
        "Calvin Cai\nLocal Guide·27 reviews·77 photos\nRated 5.0 out of 5,\nGreat massage will come back for longer sessions strength is great professional service.\n\n",
        "Steven Foh\nLocal Guide·44 reviews·47 photos\nRated 4.0 out of 5,\nQuite relaxing except some space constraints. It provides decent services with steam bath n small pool to soak in. Drinks provided free flow.\n\n",
        "Victor Tay\nLocal Guide·417 reviews·107 photos\nRated 3.0 out of 5,\nDecent massage. Rooms are not that impressive.\n\n",
        "Emma\nLocal Guide·991 reviews·7,228 photos\nRated 4.0 out of 5,\n(Translated by Google) Open 24 hours, the acupuncture points are well pressed and pressed to the pain point, about 50-60 stars per hour\n\n(Original)\n24小時營業 穴道按得很到位 按到痛點 一小時大約50-60星幣\n\n",
        "Li Ping Hu\n3 reviews·1 photo\nRated 5.0 out of 5,\n(Translated by Google) The environment is very good, the masseur has good skills, will choose to go again\n\n(Original)\n环境很好，按摩师技术不错，还会选择再去\n\n",
        "일상행복한\nLocal Guide·26 reviews·29 photos\nRated 5.0 out of 5,\n(Translated by Google) Massage house in Singapore ~~\n\n(Original)\n싱가폴에서  마사지잘하는집~~\n\n",
        "刘准彦\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "wsheng tham\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "azizan\nNo Past Reviews\nRated 2.0 out of 5,\n\n\n"
    ],
    "Phone": "6298 2326",
    "Website": "https://www.facebook.com/YUEYUANSPA/",
    "Message": null
}