{
    "Name": "24 Hour Massage - Herbal Footcare Health & Beauty Centre\n",
    "Products": {},
    "Address": "6735 3973",
    "Opening Hours": "Saturday 8:30am–3am\nSunday 8:30am–2am\nMonday 8:30am–2am\nTuesday 8:30am–2am\nWednesday 8:30am–2am\nThursday 8:30am–2am\nFriday 8:30am–3am\nSuggest new hours",
    "Rating": "4.3\n53 reviews",
    "Reviews": [
        "Jason Lim\nLocal Guide·129 reviews·774 photos\nRated 5.0 out of 5,\nMy fiancée and me came here tonight for 1hr foot massage. She took 1hr full foot while i took 30 min foot + 30 min shoulder/body.\nThere is offer price of $42 so its value for money. But that's not the key point.\n\nThe chinese guy who pressed for me. His name is ru ping #42 he just came from china since 10 days ago. I have to say his skill meets my requirement and taste and my stiffness is not easy to handle not many meet my expectations. 很到味!\n\nWill come back for more!!!\n\n",
        "Michelle Leong\nLocal Guide·67 reviews·278 photos\nRated 5.0 out of 5,\nHidden gem of orchard road. Paid $55 nett for 40 mins foot reflexology and 20 mins shoulder and back massage. The physicians are very skilled and it felt painfully good!\n\n",
        "Alvin Tan\n8 reviews·5 photos\nRated 5.0 out of 5,\nHad a 45min foot and 15min neck & shoulder massage for $52. Reasonable price and uncle who massaged me really strong and skilful. Was very relaxed after the session. Will come again!\n\n",
        "Jason Lim\nLocal Guide·129 reviews·774 photos\nRated 5.0 out of 5,\nMy fiancée and me came here tonight for 1hr foot massage. She took 1hr full foot while i took 30 min foot + 30 min shoulder/body.\nThere is offer price of $42 so its value for money. But that's not the key point.\n\nThe chinese guy who pressed for me. His name is ru ping #42 he just came from china since 10 days ago. I have to say his skill meets my requirement and taste and my stiffness is not easy to handle not many meet my expectations. 很到味!\n\nWill come back for more!!!\n\n",
        "Michelle Leong\nLocal Guide·67 reviews·278 photos\nRated 5.0 out of 5,\nHidden gem of orchard road. Paid $55 nett for 40 mins foot reflexology and 20 mins shoulder and back massage. The physicians are very skilled and it felt painfully good!\n\n",
        "Alvin Tan\n8 reviews·5 photos\nRated 5.0 out of 5,\nHad a 45min foot and 15min neck & shoulder massage for $52. Reasonable price and uncle who massaged me really strong and skilful. Was very relaxed after the session. Will come again!\n\n",
        "Shuh F\n5 reviews\nRated 5.0 out of 5,\nRandomly walked past with my husband and decided to try their 30min foot massage ($20). My husband topped up $18 for a 15min neck, shoulder and arm massage. While the place was pretty ordinary, the massages turned out great. Can tell that the masseuses (we got two men) cared about what they were doing and were explaining to us what our pain points meant. Very friendly staff. No hard selling at all. Felt rejuvenated after our session.\n\n",
        "Matan Weissman\n29 reviews·67 photos\nRated 5.0 out of 5,\nThis place isn't very well known, but it is great. My parents visited this place 7+ years ago and yesterday I went there too for my shoulder and neck. I took the 1 hour foot+shoulder massage ($40 SG) and it was great. The employee does it strong and hard (I was in pain, which was great) and I left with almost no further strain in these areas. The next day (today) my father had his back hurting, so he took the 1 hour massage and boy is he a lot better now. 10/10!\n\n",
        "GK\n11 reviews\nRated 4.0 out of 5,\nVisited 17 Nov 2019. Massage is awesome with reasonable pricing but no decent covered area to change into shorts. The female masseuse have to hold a towel facing the glass panels while I change and she alert the men including the customers not to look. This is damn cheap. U can actually have a drop down curtain like area just for people to change into comfortable clothing in one corner. Even a small shop near my neighborhood market got covered area with no doors how come in town this shop runs like this. Otherwise everything else is good and relaxing for 24 hours.\n\n",
        "Victoria T\n13 reviews·13 photos\nRated 5.0 out of 5,\nLoved this place and came everyday during our 5 day stay in Singapore! Friendly staff, our favourites were number 14, 27 and 19!  They were the best and so funny! Will be thinking of these foot massages back home and it truly made our trip😍\n\n",
        "Angel See\nLocal Guide·33 reviews·27 photos\nRated 5.0 out of 5,\nI walked past today and was looking thru your services menu considering a massage. Jaffrey came up to me, was very friendly and suggested best combination cos I wanted a 90mins massage. Best value for money massage I've had in Singapore! He was very good and I feel so relaxed and rejuvenated after. I am definitely coming back again!\n\n",
        "Epi Ogden\n33 reviews\nRated 5.0 out of 5,\nI really like thier service and accommodation! Thier staffs are nice and also caring. Thier full body massage are completely the best but in a very very low prices. I also like the place because it plays a relaxing song! The therapist are also nice because they always asked if the pressure is fine or not. Also they have a good place and it is really peaceful it is not chaotic. I would love to go back in here if I'll be given a chance\n\n",
        "AYAKO HILLARY\n17 reviews·4 photos\nRated 1.0 out of 5,\nI am very much regular here around 8 yrs. At the beginning, I told massage therapist about my condition. I told him especially I’m tired with my head neck and shoulder. However after I fell asleep, he didn’t do anything to my head then ended. I asked about to do head. He said “ I did” but he didn’t ! I talked to manager, he was freaking useless!!! I complained in front of my guest that wasn’t my intention just I was embarrassed. Don’t fall asleep, some guy cheat customers. I don’t come back anymore, also will tell Japanese ppl what he did\n\n",
        "Rei\n5 reviews·10 photos\nRated 5.0 out of 5,\nhave visited their new store and the old one over the past 3-4years. its open 24hrs and the staff are friendly, all with different methods of massaging. the location is a big plus as you can get a foot massage as a refresh after long shopping at orchard. have recommended this place to many people and they all enjoyed the experience.\n\n",
        "Zhou Dao\nLocal Guide·30 reviews·21 photos\nRated 1.0 out of 5,\nI was being served by Jaffrey. I told him from the start that wanted to rest and yet he said he will keep me awake throughout the 30 minutes foot massage session. Indeed, he fulfilled his promise by giving me a hard time massage session claiming that I felt pain because of mt indigestion, drinking too much cold drinks and all sorts of excuses. The whole horrible massage session was witnessed by my friends who claimed that he is taking revenge on me for not striking a conversation with him. PLEASE DO NOT ATTEMPT TO STAY SILENT IF YOU ARE SERVICED BY HIM IF NOT YOU WILL GET TORTURED!!!\n\n",
        "Ressless\n5 reviews·1 photo\nRated 1.0 out of 5,\nI took the Body Massage for 60 mins. It was a towel massage. Quite hard for my taste. I said he should do it softer but i guess he didnt heard it. Also he never adjusted, how hard and stiff my back parts or my neck was, so he just continued with it. After 30 mins he switched to easy mode and used almost no strength at my shoulders and this until 5 mins before end of the time. One day after it, i have pain and feel like i did something not healthy to my body. Wasted 50$ i think!\n\n",
        "Y Xm\nLocal Guide·34 reviews·94 photos\nRated 5.0 out of 5,\nI took the 40mins foot reflexology and 20mins shoulder and back massage. The massage was gooood 👍 Costs $55.60.\n\n",
        "Lou Peter\n27 reviews\nRated 5.0 out of 5,\n\"\nIt’s so nice to be here! The masseuse was so good that makes me feel really relaxed like all the pain I felt in my body was suddenly removed. Though I came here at 9:00 pm, their service is still good and their staffs are accommodating. Can’t wait to come back!\"\n\n",
        "Aditya Sreekumar\n4 reviews\nRated 5.0 out of 5,\nLye was professional, with a lot of attention to detail. He genuinely cared about what he did -that made me go from a 30 minutes to a 60 minutes session. I'm definitely going to try to come back before I leave Singapore\n\n",
        "Crew Life in a “kris” Cruise Ship\n2 reviews\nRated 5.0 out of 5,\nIt was an awesome massage. 👍\nprofessional and knowedgable staff. I like the way he did it, very relaxing.  😊\n\n",
        "Bj L\n15 reviews\nRated 5.0 out of 5,\nIt was very healing experience. They caught my body state exactly and relieve my tiredness and pain.\n\n",
        "nadeem mubarak\nLocal Guide·76 reviews·12 photos\nRated 5.0 out of 5,\nHighly recommended. Needed a foot massage early hours of the morning. They know all the pressure a true firm foot masaage.\n\n",
        "Naomi Jonathan\n5 reviews\nRated 1.0 out of 5,\nFor body massage this place offers no rooms and there is cameras all over the shop. No privacy for females.\n\n"
    ],
    "Phone": "6735 3973",
    "Website": "https://www.herbalfootcares.com/",
    "Message": "Info is not retrievable"
}