{
    "Name": "Dreamland Spa\n",
    "Products": {
        "Japanese Imperial Health Preservation": "$96.00"
    },
    "Address": "6257 8589",
    "Opening Hours": "Saturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nFriday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.2\n80 reviews",
    "Reviews": [
        "Ivan Ong\n2 reviews\nRated 5.0 out of 5,\nA friend recommended Joey to me for her exceptionally great massage skills. After trying out it seems that my friends recommendation is right. She massage very diligently making sure the stress goes away. Highly recommend her massage if you guys are having a very tired day.\n\n",
        "Beng Ong\n1 review\nRated 5.0 out of 5,\nI had 90 minutes massage with Mss Linda yesterday. I got to know her through a friend of mine. First time experiencing massage from a Vietnamese girl. She is very beautiful. Working attitude is professional, hard working not the piano type😅 and friendly .Sure will come back and find her again. Worth my money and time\n\n",
        "H 2\nLocal Guide·524 reviews·36,608 photos\nRated 5.0 out of 5,\nProfessional Spa service conveniently located at neighbourhood heartland of Chong Pang City. Services including Aroma Oil Message as well as Cupping Body Scrub Stonehenge Collection Spa Kidney Care and Ovary Care Messages. Skillful attentive knowledgeable approachable staff and Therapists Message specialists including physiotherapists providing helpful timely advice and warm services. Walking distance to Chong Pang City wet market and food centre with plenty of dinning shopping banking supermarkets groceries sundries postage services and amenities nearby. Walking distance to Chong Pang Community Club. Bus stop 701A with buses serving Woodlands Admiralty Sembawang Canberra Yishun Khatib and direct bus 969 to Tempines MRT bus interchange Tempines One 858 to Changi Airport 856 to Marsiling 171 to Marina Square. Surrounded by plenty of breezy greenery away from busy cityscapes. Friendly cosy comfy welcoming ambience for romantic intimates groups students expats locals visitors and families.\n\n",
        "Ivan Ong\n2 reviews\nRated 5.0 out of 5,\nA friend recommended Joey to me for her exceptionally great massage skills. After trying out it seems that my friends recommendation is right. She massage very diligently making sure the stress goes away. Highly recommend her massage if you guys are having a very tired day.\n\n",
        "Beng Ong\n1 review\nRated 5.0 out of 5,\nI had 90 minutes massage with Mss Linda yesterday. I got to know her through a friend of mine. First time experiencing massage from a Vietnamese girl. She is very beautiful. Working attitude is professional, hard working not the piano type😅 and friendly .Sure will come back and find her again. Worth my money and time\n\n",
        "H 2\nLocal Guide·524 reviews·36,608 photos\nRated 5.0 out of 5,\nProfessional Spa service conveniently located at neighbourhood heartland of Chong Pang City. Services including Aroma Oil Message as well as Cupping Body Scrub Stonehenge Collection Spa Kidney Care and Ovary Care Messages. Skillful attentive knowledgeable approachable staff and Therapists Message specialists including physiotherapists providing helpful timely advice and warm services. Walking distance to Chong Pang City wet market and food centre with plenty of dinning shopping banking supermarkets groceries sundries postage services and amenities nearby. Walking distance to Chong Pang Community Club. Bus stop 701A with buses serving Woodlands Admiralty Sembawang Canberra Yishun Khatib and direct bus 969 to Tempines MRT bus interchange Tempines One 858 to Changi Airport 856 to Marsiling 171 to Marina Square. Surrounded by plenty of breezy greenery away from busy cityscapes. Friendly cosy comfy welcoming ambience for romantic intimates groups students expats locals visitors and families.\n\n",
        "TZ Sing\n1 review\nRated 5.0 out of 5,\nIf you are looking for a professional and\nquality massage.I would highly recommended Lily.\nThe 90 mins session with her really help to\nrelieve the full day work stress.\n\n",
        "Tan TK\n1 review\nRated 5.0 out of 5,\nHad an awesome experience with Victoria $88 for 1hr of kidney care and an additional $150 for “one dragon” would definitely come back when i’m in need.\n\n",
        "William William\nLocal Guide·19 reviews·5 photos\nRated 5.0 out of 5,\nTherapist Professionalism i book 1 hour massage after massage I ask for special polish service!!! Therapist said in this place not special polish !! Only special lave service -:)\n\n",
        "Addul Razak\n2 reviews\nRated 5.0 out of 5,\nLinda is very good massages, nice person and have experience. Will come again\n\n",
        "asyid scorpio\nLocal Guide·57 reviews·3 photos\nRated 5.0 out of 5,\nEnvironment ok. But when we go to spa we want to feel relax. Enjoy the tenderly massage techniques. Especially when you book the right massue. You will feel at ease. The tiredness gone. Ache and discomfort suddenly gone. I have visited the place several times. But today, I finally managed to book the right massue. Her name is Aira. Looks n figure not important. She is a simple gal having good hands/fingers.The way she massage. The pressure point techniques. I really really enjoy the massage done by her... She really knows how to apply the firmness during massages. She is friendly too. I gave her 5 star. Fully recommended. Great job Aira. I will visit the place again and book her again and again n again as long she is working there. 👍👍👍👍👍\n\n",
        "ccb knn\n1 review\nRated 2.0 out of 5,\nthe so called Japanese bubble massage is close to scam. they only put bubbles on you at the end of the massage. rub for less than 5 mins. that's all. and charge you $98 for such a normal massage. definitely will not  come back. tip 50 or 80 options. if you know what i mean\n\n",
        "Zaidom Ashraf Mahdom\n4 reviews\nRated 5.0 out of 5,\nIf only there were no construction going it would be peaceful massage. How ever Chanel did very well which I would recommend and of course return again to cater her massage.\n\n",
        "Joanna Oh\n1 review\nRated 1.0 out of 5,\nWent on Sunday and had a very poor experience.\nThe masseuse was indifferent to how I felt even though I feedbacked many times it was very painful. She gave many unprofessional comments about how it is normal to be painful because of my body.\n\nI developed body aches and even a fever of 38.4 degrees after the massage.\n\nAvoid this place. Worst massage experience ever for me.\n\n",
        "Stanley Gan\n1 review\nRated 3.0 out of 5,\nWent for a Japanese massage 1hour 30min $142 very relaxing and comfortable almost felt asleep.\nJust when I about to felt asleep, the therapist asked if I want to add another $80 for extra service.\nSo is it very relaxing but also very expensive spa, hopefully next time can have some promotions on the extra service.\n\n",
        "joker wong\n4 reviews\nRated 4.0 out of 5,\nCandy working attitudes good,friendly and pleasant looking with good skill,strongly recommended\n\n",
        "Ng Zach\n1 review\nRated 5.0 out of 5,\nGood place to relax after stressful working hours. I had 90 minutes to experience Japanese massage with Ms Linda. She is so beautiful, good masage. I will come back and book her again!\n\n",
        "Tan Mingfatt\n1 review\nRated 5.0 out of 5,\nGOOD experience and friendly service with Athena. I has very good massage experience with her. i will recommenced, who going to the dreamland spa must looking for her. Personally i will giving Athena 5 star service of massage to her.\n\n",
        "KW Aw\n1 review\nRated 5.0 out of 5,\nKitty had provided a very professional and relaxing massage for me. The place is very clean and nice. Will visit again.👍👍👍\n\n",
        "Melvin Lim\n1 review\nRated 5.0 out of 5,\nAmbience was clean and conducive. Therapist was professional and caring (Athena).\n\n",
        "Kenny Wong\n1 review\nRated 5.0 out of 5,\nNice place and Athena is very good her massage.\nRecommend for you all to relax. Will go back to find her again.\n\n",
        "Xavier Yeo\n1 review\nRated 5.0 out of 5,\nAwesome place to get away ur sore and tiredness! Highly recommended place to go to. Especially the masseuse named Cindy she did a awesome job. Will definitely go back again.\n\n",
        "Kian Seng Yap\n3 reviews·6 photos\nRated 5.0 out of 5,\nVery cozy and relaxing place in Yishun neighbourhood.  Strongly recommmend Kitty who is friendly and provide very good massage.  Will definitely return again.\n\n"
    ],
    "Phone": "6257 8589",
    "Website": "https://www.dreamlandspa.sg/",
    "Message": "Info is not retrievable"
}