{
    "Name": "Grandeur Spa\n",
    "Products": {
        "Grandeur Traditional 皇庭古法": "$55.00",
        "Grandeur Exclusive 皇廷尚品": "$89.00",
        "Ear Refreshing 采耳": "$36.00",
        "Grandeur Traditional 皇廷古法": "$68.00"
    },
    "Address": "6310 5589",
    "Opening Hours": "Saturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nFriday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.6\n142 reviews",
    "Reviews": [
        "ZW Fatty\n1 review\nRated 5.0 out of 5,\nGrandeur Spa is my regular go to place due to the nice ambience and friendly staffs. Just had another session with my regular masseuse Fara. Fara is skillful and very experience in her massage. She is very soft spoken and knows how to make you relax and enjoy the massage session. Though petite but she applies enough strength to your body especially on those pressure points to release the muscle tension. Be sure to come back weekly for my regular massage. Also would like to compliment to Elise and Meimei the friendly receptionist, good job. What I love most about this place is they are very attentive to you and most importantly the masseuse does not play with phone and gives you 110% attention. Thanks again Fara for the amazing massage therapy, Elise and Mei Mei for the  good hospitality.\n\n",
        "Steven Loo\n1 review\nRated 5.0 out of 5,\nHave a session massage attached by Elsa.Elsa is a professional and great therapist.She is very patient and meticulous about helping to release the knots and strained muscle. Very good balance of strength and technique.Highly recommended, will visit to Grandeur Spa look for Elsa again.\n\n",
        "David Jones\n1 review\nRated 5.0 out of 5,\nI discovered this gem of a spa conveniently near my home and walked in for my first massage. The ambience was pleasantly relaxing and signing in was efficient and professional.\nI was attended to by Elsa who gave me a wonderful relaxing massage. Elsa is suprisingly strong for such a tiny girl and can provide whichever pressure you prefer. Good technique and left me feeling very satisified. Will definitely choose Elsa again for my next visit.\n\n",
        "ZW Fatty\n1 review\nRated 5.0 out of 5,\nGrandeur Spa is my regular go to place due to the nice ambience and friendly staffs. Just had another session with my regular masseuse Fara. Fara is skillful and very experience in her massage. She is very soft spoken and knows how to make you relax and enjoy the massage session. Though petite but she applies enough strength to your body especially on those pressure points to release the muscle tension. Be sure to come back weekly for my regular massage. Also would like to compliment to Elise and Meimei the friendly receptionist, good job. What I love most about this place is they are very attentive to you and most importantly the masseuse does not play with phone and gives you 110% attention. Thanks again Fara for the amazing massage therapy, Elise and Mei Mei for the  good hospitality.\n\n",
        "Steven Loo\n1 review\nRated 5.0 out of 5,\nHave a session massage attached by Elsa.Elsa is a professional and great therapist.She is very patient and meticulous about helping to release the knots and strained muscle. Very good balance of strength and technique.Highly recommended, will visit to Grandeur Spa look for Elsa again.\n\n",
        "David Jones\n1 review\nRated 5.0 out of 5,\nI discovered this gem of a spa conveniently near my home and walked in for my first massage. The ambience was pleasantly relaxing and signing in was efficient and professional.\nI was attended to by Elsa who gave me a wonderful relaxing massage. Elsa is suprisingly strong for such a tiny girl and can provide whichever pressure you prefer. Good technique and left me feeling very satisified. Will definitely choose Elsa again for my next visit.\n\n",
        "Ahui\n1 review\nRated 5.0 out of 5,\nHad return back to Grandeur Spa for 2nd time. Same masseuse with Elsa. She had a very good communication with mandarin. Her massage skill also very professional. Always asking for comfortable strength of massage. For sure will come back look for Elsa for another massage again.\n\n",
        "james haw\n1 review\nRated 5.0 out of 5,\nI have engaged Elsa for 1 hr to massage my back. She totally has the skills to tackle my backache problem. A very good therapist who is caring for her client and communicate well. After the massage, my backache is almost done. Very nice of her and her skill is superior! Thank you Elsa! Will visit again!\n\n",
        "Hien Oi\n1 review\nRated 5.0 out of 5,\nIt is my first time at grandeur and i was assigned Elsa that had great strength despite her petite figure 😊 she looks better than the photo i feel. Elsa is also very friendly and makes you feel comfortable to be with. Thumbs up! 👍\n\n",
        "BX Zhu\n1 review\nRated 4.0 out of 5,\nArranged an hour session with Vivi. Very remarkable a masseur who is able to release the heavy tension on my neck & back. A good conversationalist with a cheerful & positive character. Place has nice ambient with soothing music. Will revisit for the good experience.\n\n",
        "Koh Khai Chuan\n5 reviews·2 photos\nRated 5.0 out of 5,\nFeeling great today after a relax hot oil massage and had a good sleep. My therapist was Fara and her massage had loosen up my tight muscles for neck, shoulder and back. Great Job and will patronage Grandeur Spa again.\n\n",
        "Jason Chang\n1 review\nRated 5.0 out of 5,\nWalked-in for massage this morning after reading all the reviews. Ambience was serene and pleasant. Was attended to by Elsa. Good strength and really good with her hands. Left feeling relaxed. Will look for Elsa again when the need arises.\n\n",
        "Min Hong Ong\n1 review\nRated 5.0 out of 5,\nHad a massage few days ago and I was greeted by a friendly receptionist Elise. She patiently explained the package and recommended the signature massage. I was attended by Rainie and I really enjoyed the massage. Raine is very skillful and the strength was perfect. Thanks both Elise and Rainie for the great experience.\n\n",
        "Jason Lee\n1 review\nRated 5.0 out of 5,\nHad a massage at Grandeur about 2 weeks back. Masseus was Elsa. Great techniques and strength. Was super relaxed after the massage. Will return again to look for Elsa when the need arises.\n\n",
        "Silvia The\n11 reviews\nRated 3.0 out of 5,\nA bit disappointment of the service after reading many good reviews. The massage did not take place 1 hour..i guess its around 45 mins as i need to wait them change the bedsheet. I was just getting massage on the back, without having massage in front of my body.. However, i give 3 star due to the good skill of massage therapist as she know the spots which my back aches..\n\n",
        "Zack Lee\n2 reviews\nRated 5.0 out of 5,\nBeing a customer, we always seek for the top notch service provider. And grandeur spa have the top notch massuer and they provide good quality massage to help u relax after a long hectic day from work.\n\n\"Elsa \" is one the best massuer they have.\n\n",
        "Edi Kay\n1 review\nRated 4.0 out of 5,\nVisited Grandeur after a couple of weeks of hard work that took a toll on the back and shoulders. Booked a slot and was assigned Fara.\n\nFara has strong hands, good fingers, elbows and feet that walked all over my back. Squeezing out all the lactic acids that have accumulated over working the past weeks.  Joints, neck and head were all relieved.\n\nAfter the 90 min session, I was refreshed. Standing taller with the accumulated aches and pains all soothed out. Will visit her again soon.\n\n",
        "EUGENE PANG\n1 review\nRated 5.0 out of 5,\nI would like to give special thanks to my regular therapist Fara. She is friendly and also skilled. Although petite in size but she her massage is strong and also knows the exact spots to ease my aching body after a long day at work. I would rate her a 10/10 for massage and also for professionalism. 60 mins isn’t enough for a session, would recommend to go for at least a 90 mins session where you can relax and feel refreshed after the massage. Definitely a go to place for a great massage as the other places which I have been too just massage terribly ending with a worst body ache after or the massage therapist would plays with their phone and sometimes end even before the 60 or 90 mins duration. Thanks for the nice ambience and also the great massage from Fara. Will definitely be back and to recommend more customers.\n\n",
        "Tony Neo\n1 review\nRated 5.0 out of 5,\nTotally enjoyed my massage today by Elsa. She’s efficient but gets all the right spots. Left feeling super relaxed. Will be back to look for Elsa again.\n\n",
        "Wong Soo Lin\n1 review\nRated 5.0 out of 5,\nGladys is a cheerful lady and provides wonderful massage. Will definitely visit and look for her servoce again!\n\n",
        "Jason Ang\n3 reviews\nRated 5.0 out of 5,\nWent to Grandeur Spa after seeing good reviews for it. Location was a little inconvenient but the ambience is quite comfortable. I took the $89 massage. The masseus who served me was Elsa. Elsa was very good with her hands and was able to converse proficiently in Chinese so I was able to tell her which areas of my body were sore. Overall, I was very satisfied with Elsa's service and will definitely return again regularly to look for Elsa. Keep up the good work!\n\n",
        "Angel Sia\n1 review\nRated 5.0 out of 5,\nToday went to Grandeur Spa the massage session was very nice and pleasure, appreciated the nice massauer Elsa who provided 5 stars services to me.\n\n",
        "Corbin Ng\n1 review\nRated 5.0 out of 5,\nWalked in to Grandeur Spa yesterday after seeing all the good reviews. Took a 1hr package and was attended to by Elsa. Elsa speaks very good Mandarin and massages very well. She constantly asks if her strength is ok and were able to soothe my sore body. I left the spa feeling very relaxed. Will return again to look for Elsa.\n\n"
    ],
    "Phone": "6310 5589",
    "Website": "http://www.grandeurspa.sg/",
    "Message": "Info is not retrievable"
}