{
    "Name": "Healthland Pte Ltd ( Traditional Thai Massage / Oil Massage / Foot Massage )\n",
    "Products": {},
    "Address": "6221 3376",
    "Opening Hours": "Saturday 10:30am–10pm\nSunday 10:30am–10pm\nMonday 10:30am–10pm\nTuesday 10:30am–10pm\nWednesday 10:30am–10pm\nThursday 10:30am–10pm\nFriday 10:30am–10pm\nUpdated by business 4 weeks ago\nSuggest new hours",
    "Rating": "4.4\n79 reviews",
    "Reviews": [
        "Cheong Tien woi\n2 reviews\nRated 5.0 out of 5,\nTheir authentic thai massage fully relaxes the whole body and provides calmness and peace of mind to tackle the routine challenges of the next day. I have tried all of the young service providers and there was never a dull moment in each and every unique and pleasurable experience they make you feel. No doubt about it's fit for a king!\n\n",
        "Deborah Chan\n2 reviews\nRated 5.0 out of 5,\nCame here for 1.5hours thai massage, masseur was Tina. She's very professional and will check if I'm OK or if the strength is ok. She is very skillful and have equal strength for both hands. Great Thai massage in Sg!\n\n",
        "Victor Ma\nLocal Guide·82 reviews·1,704 photos\nRated 5.0 out of 5,\nDropped in here in the evening for a 60 min neck and back massage. It was excellent! I guess it was Thai style massage as I'm not used to being moved around a bit more, but I felt quite relaxed afterwards. Will definitely be back!\n\n",
        "Cheong Tien woi\n2 reviews\nRated 5.0 out of 5,\nTheir authentic thai massage fully relaxes the whole body and provides calmness and peace of mind to tackle the routine challenges of the next day. I have tried all of the young service providers and there was never a dull moment in each and every unique and pleasurable experience they make you feel. No doubt about it's fit for a king!\n\n",
        "Deborah Chan\n2 reviews\nRated 5.0 out of 5,\nCame here for 1.5hours thai massage, masseur was Tina. She's very professional and will check if I'm OK or if the strength is ok. She is very skillful and have equal strength for both hands. Great Thai massage in Sg!\n\n",
        "Victor Ma\nLocal Guide·82 reviews·1,704 photos\nRated 5.0 out of 5,\nDropped in here in the evening for a 60 min neck and back massage. It was excellent! I guess it was Thai style massage as I'm not used to being moved around a bit more, but I felt quite relaxed afterwards. Will definitely be back!\n\n",
        "zvl joe\n8 reviews·2 photos\nRated 5.0 out of 5,\nThe therapist Esther. Great masseuse, great pressure and very polite. - Aroma Oil Massage\n\nJust did another session, this time with Tina. Amazing and dedicated masseuse. Amazing. - Thai Massage\n\n",
        "Elain Zheng\n2 reviews\nRated 5.0 out of 5,\nI love it! If you are craving for an authentic traditional Thai massage, this is your go to place. They have unique techniques that Is similar to what you would experienced in Thailand. Sarah did a great job and I will definitely return back for her. I was given a private room for full body massage. The room amenities and toilet was also very clean.\n\n",
        "QQ LN\n1 review\nRated 5.0 out of 5,\nThorough and high quality massage. Thanks Tina for being so accommodating, applying stronger pressure when I asked for it. My back and legs are thanking me very much rn!!!\n\n",
        "Richard Bradshaw\nLocal Guide·17 reviews\nRated 5.0 out of 5,\nAs a veritable massage connoisseur - my GF and I go once per week on the whole and we’ve been here ten years!! - I can say this is pound-for-pound best massage for us both. Super comfy and relaxed floor level beds, well air conditioned, airy, clean massage rooms to wind down in (they’ve avoided those grimey huge chairs or massage tables + face hole that most others opt for that makes the rooms feeL stagnant and overused). Importantly TALENTED masseuse that have obviously had good training and not just going through motions, really take care to make you feel relaxed. Super friendly service always seem to manage to fit us in to our preferred timings.\n\n",
        "Shilpa Varade\n3 reviews·2 photos\nRated 5.0 out of 5,\nI went for Traditional Thai massage today at Healthland Pte Ltd. This is by far the best Thai massage place I've experienced in Singapore. Good clean place, strong hands massage & very polite girls. Overall value for money. Reasonable price. Must visit\n\n",
        "Deming\nLocal Guide·386 reviews·999 photos\nRated 4.0 out of 5,\nNot sure whether it's related to the healthland in Thailand but the Masseur  I got is good! She used a number of techniques and really loosen up my muscles.\n\nOnly drawback is that while it is  more expensive than usual, you still have to share the room with 2 other customers. I couldn't really rest well due to a snoring customer next to me.\n\n",
        "Gerald Khoo\nLocal Guide·67 reviews·8 photos\nRated 5.0 out of 5,\nNice little place in the heart of Chinatown. Went with my 3 friends on Sunday, 16/8/2020 - 5 PM. Do remember to give them a call for an appointment prior to arrival. Otherwise, you may have to wait for a time slot.\nMasseurs were very well-versed in their massage, slightly different variation of your regular Thai massage which I really really appreciate. They target core areas like your legs and especially your back. They are also able to converse in both English and Mandarin. Room is basic but extremely clean with frequent sanitization. Bang for your buck. I will definitely return again if I need to release the knots in my body.\n\n",
        "Lingxiao Sun\n31 reviews·2 photos\nRated 5.0 out of 5,\nHaven’t visited this place for quite a while and dropped by this afternoon. Its service is getting even better! Feeling so relaxed now.\nIf you are in for a Thai massage in Singapore, look no further than this one.\n\n",
        "Jason Low\nLocal Guide·28 reviews·54 photos\nRated 5.0 out of 5,\nProfessional good massage which is on par or even better than the ones in Bangkok. Look no further, this is the place to book for a body massage.\n\n",
        "Alisha Bhowmik\n4 reviews\nRated 5.0 out of 5,\nBest Thai massage I've ever had. Better than any I've had in Thailand, even a place I was brought to by a local friend in Bangkok. They really know what they're doing. Absolutely amazing. Couldn't recommend it more. They also have a really soft bed to lay on. The price is good and the facilities are really nice too.\n\n",
        "Harvin Gill\nLocal Guide·57 reviews·17 photos\nRated 4.0 out of 5,\nVery unique way of massaging. Loved it. Although I wish they included hands massage in the full body massage. I felt like that was missing for a complete session. Also please be careful sometimes lower back area too much pressure is added. Otherwise I loved it!\n\n",
        "Solvere ATnT\nLocal Guide·45 reviews·353 photos\nRated 5.0 out of 5,\nThey are very clean, very tidy. Give you new quality mask at arrival and departure. Cleanse your hands, spray the room, stairs, guide rail at your departure. Malaysian did Thai massage better, more expert than all thai i met in Singapore, Thai main cities.\n\n",
        "jamie goulding\n17 reviews·1 photo\nRated 5.0 out of 5,\nI read the reviews beforehand. But wow! So happy to have picked this place. It’s calming and relaxing as soon as you walk in. Staff are very professional. The massages are incredible (cheapest option is 60 min Thai for $60). It was so worth it!\n\nThink I’ll be back every week for a treat. Thanks again! 10/10\n\n",
        "Dominik\nLocal Guide·131 reviews·5 photos\nRated 5.0 out of 5,\nGood routine and very relaxing. My favorite of the 5 places I tried for traditional Thai massage. I recommend the 90 min session.\n\n",
        "Larvin TAN 陈添彬\n1 review\nRated 5.0 out of 5,\nThis is my 1st time to have Thai massage in Singapore even I am local. Perfect! Very clean and professional! Don't worry, no dirty service. I love it very much. Highly recommendation. You can look for Adeline, she is quite professional.\n\n",
        "Bryan Lee\nLocal Guide·16 reviews·13 photos\nRated 4.0 out of 5,\nDid leg massage, the masseur was really distracted with the other customers and colleague, therefore ended up the same technique used was really repetitive and overused.\n\nOther than that, the atmosphere and coziness was not bad. I would recommend the body massage instead of their leg massage.\n\n",
        "Jacqueline Lam\n3 reviews\nRated 5.0 out of 5,\nOne of the best no-frills Thai massages I have ever had in Singapore. The masseurs are well trained. Highly recommended, will definitely visit again!\n\n"
    ],
    "Phone": "6221 3376",
    "Website": "https://www.healthlandspa.com.sg/",
    "Message": "Info is not retrievable"
}