{
    "Name": "Soul Massage\n",
    "Products": {
        "Soul Massage | 心灵按摩": "$49.00",
        "Ear Refreshing | 采耳": "$38.00",
        "Soul Massage | 中式按摩": "$58.00",
        "Soul Signature Hot Oil | 心灵热油": "$89.00"
    },
    "Address": "6291 6583",
    "Opening Hours": "Saturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nFriday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.7\n62 reviews",
    "Reviews": [
        "Abdurrahman Al Asfuri Jamal\n1 review\nRated 5.0 out of 5,\nPositive: Professionalism\nTried this Malay masseuse YAYA! Very nice, very friendly most importantly very genuine person I ever met in massage parlour. I honestly feel 5 star isn’t enough for her. You should give it a try and you won’t regret. She did a legit job. And I made her my personal masseuse till she is around. God bless.! Stay safe guys 💫💫💫💫💫\n\n",
        "Arthur Leong\n1 review\nRated 5.0 out of 5,\nTry Soul Massage for the first time. The place was clean and nice.  Tracy was the therapist attending to me.  She was very skillful and did a fantastic job in addressing to my aching muscles.  It was a relaxing and enjoyable massage.  Will definitely go back for another session with Tracy.\n\n",
        "sky ren\n1 review·1 photo\nRated 5.0 out of 5,\nBook an 90minutes massage with therapist Gina at Soul Massage. Had a wonderful experience hot oil massage. She's skillful with her massage and also very friendly to chat. Had a good relaxation on my body with her massage and a good mind relaxation on my mind chatting with her.\n\n",
        "Abdurrahman Al Asfuri Jamal\n1 review\nRated 5.0 out of 5,\nPositive: Professionalism\nTried this Malay masseuse YAYA! Very nice, very friendly most importantly very genuine person I ever met in massage parlour. I honestly feel 5 star isn’t enough for her. You should give it a try and you won’t regret. She did a legit job. And I made her my personal masseuse till she is around. God bless.! Stay safe guys 💫💫💫💫💫\n\n",
        "Arthur Leong\n1 review\nRated 5.0 out of 5,\nTry Soul Massage for the first time. The place was clean and nice.  Tracy was the therapist attending to me.  She was very skillful and did a fantastic job in addressing to my aching muscles.  It was a relaxing and enjoyable massage.  Will definitely go back for another session with Tracy.\n\n",
        "sky ren\n1 review·1 photo\nRated 5.0 out of 5,\nBook an 90minutes massage with therapist Gina at Soul Massage. Had a wonderful experience hot oil massage. She's skillful with her massage and also very friendly to chat. Had a good relaxation on my body with her massage and a good mind relaxation on my mind chatting with her.\n\n",
        "Alan Pan\n1 review\nRated 5.0 out of 5,\nHad an excellent time here. The therapist YoYo was super professional and well trained. She was very experienced and i could tell that from her technique and strength. Highly recommended\n\n",
        "Sherman\n6 reviews\nRated 5.0 out of 5,\nTried Soul Massage for the first time. Did not make appointment prior to visit. Luckily there were open slots. Was assigned to Abby  for the massage. She was very friendly and easy to get along with; her massage managed to hit the sore spots and she has surprisingly much strength which suited how I like.\n\nPlease relay my thanks to Abby, and will definitely recommend and return for next appointment! 👍🏼\n\n",
        "tan kt\n1 review\nRated 5.0 out of 5,\nWonderful experience at this spa, good environment and good massage service from therapist ABBY. She was very skillful in massage and also friendly & fun to chat. I enjoyed so much during the massage session and surely will come back and book her again. Please send my appreciation to ABBY and keep up the good work!!!\n\nVery nice atmosphere as well, clean room and comforting music.\n\n",
        "Victor Tan\n6 reviews\nRated 5.0 out of 5,\nFirst time trying out this place. I never assign any therapist as i didnt know need to choose. Ella did the hot oil massage for me, feeling all the sore and pain from not massaging a long time. Cheerful and nice to talk to. Definitely will come back again soon.\n\n",
        "Hidayat Osman\n1 review\nRated 5.0 out of 5,\nI booked Yaya more than 3 times.. Her massage skill and technique really superb.. Yaya is so friendly and comfortable to chit chat. I highly recommend Yaya.\n\n",
        "Benjamin Sho\n2 reviews\nRated 5.0 out of 5,\nI was attended by Tracy. She’s very attentive to the areas where I feel uncomfortable and keeps checking if I have any problem. She also knows how to adjust her strength to make me feel comfortable. Easy to talk to and a relaxing experience.\n\n",
        "Owen Liu\nLocal Guide·36 reviews·426 photos\nRated 5.0 out of 5,\nFrom my first visit last year to now, I really enjoy the service brought by Soul massage, especially Ella did the hot oil massage for me, let me relax,  Cheerful and nice to talk to. Recommend to everyone.\n\n",
        "Lawrence Ang\n2 reviews\nRated 5.0 out of 5,\nVery clean and comfortable place. Easy to find parking and the massage room is spacious. I love the oil essence they used to freshen up the place.\nCheryl was my masseuse and she was really good. The amount of strength used on me was to my liking and she also asked where I felt tired. Very friendly and made me feel at ease.\nWill definitely come back again to look for Cheryl!\n\n",
        "Charles Tan\n1 review\nRated 5.0 out of 5,\nFirst time going to this outlet, didn’t have any preference for therapist and was assigned Yoyo who recommended the hot oil massage.\n\nWhilst her looks differs a lot from the (obviously photoshopped) photo, her massage strength and skill was solid. Will return again.\n\n",
        "Gann Ford\n2 reviews·1 photo\nRated 5.0 out of 5,\nRecommended. Great massage and expertise. Its a wonderful experience. Star is amazing. I got lower back pain before i got the massage and after, the pain was gone. Wonderful place!\n\n",
        "Marcus Ong\n6 reviews\nRated 5.0 out of 5,\nThis place will let you experience what does the word relaxing truly means. The place gives you the soothing and comfy feeling. The therapists are highly skilled and professional. You can definitely relax and rejuvenate in this massage place. Becky is very professional 👍\n😊😊😊\n\n",
        "Alexander Freickmann\n91 reviews\nRated 3.0 out of 5,\nMassage itself was ok, but i booked 90 minutes and the massage lady totally lost track on time, so she just stopped in the middle of the massage. Would be okish for me, but after she left, i saw, that it was nearly exact 90min after the start. Considering she also went to the toilet during the session for 5min and that i never experienced such a hard stop in a better spa, felt disappointing. Take it also as a note tvat all ladies inside are from PRC and quite young.\nAll in all wouldn't recommend for a massage\n\n",
        "Evane Morphine\n2 reviews\nRated 5.0 out of 5,\nI had just finished my massage with Angela this evening, she was very skillful in massage and also friendly&fun to chat with. I enjoyed so much during the massage session and surely will come over again very soon. Please send my appreciation to her and keep up the good work!\n\n",
        "Zk B\n3 reviews\nRated 2.0 out of 5,\nMassage was gd.the location wasn't too good and I felt the pics are very photo shopped.when I asked the receptionist twice is the masseuse so and so,she did not answer me and I gave up.i don understand is the face mask covering my voice.\n\nShe was so listless.it really turned out to be the one.i just feel she could have answer me.i we'd better go to the sisters branches.\n\n",
        "Poh Chee Tat\n1 review\nRated 5.0 out of 5,\nAbby is a very skillful, professional,good attitude and friendly masseuse. Will definitely visit again.\n\n",
        "desmond poh\n3 reviews·2 photos\nRated 5.0 out of 5,\nWent on 7th august. Becky was the one who i chose. Her massage skills are good and she is friendly.\n\n",
        "Chee Siong Chew\n1 review\nRated 5.0 out of 5,\nWhen i call in for booking the reception Iris very friendly and patient to explain their 2 type diff massage  , end up i choose the hot oil msg , really helpful to  release all my tired ! thanks her so much and therapis also very profesional .\n\n"
    ],
    "Phone": "6291 6583",
    "Website": "https://www.soulmassage.sg/",
    "Message": "Info is not retrievable"
}