{
    "Name": "Absolute Massage",
    "Products": null,
    "Address": "1 Pasir Ris Cl, #02-313 E! Avenue, Singapore 519599",
    "Opening Hours": "Saturday 11am–10:30pm\nSunday 11am–10:30pm\nMonday 11am–10:30pm\nTuesday 11am–10:30pm\nWednesday 11am–10:30pm\nThursday 11am–10:30pm\nFriday 11am–10:30pm\nSuggest new hours",
    "Rating": "4.0\n57 reviews",
    "Reviews": [
        "Caroline A\n3 reviews·2 photos\nRated 5.0 out of 5,\nToday 3rd time visiting, and registered the membership. The masseuse Apple is very friendly and her massage is just perfect for me. I hope she stay here for long that i can visit every week. She is the only reason i visit this massage shop.\n\n",
        "ken f0017\n3 reviews\nRated 5.0 out of 5,\nHave my massage today by Apple, my wife is a regular customer here, sometimes she got masseurs that the massage style to her liking. But she always forgot to ask their names. Since this few days my whole body, especially my shoulder ache due to moving house. Love this spa, since it is near our house, read the recommended review, found Apple. Luckily managed to get her. True enough, she is very professional, skillful and tried to massage my worst ache area. So far, i felt much better. Thanks Apple. Highly recommend. Keep up the good works.\n\n",
        "Raihanzz Syazz\n13 reviews\nRated 5.0 out of 5,\nAyesha is a very skillful and knowledgeable massuer. She has almost 20 years of experience! No wonder! I have gone to several sports massage from other outlets, i can tell that she definitely knows how to identify muscle knots and how to loosen those tight muscles. Will definitely come back!\n\n",
        "Caroline A\n3 reviews·2 photos\nRated 5.0 out of 5,\nToday 3rd time visiting, and registered the membership. The masseuse Apple is very friendly and her massage is just perfect for me. I hope she stay here for long that i can visit every week. She is the only reason i visit this massage shop.\n\n",
        "ken f0017\n3 reviews\nRated 5.0 out of 5,\nHave my massage today by Apple, my wife is a regular customer here, sometimes she got masseurs that the massage style to her liking. But she always forgot to ask their names. Since this few days my whole body, especially my shoulder ache due to moving house. Love this spa, since it is near our house, read the recommended review, found Apple. Luckily managed to get her. True enough, she is very professional, skillful and tried to massage my worst ache area. So far, i felt much better. Thanks Apple. Highly recommend. Keep up the good works.\n\n",
        "Raihanzz Syazz\n13 reviews\nRated 5.0 out of 5,\nAyesha is a very skillful and knowledgeable massuer. She has almost 20 years of experience! No wonder! I have gone to several sports massage from other outlets, i can tell that she definitely knows how to identify muscle knots and how to loosen those tight muscles. Will definitely come back!\n\n",
        "sheng pang\n1 review·1 photo\nRated 5.0 out of 5,\nToday, I go for a massage at Absolute Massage. Apple, a massage therapist, did me a good job. My shoulder was uncomfortable at first, but there was no problem after I finished it\n\n",
        "Fanny Ying\n4 reviews·6 photos\nRated 5.0 out of 5,\nI was unsatisfied with the first masseur, might be due to self preference. They then gimme a compliment session after I feedback. Surprised with the administration as they recognise every single customer. They changed a Vietnamese masseur for me. I can only say this masseur is one of the best I ever met. Concern , hard enough on the right spot. Feel relived right after the session. I would like to request her again next time !\n\n",
        "Linda Lee\n11 reviews\nRated 1.0 out of 5,\nMassages here are very good, HOWEVER the gentleman sitting at the front desk (Stanley), working on the computer is totally \"LOST\". There was no greeting, no eye contact and he seemed SO lost when we arrived for my massage. He cannot find my appointment, the desk is in a mess n he was flipping here n there while we stood and waited there.\n\nHe DID NOT WEAR ANY MASK at all when we got there. And when one of the customers bought food for everyone, he was munching away, talking on the phone and talking with another masseur who wore a mask). Please educate and ensure your front receptionist has some manners and good hygiene.\n\n",
        "Rowena Loh\n5 reviews\nRated 5.0 out of 5,\nApple is really skillful. She’s very observant and sensitive to my needs. She knew my left shoulder was aching just by observing me taking off my bag. Usually I don’t have to tell her anything and she already knows what I need. My shoulder felt so much better after the massage. Thank you, Apple!\n\n",
        "Ryo Chin\n2 reviews·2 photos\nRated 5.0 out of 5,\nFor the past one year, i have visited the same place, Abosulte massage and all the time was attended by Apple.\nShe is the therapist that i would prefer here.\n\n",
        "Zoey CHUA\n1 review\nRated 5.0 out of 5,\nHave been visiting this place whenever my body is aching/sore. After each visit, it felt so much better. The staffs are friendly & a relaxing environment. After multiple visits, I would highly recommend to look for Apple, the masseur. No doubt, each time she know how to 'fix' my body aches. Have never try the other masseur, but since I had her to massage for my first visit & have been requesting for her. Enjoy!\n\n",
        "fanny low\n1 review\nRated 5.0 out of 5,\nFirst time visiting here since I don’t live in the East. I was quite skeptical initially due to the few bad reviews posted. But I was amazed that the massage service was a lot better then expected. Maybe different people has different preference, but the massage here suits me just right.\n\n",
        "Sheena Ang\nLocal Guide·11 reviews·11 photos\nRated 5.0 out of 5,\nGood place for a nice massage if you guys live near Downtown east. Decent place with good cleanliness. Masseur Apple is great. Enough strength and knowledgeable enough to identify where my body needs more attention.\nI thought 40 minutes would be sufficient but i go at least do a 60. Will be trying a combo next time.\n\n",
        "Kiddos Nu\n1 review\nRated 1.0 out of 5,\nI booked 2 slots for 8.45pm and arrived on time yet they turned us down saying they called and I didn't answer (I called them twice and their line was engaged!) so they gave the slot to other people. It is clearly written in their msg they will hold the slot for 15mins and yet they do this! Really disappointed with their booking personnels\n\n",
        "S C\nLocal Guide·31 reviews·52 photos\nRated 1.0 out of 5,\nI am writing in the midst of the foot massage session. Inconsistent strength. Random strokes. Masseur was not really sure she was doing. Base of feet gets 5 mins of random strokes. Her focus was more on the calf than feet.  She even sat on the foot rest (next to my feet to massage my calf). Copied moves from her colleague next to her. Not sure what kind of foot massage I am receiving. In my opinion, it is a pure waste of my time and money. Very unlikely to return again.\n\n",
        "Connor L\n12 reviews·5 photos\nRated 1.0 out of 5,\nReconsider going.. Absolutely the worst massage place I’ve ever been to! The massage was terrible, then when requesting that they do something about it the comments were sarcastic and dismissive.\n\n",
        "Rachael C.\n2 reviews\nRated 1.0 out of 5,\nWe tried absolute massage for the first time in early December and was very impressed and booked another appointment in late December.\n\nThe second session was an utter disappointment. Both our masseuses during our return visit had extremely poor techniques and executed the massage very hurriedly. The massage did nothing to relieve our sores. The standards of both massages were vastly different and it's surprising how the masseuse all working in the same parlour can have such different standards.\n\nThought this could be our go to massage place but will never return here again. Not worth the money at all. Extremely disappointing and a waste of time.\n\n",
        "koh claudia\n2 reviews\nRated 5.0 out of 5,\nLook for therapist Apple. I had a stiff lower back and aching joints when I first visited, and was so impressed by her skills as she loosened all of my knots. Her skills are consistent and service is good. I highly recommend her as she is very sensitive and can identify problem areas immediately. Apple is good :)\n\n",
        "Sha Ayumi\n5 reviews\nRated 1.0 out of 5,\nI never had a foot and back massage as bad as this. The worst experience. The masseuse kept giggling with her colleague through the session, no reflexology technique..shes the dark skinned, thai or Filipino short bob hair lady. Dipped my foot into tub and ask me to take out my foot without scrubbing and put my leg up. Oh gosh i was begging for the session to finish even before it starts. Worst experience $55 session ever!\n\n",
        "Patrick Neo\n1 review\nRated 1.0 out of 5,\nOne of the worst massage experience I had. Made a reservation for 40mins body massage at 12pm. Arrived on the dot, but the receptionist seemed to be caught offguard and unaware of my appointment. Did not bother checking their system either, so I just told her what I was there for and was ushered in.\n\nMassage start: the first stroke (upwards on my right back muscle), and her hands slipped and poked the back of my ear. I knew it was going to be a bad session.\nIn summary it was just a hasty, uncomfortable massage session. The strength was random, there seemed to be some pattern, yet erratic at times. Overall it just felt really unskilled.\n\nThe entire experience felt like she was really distracted and couldn’t wait for the clock to strike 40mins and leave (the irony that I felt the same way too). If you are looking for a definition of ‘going through motion’, this is it. Nearing the end of the session (maybe arnd 10mins to go), she seemed to be just finding things to while the time away - I think she spent a good 5mins playing piano on my neck/shoulder area, at times pausing for ‘too long’ as though she was using her phone or dozing off.\n\nAt the end of my session, was led out by another receptionist. No offer of water (by this point I didn’t expect it anymore). I promptly paid and left.\n\nNo relief of tightness and in fact I felt more soreness (NOT the shiok after massage kind of pain).\n\n",
        "Angela Liao\n1 review\nRated 5.0 out of 5,\nHighly recommend therapist Apple who is very experienced and helpful. She is able to identify my problem areas quickly and use her professional skills to loosen my knots. Will definitely come back regularly.\n\n",
        "Michelle Tay\n3 reviews\nRated 1.0 out of 5,\nLady Masseur is inexperience in terms of foot massage. Basically brushing and stroking so softly and never on the point! I never once had such a bad experience in foot reflexology! Will not recommend to this place. Wasted time n money! Oh, I did not know 10 mins of soaking feet is counted into the 60mins massage! Basically 50mins massage and 10 mins of soaking feet. :(\n\n",
        "Alexis Stanley\n2 reviews\nRated 5.0 out of 5,\nThis is my second visit tonight. Love the massage here and I'm glad\nthey have managed to solve the aircon issue with the mall's management.\n(It used to be making a lot of noises, but since it's centralised they\ncouldn't do much about it). Continue the good work!\n\n",
        "nur fatimah\n1 review\nRated 2.0 out of 5,\nWent for a massage for me and my husband after Circuit breaker period was over as both of us in need of a really good massage. Booked a 90mins full body massage for a total of $160 at the downtown east branch. Our first ever experience here. Me and my husband was 10mins late, they called us asking where we were and will wait for our arrival. Thank god they did not cancel our booking. The place look pleasant, clean and nice. Was escorted into a couple room and was left in the room without explaining on what to do next but that we don’t mind. The thing is, we can hardly relax due to the noise of the air-condition or the air vent. I’m not sure where the noise came from. It was sure not a pleasant thing to hear when you want to feel at peace during your pampering time. The massage too was so so. They really go hard on, focusing more on my upper body but hardly on my leg... For the whole entire 90mins of the massage, i can say 4/5 of the time were spent massaging my upper body... and sadly the 1/5 of time that were spent massaging my legs, nil effort was put in. I felt no pressure and they simply just massaging the oil onto my skin.. i felt that my money & time spent was totally not worth it. There are other places that i’ve been to that provide better services.\n\n",
        "Inda Permai\n1 review\nRated 1.0 out of 5,\nI booked 2 appointments 8.30pm and 9.30pm under 2 different names with 2 different types of services required via online. At 6.15pm, I called to cancel the 8.30pm, mentioning the name, type of service (Body Massage) and time of booking (8.30pm). When I came at 9pm (for my 9.30pm appointment), received by the Manager, I was told it was cancelled as well. I was told my slot was taken and to come another day. Yes, I was chased away that easy without apologising. The Manager said that when I cancelled 8.30pm appointment, means I cancelled 9.30pm too.. that's what she thought.The way the Manager handle the situation was bad.\n\n",
        "Melvin Ang\n5 reviews\nRated 5.0 out of 5,\nI got the foot reflexology. Great place for a relaxing massage. No hard selling, friendly therapist and good technique. Will definitely be going back there!\n\n",
        "J Riddell\n1 review\nRated 1.0 out of 5,\nHad a body massage here for the first time and the masseuse completed the massage in a very rushed manner. She was very rough and I am now bruised on my tailbone as a result.\n\n",
        "Krish Sheri\n1 review\nRated 5.0 out of 5,\nExcellent massage in the area. Professional experienced masseuses. Very affordable for the ambience and service. Will definitely return.\n\n",
        "Harin Singh\n2 reviews\nRated 1.0 out of 5,\nDid a 2 hour massage for my sore muscles at the Downtown East branch yesterday. Seriously did not understand what was going on as the massage felt very pointless. There was no proper technique. Wasted $100 and woke up today feeling the same soreness as before the massage.\n\n",
        "Felicia Lau\nLocal Guide·16 reviews·20 photos\nRated 5.0 out of 5,\nWas in need for a full body massage and tried this shop for the first time. My therapist Lin, was helpful throughout and she was really good.\n\n",
        "andy neo\n2 reviews\nRated 5.0 out of 5,\nA very nice place, therapist Apple was good in massaging , very professional and able to get my tired spots. Will return for massage occasionally.\n\n",
        "Dermacure sg\n1 review\nRated 5.0 out of 5,\nNever been to a spa myself. Was just walking pass the place and decided to visit. Was quite a decent place.\n\n",
        "Marcus Xiao\n3 reviews\nRated 5.0 out of 5,\nTheraphist apple, skillful in her massage skills, highly recommended!\n\n",
        "A L\n1 review\nRated 1.0 out of 5,\nFirst visit here and opt for 1 hr body massage and 30mins foot reflex combo. No proper technique and didn’t really help much with my sore neck and shoulder.\n\n",
        "Joel\n10 reviews\nRated 1.0 out of 5,\nMasseuse is poorly trained. My experience is similar to the other 1 star reviews.\n\n",
        "Nathanial Wong\n9 reviews\nRated 5.0 out of 5,\nthis is a good quality spa and value for money. Place has good ambience and services are good. highly recommend.\n\n",
        "Zhi Han Teow\n2 reviews\nRated 5.0 out of 5,\nRecommended by my friend. Been to many Spas but this is one of my favourite. Love the environment.\n\n",
        "Daniel Tan\n3 reviews\nRated 5.0 out of 5,\nFabulous massage, they also offer couple room for my partner & I. Totally recommend anyone who wants a good and relax massage with your love ones. Very good ambience too.\n\n",
        "Jo L\n1 review\nRated 5.0 out of 5,\nApple has become my go-to massuese ever since my previous one left. Her skills are great and superb customer service\n\n",
        "Wei Harn Chua\n2 reviews\nRated 5.0 out of 5,\nTherapist Apple is very good and experienced, and the admin is very accommodating and responsive. Highly recommended!\n\n",
        "Anonymous Person\nLocal Guide·16 reviews\nRated 4.0 out of 5,\nIt's ok. Nothing above the norm nor was there any bad experience. Service was given and received\n\n",
        "Jeff Tan\n2 reviews\nRated 5.0 out of 5,\nShiok and knots reliving massage by Apple! Look for her!\n\n",
        "Jiasheng Lin\nLocal Guide·28 reviews\nRated 5.0 out of 5,\nGood service, on the hard side for its tuina style bodywork\n\n",
        "raiyan roslan\n3 reviews\nRated 5.0 out of 5,\nFirst time trying this massage place and was totally satisfied with everything! Great service, friendly staff and an even better massage! Will come back definitely!\n\n",
        "bhart sheri\n3 reviews\nRated 5.0 out of 5,\nPlease support our local businesses.\n\n",
        "Sin Lee Ng\n3 reviews\nRated 5.0 out of 5,\nRefreshing experience. I recommend this place.\n\n",
        "Marzidah\n13 reviews\nRated 5.0 out of 5,\nAll in 1 beauty to save time\n\n",
        "庞生\n1 review·1 photo\nRated 5.0 out of 5,\n(Translated by Google) Very good, I like it very much, every physiotherapist is very polite and has a good attitude. Today is the physiotherapist Ha who helped me. After the end, I feel a lot more relaxed. I signed up for a membership today and can enjoy the membership price. Come on, it's really comfortable.\n\n(Original)\n很好很喜欢，每个理疗师都很有礼貌，态度很好，今天帮我做的是Ha理疗师，结束之后我整个人都轻松很多，今天办理了会员，可以享受会员价格，以后会常来，真的太舒服了，\n\n",
        "mallory Mcleod\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "juan clark\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Tammy Knight\n1 review\nRated 5.0 out of 5,\n\n\n",
        "malika anderson\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Kai Neko\n1 review\nRated 5.0 out of 5,\n\n\n",
        "weihua zhang\n2 reviews\nRated 1.0 out of 5,\n\n\n",
        "Lionel Khoo\n10 reviews\nRated 5.0 out of 5,\n\n\n",
        "Gregory Sharp\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Jay Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Fausto\n7 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Sharizah Shariff\nLocal Guide·64 reviews·77 photos\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "6214 9551",
    "Website": "http://www.absolutemassage.com.sg/"
}