{
    "Name": "Aramsa - The Garden Spa",
    "Products": {
        "Revive Me Centella Cleanser - Klynn Beauty (120ml)": "$28.00",
        "Wild Essential Oils (In-store/Online)": "$20.00 – $96.00",
        "Phytoprogenium Ultra Gentle Shampoo (250ml)": "$59.90",
        "Phytoprogenium Detangling Leave in Milk (150ml)": "$39.90",
        "Trilogy Vitamin C Polishing Powder (30g)": "$50.00",
        "Trilogy Vitamin C Moisturising Lotion (50ml)": "$65.00",
        "Trilogy Vitamin C Energising Mist Toner (100ml)": "$45.00",
        "Trilogy Vitamin C Booster Treatment (12.5ml)": "$75.00",
        "Trilogy Mineral Radiance Mask (60ml)": "$50.00",
        "Trilogy Hydrating Jelly Mask (60ml)": "$50.00",
        "Trilogy Hyaluronic Acid + Booster Treatment (12.5ml)": "$65.00",
        "Trilogy Firming Body Lotion (200ml)": "$50.00",
        "SkinCeuticals CE Ferulic (30ml)": "$248.00",
        "SkinCeuticals Silymarin CF (30ml)": "$248.00",
        "SkinCeuticals Phyto Corrective Essence Mist (50ml)": "$89.00",
        "SkinCeuticals Phyto Corrective Gel (30ml)": "$129.00",
        "SkinCeuticals Glycolic 10 Renew Overnight | 50ml": "$139.00",
        "SkinCeuticals Sheer Physical UV Defence SPF50 (50ml)": "$66.00",
        "SkinCeuticals Physical Fusion UV Defence SPF50 (50ml)": "$69.00",
        "SkinCeuticals Hydrating B5 Serum (30ml)": "$156.00"
    },
    "Address": "1384 Ang Mo Kio Ave 1, 2, Singapore 569932",
    "Opening Hours": "Saturday 10am–10pm\nSunday 10am–9pm\nMonday 10am–9pm\nTuesday 10am–9pm\nWednesday 10am–9pm\nThursday 10am–10pm\nFriday 10am–10pm\nSuggest new hours",
    "Rating": "4.9\n3,895 reviews",
    "Reviews": [
        "Chelzia Ping\n3 reviews·5 photos\nRated 5.0 out of 5,\nFirst time coming here with my husband. Stephanie and Yvonne served us. We choose the matcha green tea package. They are so friendly and professional. Yvonne who massage me, make me feel so comfy. The strength she used it just nice and I enjoy the whole session. I felt so relax and light after the session too! I will ask my husband to bring me back again!\n\n",
        "N I\n2 reviews·3 photos\nRated 5.0 out of 5,\nMy first visit to Aramsa spa was many years ago, and i remember it being a wonderful experience. Did a spa treatment recently, that comprises of a massage, scrub and floral milk bath. Nur was my massage therapist. She was professional and friendly throughout the treatment. She knew when to give quiet time when I was doing my massage, and also engaged me in friendly banter. She got the pressure points just right for my massage and made sure i was comfortable throughout my treatment. The floral milk bath was a highlight, where you get to soak amidst a garden-like surrounding. A wonderful experience indeed. I will definitely return for more spa treatments :)\n\n",
        "Jeremy Tan\n12 reviews·7 photos\nRated 5.0 out of 5,\nOur very first experience at Aramsa Spa was very wonderful and relaxing. Therapist Stephanie has displayed the highest professional in her job with excellent service extended to us. The massage we had was very unique and soothing. My stress are all gone! I will highly recommend this Spa to my friends and family. I also recommend Stephanie to everyone who is reading this review. :)\n\n",
        "Chelzia Ping\n3 reviews·5 photos\nRated 5.0 out of 5,\nFirst time coming here with my husband. Stephanie and Yvonne served us. We choose the matcha green tea package. They are so friendly and professional. Yvonne who massage me, make me feel so comfy. The strength she used it just nice and I enjoy the whole session. I felt so relax and light after the session too! I will ask my husband to bring me back again!\n\n",
        "N I\n2 reviews·3 photos\nRated 5.0 out of 5,\nMy first visit to Aramsa spa was many years ago, and i remember it being a wonderful experience. Did a spa treatment recently, that comprises of a massage, scrub and floral milk bath. Nur was my massage therapist. She was professional and friendly throughout the treatment. She knew when to give quiet time when I was doing my massage, and also engaged me in friendly banter. She got the pressure points just right for my massage and made sure i was comfortable throughout my treatment. The floral milk bath was a highlight, where you get to soak amidst a garden-like surrounding. A wonderful experience indeed. I will definitely return for more spa treatments :)\n\n",
        "Jeremy Tan\n12 reviews·7 photos\nRated 5.0 out of 5,\nOur very first experience at Aramsa Spa was very wonderful and relaxing. Therapist Stephanie has displayed the highest professional in her job with excellent service extended to us. The massage we had was very unique and soothing. My stress are all gone! I will highly recommend this Spa to my friends and family. I also recommend Stephanie to everyone who is reading this review. :)\n\n",
        "QiQi Yong\n3 reviews·3 photos\nRated 5.0 out of 5,\nHad the Himalayan Rejuvenation Body Scrub and Massage today! My therapist was Wendy! She is super welcoming and hospitable and made me feel at home. In terms of massage, she was very meticulous and takes it slow. She was not rushing at all, which I LOVE! She takes care of my entire body, including my head - all with the right amount of pressure. I enjoyed every minute of the session!\n\n",
        "Ying Yap DeFabio\nLocal Guide·249 reviews·2,270 photos\nRated 4.0 out of 5,\nGreat experience ! We had 90 mins massage .\nThe bed is heated .\nThe room is located in the middle of the garden , we can hear bird chipping which is really lovely .\nThe room smells really nice , brought us back to the spa in Bintan or Bali .\nThe music is super relaxing .\nWe signed the package immediately after our first experience . Which is really good deal .\nOne comment though, it will be great if they can serve a nice ginger honey water etc after the massage .\nI would say compare to Natureland, it is heaven (this one ) and hell (Natureland) .\n\n",
        "San Wong\n2 reviews·2 photos\nRated 4.0 out of 5,\nMy friend and I were assigned to Pat and Sally, who were both two amazing ladies. We enjoyed our 1 hour weekday promo massage in a couple room. The techniques were good and we felt like we were in Bali! Ambience and music were great too.\n\nCould be better - The company/reception should check if there’s any allergies to the massage oil used, be it the customer or masseuse. After the massage was completed and changed out, we were asked right away if we could do a Google review and I felt like I needed to do it on the spot. I think it should be asked by the receptionist instead after we make payment.\n\n",
        "Lyah Kwan\n2 reviews·2 photos\nRated 5.0 out of 5,\nMy husband and I were served by Hani and Jane. We were touched by their sweet gesture of decorating the room to celebrate our wedding anniversary. We absolutely enjoyed their massage - very thorough and soothing with the right amount of pressure to ease our aches and tiredness away. They are truly professionals in their trade.\n\nNot forgetting the staff members we met in Aramsa, thank you for your hospitality and warmth. Our time with you has made this special day more special. Thank you!\n\n",
        "Samantha Bek (samanthabek)\n7 reviews·23 photos\nRated 5.0 out of 5,\nI had such an amazing experience at Aramsa Spa. Stephanie and Fion was really great with the massage and it was so shiok until I fell asleep too. Definitely recommended!! Thank you very much.\n\n",
        "Sky David Joseph Lin\nLocal Guide·20 reviews·22 photos\nRated 5.0 out of 5,\nIt was a very lovely and great experience at Aramsa Spa!! Thank you Eileen and Jane for the excellent service and the pleasant surprise!  😄😄😄 Kudos Ladies!!! 😁😁😁👍🏼👍🏼👍🏼\n\n",
        "Laura Monaghan\n1 review\nRated 5.0 out of 5,\nI had the coconut spa package with Rena and it was absolutely amazing. Rena was very professional and diligent and made sure I was comfortable throughout the session. My back is extremely tight and she spent lots of time trying to get all the knots out to help me feel better. The treatment overall is pure heaven - highly recommend it. I will definitely be back! Thank you Rena x\n\n",
        "Michelle Lee\n2 reviews\nRated 5.0 out of 5,\nAwesome massage spa experience today. Came for a much needed massage at Aramsa Spa with hubby for his birthday treat. We had the racial harmony package and was attended to by Jane and Eileen. They even decorated the room so nicely!! Very thoughtful, therapeutic and soothing massage. We’ll be back in the very near future. Thank you Jane and Eileen and Aramsa Spa!\n\n",
        "Nur Khadijah\n2 reviews·3 photos\nRated 5.0 out of 5,\nI took up the Heritage Pacakage and was served by Lupin at the front desk. She was very helpful in explaining to us on our package. Following that we were served by Stephanie and Grace. They were friendly and approachable. The treatment was amazing and I felt relaxed after the entire session.\n\nThank you ladies.\n\n",
        "David Oon\nLocal Guide·146 reviews·678 photos\nRated 5.0 out of 5,\nBy far, my favourite spa in Singapore. And for the longest time too. Was first introduced by a friend back in 2008 to this resort-like get-away, tucked in the serenity and greeneries of Bishan Park, away from the hustle and bustle of city life. And we have not stopped returning since then.\n\nWhat exactly made me and my missus a long time fan, is none other than the warm hospitality, professionalism, attention to details of the skilful masseuses and counter staff. Special mention goes out to our regular masseuses, Jane Lim, Hani, Jan Toh, and others who has since retired or returned to their home country.\n\nWe are in good shape right now, it is by no small part, thanks to your constant care and advise for a healthier and happy life.\n\nAnd kudos too to the counter staff for your warm welcome, each time we head down for our appointment.\n\nTo the management, keep up the great job, retaining talents and keeping the spa in good shape all these years.\n\n",
        "Tsui Ping Ong\n2 reviews\nRated 5.0 out of 5,\nSpecially love the garden feel of this spa, that brings about a lot of peace and serenity before and after the treatment. I had the Bali Getaway treatment which was just nice in terms of duration and the massage was really relaxing. My therapist, Jen- was firm with her massage techniques and also very thoughtful during the session. As it was raining outside during my hot tub soak, she made sure the flooring was covered with towels to prevent me from slipping. The sounds of the rain really brought another level of peace and calming effect, and made me feel like I was really away in Bali. I totally enjoyed my experience at Aramsa, and hope to go back again soon.\n\n",
        "Pamela Koh\n7 reviews·3 photos\nRated 5.0 out of 5,\nRena and Tracy were both amazing - great massages!! the whole experience was wonderful and def worth a visit. Ambience was lovely too - doesn’t feel like you are in SG!\n\n",
        "NOOR OMAIRAH\n1 review\nRated 5.0 out of 5,\nI had a delightful time at Aramsa. The staff was very welcoming. I was served by Yvonne, an experienced masseuse. She was delicate and respectful. She didn't chat throughout my massage so I had a peaceful and relaxing session :)\n\nWould definitely return to try other services!\n\n",
        "carrine seo\n3 reviews·3 photos\nRated 4.0 out of 5,\nI walked in and was lucky to be able to arrange for a aroma rich massage in an hour’s time. There’s weekday promo now. It started off with a warm foot bath. The foot bath comes with salt and it’s just a quick foot wash honestly. Ann Tan was like a motherly therapist, she was very chatty throughout the whole treatment which kinda wear me out cos I just want to relax and sleep. She knows where my blocked points are in the upper shoulders and apply the right pressure. It’s disappointing the sauna and shower facilities can’t be used during covid! She’s also kind enough to show me some of the other outdoor bath rooms, they are beautiful! The whole experience takes me back to Bali. 1 point off because it seems like I have to give a review on the spot.\n\n",
        "Matilda Chua\n2 reviews\nRated 5.0 out of 5,\nI just went to Aramsa this afternoon for their Matcha Green Tea scrub and massage package. My masseuse was Pat and she was lovely. From the beginning she was very attentive of my needs and of prior injuries I had and took a lot of care to make sure to check in with me throughout the scrub and massage to make sure I was comfortable. I would definitely recommend this package to anyone looking for a relaxing experience and ask for Pat!\n\n",
        "Li Wanshu\n1 review·1 photo\nRated 5.0 out of 5,\nThere's something about being at one with nature that instantly calms your mind, body and soul. Hence, the concept of having spa in a garden compelled me to try out Aramsa at least once especially when I needed a short getaway from the daily hustle and bustle.\n\nWhen I reached Aramsa, the warmth and hospitality of staff really impressed me. I enjoyed every moment of my experience from start to finish. My masseuse was Jen and she was the sweetest person ever. I had really bad blisters on both feet that day and she went through the trouble of getting plasters for me without me even asking for it. ♥️\n\nThe massage was super shiok. Jen would adjust her pressure according to my body conditions and focus on the areas that were more tense e.g. neck, shoulders and glutes. I felt so much lighter and genuinely happier after the session.\n\nOverall, I highly recommend Aramsa and would definitely come back for another relaxing session.\n\n",
        "Stephanie Lau\n1 review\nRated 5.0 out of 5,\nI had a great experience on my first time at Aramsa with a 150-minute Racial Harmony Spa treatment. The environment and ambiance of the place was very peaceful, like I’ve been transported to somewhere exotic. My therapist Yvonne was attentive and comprehensive with the treatment. It was a great afternoon of relaxation.\n\n",
        "Chloe phang\n1 review\nRated 5.0 out of 5,\nRena and Tracy. Had a super great experience here on a spa day with my mom. We did the matcha and green tea boost, super relaxing with the perfect pressure for massage. Super nice environment located in a park surrounded by nature. Will definitely come back!\n\n",
        "Rose rez\n6 reviews·7 photos\nRated 5.0 out of 5,\nNow where do I even start... when I came I was greeted by a friendly staff and introduced me to the oils. I choosed mine and I was ushered to the waiting room. I was surprised as there isnt any promoting of other products( for me if there is, it will definitely be a major turn off) Im thn greeted by Marlia and proceeded to the room. I simply love the ambiance. I did the weekday promotion. When Marlia started to work with her magic hands i just simple knew she is someone with experience. I did the scrub first. The massage hasnt even started but i felt soooo relax. I was asked to take a shower and the outdoor area which feels like im in bintan! And my massage started. The pressure was on point. I felt some parts of my a lil strain but marloa seems to pick that up and she work on that part firm but gentle. I loved it when a warm weight was placed on my back and tummy when she moved to elsewhere. I could feel her calm energy which makes me relax. Like how sporean say.. \" syiok lah!!\" I will definitely return and perhaps Aramsa will be the only place i pampered myself. Thank you Aramspa and of course Marlia. Much love\n\n",
        "Aimee Cruz\n1 review\nRated 5.0 out of 5,\nI booked the Himalayan Rejuvenation package for my husband and I. For someone who is not fond of massages (unpopular opinion), the experience was a lovely surprise. Wendy and Fion, our therapists were amazing!!! I usually can't wait for my session to finish but this two-hour session at Aramsa was not enough for me. My husband was also thinking of when to come back next. The hot stone massage was truly nice. The ambience is lovely and made us feel like we are somewhere not in Sg. This was our first massage since the pandemic started and if you're planning to have one, I truly recommend coming here. The only thing that I hope they will do is serve some nice tea in the waiting area. But overall, our experience was great!\n\n",
        "Grace Lry\n6 reviews\nRated 5.0 out of 5,\nPat and Wendy were really good at their job - service and massage. I enjoyed my session with them. Would have been been better without having to wear mask however it’s understandable cos it’s due to covid and good that Aramsa follows the restrictions 😁\n\n",
        "Evelyne Wang\n5 reviews\nRated 5.0 out of 5,\nHad my first body massage with Aramsa today; it was a gift from my friends as I needed it badly after giving birth to my daughter last year. Therapist Yvonne was very good and make the entire session very comfortable for me. Her strength was just nice; not too light and it doesn’t make me feel pain. enjoyed it alot!\n\n",
        "Marcus Tay\n18 reviews·17 photos\nRated 5.0 out of 5,\nFirst visit here and am surprised by this spa experience in the middle of a park! Staff were friendly, polite, respectful and helpful. Was serviced by Stephanie and Gion today and it is indeed a recommended experience! Had the Green tea couples spa and it felt rejuvenating and great for a tired day's work. Thank you!\n\n",
        "Luo Yuzheng\n2 reviews·2 photos\nRated 5.0 out of 5,\nA great indulging experience with Aramsa Spa Bali Getaway package. Our therapists Sanisah and Hani were friendly and responsive to requests. Good job!\n\n",
        "Linda Yap\n2 reviews\nRated 5.0 out of 5,\nThis is my 1st time trying out Aramsa Spa after reading positive reviews online. It was a great spa experience for me. The staffs were well-trained and professional with special mention to my masseur, Rena. She was very attentive and highly skilled. The massage therapy relieve my sore muscles and tension. I walked out feeling refreshed and reenergized. Aramsa Spa will definitely be my go to choice for an awesome spa experience.\n\n",
        "Victor Raj\n40 reviews·140 photos\nRated 5.0 out of 5,\nGrace and Eileen are wonderful people who gave excellent service. The massage was excellent, and they went above and beyond to ensure that my wife's birthday decorations were in place. We were delighted because it was such a pleasant surprise.\n\n",
        "Nigel Ho\n3 reviews\nRated 5.0 out of 5,\nVery good service. Professional masseurs. Sally and Joey helped us to relax and focused on the areas that we wanted. The ambience was fantastic and it was nice to have a view of nature while being massaged. Clean towels and good supply of masks and disposable undergarments. My wife even fell asleep during the massage! It was so comfortable. Love the hot stones. The heat helped my muscles to relax and certain 'knots' on my shoulders to be loosened. Highly recommend the hot stones treatment!\n\n",
        "Alan Low\nLocal Guide·156 reviews·1,623 photos\nRated 5.0 out of 5,\nVery beautiful ambience, our therapists Hani and Rena were very professional and very good with their techniques. It's been a long time since I had a good massage like this. Hani was able to use the right strength and technique to loosen the knots in my back muscle.\n\n",
        "Shalini Sri Kumaran\n5 reviews\nRated 5.0 out of 5,\nHave been to Aramsa Spa a few times and simply love the garden and nature feel to the place to begin with. Had a wonderful scrub and massage by Eileen who listened to what my issues were and focused on making sure I felt so relaxed 😌. Will certainly recommend the spa to anyone and Eileen especially 😊\n\n",
        "dawn theseira\n1 review\nRated 5.0 out of 5,\nOur therapists Grace and Jen were very warm and friendly. They were professional in their service and truly made us feel welcome. Their service was top quality and the experience was very worthwhile for the price paid. Highly recommend the Aramsa couple spa package and will definitely purchase the package again. Thank you!\n\n",
        "Shiying Seow\n3 reviews\nRated 5.0 out of 5,\nI had the loveliest afternoon here with my mother. I decided to treat my mom to the aromatherapy rich treatment here for her birthday and had the Inner Respite (Deep Tissue Massage) treatment for myself, and the experience was great from the start. They communicated the service to us & had a wide selection of aromatherapy oils for my mother to choose from. Claudine attended to my mother & spoke comfortably to her in mandarin, making sure that her every need was met & that it was a comfortable experience for my mother throughout. When my mom requested to change her oils just before the start of the session, Claudine still went out of her way to make the change for her. Rena was my therapist and explained to me the different tensions in my body and applied the perfect amount of pressure to relieve the stress in my body. She was constantly making sure that my body was responding positively to the treatment and made sure I was relaxed and comfortable throughout. The environment was clean, calming, peaceful and so professional. No hard selling at all throughout & will definitely be back here again - whether it is for a treatment or a special occasion. Definitely worth the price and visit. :)\n\n",
        "Natasha Yow\n1 review·1 photo\nRated 5.0 out of 5,\nHad a wonderful Bali spa retreat with my partner. Linda and Ann were really attentive and communicative, ensuring that we were comfortable and relaxed throughout the session. Would definitely be coming back again!\n\n",
        "Si Man Tan\n5 reviews·4 photos\nRated 5.0 out of 5,\nVisited Aramsa today for their weekday promo 60 mins massage, went with the Aramsa Touch for the massage and added the Milk & Rose water therapy. My masseur today is Ms Sally Teh and she is really nice and even checked with me on the focus point for the massage which is my sore back. She focused more on my back and massage other parts nicely as well. Thank you Ms Sally for the great service today, I certainly feel more refreshed and will be back for more! :)\n\n",
        "Frederic J A Dubois\n1 review\nRated 5.0 out of 5,\nEileen & Yvonne\nVery good couple session with my wife . We chose the matcha and green tea boost package. They were very professional and nice .The environment is great. We left the spa very relaxed.\n\n",
        "Shirin Kwek\n1 review\nRated 5.0 out of 5,\nWe came here for our wedding anniversary and were really soooo pampered by the relaxing massage. And we really enjoyed ourselves in the outdoor milk rose bath, really felt like we were in a holiday resort overseas! Thank you Sally, Hani and Eileen for making this experience so positive and memorable- they had such great initiative and were very friendly,  and helpful.\n\n",
        "Clara Lim\n2 reviews\nRated 5.0 out of 5,\nRepeat visit. Our masseuse, Stephanie and Fion were great! Polite and very professional.\n\nThe spa is located in the middle of Bishan Park. Very quiet and the rooms were clean and gave a resort feel with trees surrounding. Keep a lookout for the promotions they run, usually value for money.\n\nOverall a great experience and one of the better spas around. Would definitely come back again.\n\n",
        "Madihah M\n1 review\nRated 4.0 out of 5,\nWent on 2 Dec for the weekday promotion: inner respite. Was received well at the reception area and given a questionnaire to fill up.\n\nAbsolutely loved the massage done by therapist Stephanie. Definitely an expert in the field; she could tell all my 'hard'/tense points and managed to relieve the tension.\n\nThe only parts I didn't like were: 1. the noisy lounge area; a group of non-locals were conversing loudly and taking photos while I was waiting to go to my room. I'd prefer a quieter environment which is soothing/relaxing, 2. The relatively thin walls; I could hear a man talking on his phone for a great length of time in the park as i was being massaged. Perhaps music can be louder.\n\n",
        "Jason Jiang\nLocal Guide·67 reviews·304 photos\nRated 5.0 out of 5,\nCosy, clean and comfortable spa and massage place with great service from Grace, Eileen and Astri.\nWill come again!\n\n",
        "Nur Syahirah\n2 reviews\nRated 5.0 out of 5,\nTracy & Reena were very meticulous and professional. Hands down the best spa ive ever tried. It was truly amazing. From treatment to environment down to every details. Will come back.\n\n",
        "Kelvin Chan\n1 review\nRated 5.0 out of 5,\nHad a 1 hr Inner respite massage session with therapist Wendy. Great massage skill, very experience and friendly therapist. I felt very comfortable after my session.\nFelt welcome by the front desk staffs as well,  they are friendly and courteous. Aramsa garden spa is a\ngood choice and highly recommended.\n\n",
        "Alan Cai\n4 reviews·2 photos\nRated 5.0 out of 5,\nGreat massage by Mook the massage strength is good, very relaxing . She Very friendly and polite. Great environment very soothing. I went with my wife and she like it very much. The couple room ambience feels very relaxing\n\n",
        "Michele Seah\n5 reviews·1 photo\nRated 4.0 out of 5,\nMy husband and a friend of mine all went to Aramsa Spa for a Sunday massage in late November 2021. Overall, the experience was pleasant and lovely. Chole and Pat were very professional as my husband's and my therapy massage consultants. However, we would have appreciated if we could be consulted with the types of massage oils for selection because I had a minor itchy skin reaction a couple of hours after our massage therapy. Perhaps a hypoallergenic oil may be best for the next massage therapy for customers with sensitive skin. Overall, we will be returning customers.\n\n",
        "Donna Al-Bu-Saidi\n6 reviews·1 photo\nRated 5.0 out of 5,\nI recently left Singapore after 2.5 years however, just before I left, I was lucky enough to visit Arasma Spa. My Best Friend had bought me a gift voucher for my 40th Birthday & so before I left, I wanted to put it to use after spending weeks packing up boxes. Initially when I called, there was no space for me before I left as the place was fully booked (completely understand why now). I was really disappointed & explained to the receptionist I was leaving. I'd prepared myself for having to sell the voucher however, she did everything she could to move things around & found me a slot.\n\nWhen I arrived, I was blown away. The Spa is in the middle of a park surrounded by nature & is incredibly tranquil. The rooms are amazing & you have your own little suite essentially with a garden bath. My Therapist was Hani & she was excellent. She really made me feel special & I enjoyed every moment. I am so happy that the wonderful receptionist found me a slot because it really was just a wonderful experience. I also ended up buying the shower gel they have in the guest rooms because it smelt SO DAMN GOOD. I would definitely recommend for those looking for some 'me time' & a good pampering.\n\n",
        "Huang S\n1 review\nRated 5.0 out of 5,\nMy first visit here and Claudine and Eileen were very attentive and great. The massage were thorough so is the body scrub. Would come back again!\n\n",
        "Sabrina Say\n5 reviews\nRated 5.0 out of 5,\nExcellent experience. You really feel out of Singapore with the ambience and that is already a major plus point. Masseur was friendly and also gave a great massage. Would love to come back again!\n\n",
        "Allison Joyce\n6 reviews\nRated 5.0 out of 5,\nVery lovely place to go for an evening spa! Extremely accommodating and helpful, especially online when I was booking in for an appointment. Was a little over the place with my changing dates and lots of questions, but they were answered and met at every go. Staff was friendly and patient when my partner and I arrived and Claudine and Sand, whom were our masseurs, were very kind. Clear guidance in how the session was going to proceed and a consistent assurance of our well-being. Claudine hit all the tense spots of my back, so if you're looking for a masseuse who has strong hands but won't hurt you, you know who to ask for! Very clean place, excellent service from start to finish. Would come back again.\n\n",
        "Jae Yjerramie\n2 reviews·2 photos\nRated 5.0 out of 5,\nStaff are extraordinary. I had a wonderful experience from the moment I step in until I went out. Everyone is friendly. Ira, my therapist is very professional and knows what she is doing. She is amazing. Would definitely recommend Aramsa Spa to everyone I know. Definitely worth it. This is the best thing that happened this week. Beautiful place, magical experience indeed best in Singapore!! Feel so good, better physically, mentally, emotionally, spiritually!! Greatly appreciate your service:)\n\n",
        "Jen Tiang\n8 reviews\nRated 5.0 out of 5,\nHani was an amazing therapist. Had the milk and roses soak and was so lucky to get the couples bathtub (to myself!). Would highly recommend. Felt like the perfect city escape.\n\n",
        "Hui San Yap\n12 reviews·11 photos\nRated 5.0 out of 5,\nBooked the weekday aromatherapy massage for mum and myself which consists of 30mins scrub and 60mins massage! It was a great experience from the start to end, bringing home with us our customized essential massage oil as well. Thumbs up to Pauline and Linda for the great massage and service!!\n\n",
        "Silin K\n2 reviews\nRated 5.0 out of 5,\nSuper massage provided by our masseurs - Claudine and Tracy. My husband and I were completely blown away by their service! The ambience was great too; we could hear crickets and birds outside and it felt like we were transported out of Singapore. Would totally go back again for another session!\n\n",
        "carol tan\n2 reviews\nRated 5.0 out of 5,\nHad a spa session served by Jen. Very professional and friendly. Great massage techniques. Would love to come back again. Only issue is it’s really popular so it’s hard to get a slot.\n\n",
        "Portia Tan Bee Wei\n2 reviews\nRated 5.0 out of 5,\nGreat service by Stephanie and Sanisah today. Very friendly and attentive to our needs as well. Will definitely visit again!!\nAppreciate the special arrangement made after I told them we are here for my hubby's birthday during booking.\n\n",
        "Jenn\n1 review\nRated 5.0 out of 5,\nStephanie is very professional, I had a good experience here, enjoyed the spa. Overall I am very satisfied with the massage, will definitely recommend to my friends. Thanks Aramsa and Stephanie\n\n",
        "Veronica Loh\n4 reviews\nRated 5.0 out of 5,\nHad the aromatherapy promotion package. Totally loved the service. The environment is beautiful and relaxing.\n\nThe therapists Pauline and Hani also did a great job with the massages. They listened to our concerns and addressed them accordingly.\n\nI also love the fact that we get to bring home the left over aromatherapy massage oils! Looking forward to my next spa exprience.\n\n",
        "Dila Rasiti\n8 reviews\nRated 5.0 out of 5,\nMy first time at Aramsa Spa. Seen friends IGS and was intrigued to try it. The ambience, service and staff was truly a 5⭐️ experience. If you (like me) want to have a retreat and some pampering experience, I suggest you book an appointment with their therapist NUR. Just the right pressure and knowledge for my body scrub, massage and later milk & rose petals bathtub soak. 🌹 will be back again for sure! ☺️\n\n",
        "Mag E\nLocal Guide·141 reviews·1,138 photos\nRated 5.0 out of 5,\nProbably one of the very few places in Singapore where you can enjoy your spa and massage experience amongst nature, away from busy malls and concrete city centre.\n\nAramsa is constantly fully booked, and it rightly should be. What a great massage experience, thanks to my therapist Eileen who took great care, from the moment I stepped in to the warm ginger tea at the tea room after the session. Did I mention the hot compress pillows and calming tune with 🐦 chirpings in the background.\n\nHighly recommended if you need to get away from it all during this time. Call them well in advanced and come experience this little piece of nature.\n\n",
        "Dawnie Lye\n2 reviews\nRated 5.0 out of 5,\nI enjoyed my session at Aramsa very much! Best gift ever. My therapist was Pauline and she was very good! Making the session comfortable and massage was very good.\n\n",
        "Pearly Lee\n1 review\nRated 5.0 out of 5,\nI would like to comment on the wonderful service provided by my therapists Jane and Eileen. It was the first time that I brought my boyfriend to the spa and he enjoyed the massage very much. We have booked our next session with Jane and Eileen in Jan 22 and looking forward to it.\n\n",
        "Nurliyana Ahmad\n1 review\nRated 5.0 out of 5,\nNur - Excellent service! very friendly staff. Easy to talk to. Make me very comfortable. Tells me all the things that I should know in the treatment. Would recommend her to my friends ☺️ Would def come again for her service 👍🏻\n\n",
        "Elaine Tan\n5 reviews\nRated 5.0 out of 5,\nMy husband and I enjoyed the Swedish massage with Eileen and Sanisah. I was so sore and tight coming in and did not want to leave the massage room as it was so comfortable. Will definitely come back. ❤️\n\n",
        "Estee Leong\n1 review·1 photo\nRated 5.0 out of 5,\nScrub and massage done by spa therapists Rena and Claudine were fantastic. Patient to answer all our questions.\n\n",
        "Erika Lee\n2 reviews·2 photos\nRated 5.0 out of 5,\nPauline and Stephanie were very professional in their massage techniques and also excellent in their service - my partner and I enjoyed the couple massage very much and can’t wait to be back again! They made sure that we were always comfortable and took really good care of us throughout our time here - truly outstanding experience :)\n\n",
        "Catherine MacLean\n2 reviews\nRated 5.0 out of 5,\nHad a divine couple of hours at Aramsa for their Exotic Coconut Treatment. Jane did an exceptional job and made me feel so relaxed the entire time. All other staff were extremely welcoming and friendly, and offered umbrellas when a poorly time downpour happened as I was leaving. All covid-safe protocols were followed, but it didn’t detract from the lush and calming setting.\n\n",
        "Yee Pheng Ho\n1 review\nRated 5.0 out of 5,\nTherapists Hani & Sally, our usual therapists are all the above!\nThey are friendly, caring (my mum is 88 yrs old) and good at their work delivering much needed deep tissue massage and relief to our weary n stiff bodies.\nThank you\n\n",
        "TCA Lakshmi Narasimhan\nLocal Guide·20 reviews·18 photos\nRated 5.0 out of 5,\nFantastic and serene experience. Came here for the couples massage and Stephanie and Pauline were quite good. Stephanie helped ease out a lot of knots. Very understanding and just the right pressure.\n\nThe surroundings made us feel like we were in a different city. A great retreat experience.\n\n",
        "Andriana Agustin\n3 reviews\nRated 5.0 out of 5,\nWent for 150 mins Racial harmony on 22 November 2021 and was serviced by Rena. The ambience is very relaxing, the treatment room is clean, and most importantly the therapist is superb. I'm not sure how she managed to hit all the knots and I definitely feel much lighter after the treatment. I will definitely visit again :)\n\n",
        "Oksana Prokofieva\n3 reviews\nRated 5.0 out of 5,\nMy hubby and I have enjoyed our anniversary at Aramsa spa. Eileen and Hani made our day an unforgettable one. Thanks for the massage and wonderful flower bath.\n\n",
        "Yalçın Dizdar\n4 reviews\nRated 5.0 out of 5,\nWe had  couples exotic coconut treat with my wife and it was an awesome experience. Our therapists Nur and Rena were just perfect. Thanks for everything !\n\n",
        "Michelle Koh\n2 reviews\nRated 5.0 out of 5,\nGreat service. Great ambience. Everything is awesome! Husband booked a 3 hour spa for my birthday and they squeezed me in. Eileen was very experienced! Not only did she helped me with photo taking in the room, she also told me where to stand, and when I should take a photo! 🤣 Thank you Eileen!  Her massage and facial therapy were excellent too!\n\n",
        "aruj tandon\n1 review\nRated 5.0 out of 5,\nGreat experience with Pauline and Hani. They both were very welcoming and made our anniversary special spa experience great. Will definitely recommend them if you planning to visit here.\nI booked 2 months in advance to get desired day and time so better be prepared for that.\n\n",
        "Elin Koh\n6 reviews·10 photos\nRated 5.0 out of 5,\nFirst visit to this garden spa. Understanding and helpful customer service as they explained their various services over the phone. Tried their couple spa and selected the Balinese package. It was a lovely relaxing experience. Therapists Sally and Rena were both attentive and professional to our needs for the massage. The ambience was nice n tranquil with the chirping of birds and greens.\n\n",
        "Ezarelle D\n3 reviews·9 photos\nRated 5.0 out of 5,\nHad a 90 mins prenatal massage by Hani. It was so good and comforting that I was a little upset when the time was over hahaha Her technique was great and I can feel her kneading through all my tension points. She's really friendly and it was fun making small chats with her too~ Would recommend!\n\n",
        "Rabiatuladawiyah Mohd Razif\n2 reviews\nRated 5.0 out of 5,\nWhat a wonderful experience once again at Aramsa Spa! We chose the couple package and the two ladies who attended to us Yvonne and Eileen were superb! We especially love the massage session and it was super relaxing. They are gems! Would definitely return again!\n\n",
        "Abigail Chung\n2 reviews\nRated 5.0 out of 5,\nCame for the Tropical Lulur package with my sister. Our therapists were Rena and Wendy. They were very professional and made the experience highly enjoyable. Everything was hygienic and pleasant. Really appreciate that they provide masks too.\n\n",
        "Madumathi Rajendran\n2 reviews\nRated 5.0 out of 5,\nAramsa is a hidden gem! Had the most relaxing experience and my masseuse Sally is amazing. She was very friendly, professional and made me so relaxed and free at the end of our session ! Will definitely revisit often . Thanks Sally!\n\n",
        "dee Fan\n1 review\nRated 5.0 out of 5,\n1st time visiting this place and loving it. The whole place has a calm and pleasant vibe with friendly customer service. We were given choices of essence oils to suit our mood. Our masssuer Linda and Yvonne are superb, skillful and the pressure is how we like it to be. We are totally relaxed after the massage. Will definitely visit again.\n\n",
        "Arina Adom\nLocal Guide·6 reviews·20 photos\nRated 5.0 out of 5,\nSally & Rena were amazing with their service! My friend and I had a lovely experience. We thoroughly enjoyed our time here. Highly recommended!\n\n",
        "allan lange\n1 review\nRated 5.0 out of 5,\nEileen and Sand were two very good massage therapists. Enjoy the massage secession that was provided by our daughter for our 47 yr Wedding Anniversary.\n\n",
        "Seraphina Yan\n1 review\nRated 5.0 out of 5,\nWent with a friend and had the aromatherapy scrub and massage with an add on milk and rose bath. The therapists were cheerful, pleasant and skillful. They made us feel comfortable and relaxed throughout the pampering session. Will definitely re-visit :) our therapists were Nur and Rena.\n\n",
        "琳琳\n10 reviews\nRated 5.0 out of 5,\nRena and Wendy are both friendly and thoughtful. We came without telling them it was for our honeymoon. The moment they came to realize it, they help us with rose petals decorations prior to our hot bath. It was such a pleasant experience and the massage was wonderful. We had such a good experience with Aramsa and I strongly recommend their service. Thank you once again!\n\n",
        "CHEN SEONG WONG\n2 reviews\nRated 5.0 out of 5,\nChloe was an excellent therapist! Massage was fantastic, the environment was clean and soothing. Everything was so good - just what I needed :)\n\n",
        "Nursyahidah Sukemi\n1 review\nRated 5.0 out of 5,\nMy dear husband surprised me with a pampering session for our first anniversary. I had a enjoyable time with Nur. She had explained the treatments and the different scrubs and oils throughout the session. When shared that I was her last client for the day, I'm delighted by her energy and drive to serve her best after a long day. She also gave some tips along the way as I told her that I am a new mother. Lovely way to end my anniversary! Thank you Nur! Wish her all the best and that she'll be reunited with her family soon!\n\n",
        "Neelan Sarojini\n1 review\nRated 4.0 out of 5,\nAfter a long time, went for a massage. Upon reaching there I was warmly and cheerfully welcomed by the receptionist. She took time to further explained about my package that I had previously purchased. Then I was ushered to the massage room where the massage therapist Ms. Grace performed her services with exceptional skill. She was polite, respectful and knowledgeable in performance of her duties.\nOne thing I sorely missed is their lemongrass and ginger tea with biscuits.\nI will continue visits them for my massage needs.\n\nThank you Aramsa for your services provided.\n\n",
        "Azizah Ismail\n1 review\nRated 5.0 out of 5,\nOne of the best massage! Jen Thoh attended to me. We choose middle to hard and it was the same pressure from starting to end. She asked if there are any areas that I want her to focus on. I told her my shoulders and calves. I was so satisfied as she somehow found all the tired points. Recommended!!\n\n",
        "Shohini Sengupta\nLocal Guide·24 reviews·7 photos\nRated 5.0 out of 5,\nWe had a wonderful Couple's Bali Getaway today. Pauline and Stephanie were fantastic and made us feel very pampered. I'm fairly sure this was one of the best massages that I have experienced in Singapore!\nLoved everything about our time here and will definitely be back again! :)\n\n",
        "Samantha Choo\n2 reviews\nRated 5.0 out of 5,\nMy husband and I were served by Pauline and Stephanie. Great massage services. In addition, the room was well decorated and arranged by Eileen. Will definitely come for visit again.\n\n",
        "Siva Prakash\n3 reviews\nRated 5.0 out of 5,\nPauline and Rena the masseur were good. Strength was to our liking. Environment was nice and calming. We both fell asleep. Started off with a nice scrub and bath after that. Then massage. Everything was nice. Thank you!\n\n",
        "Chloe Yap\n1 review\nRated 5.0 out of 5,\nThank you Stephanie for the wonderful massage. The press was very good. Thanks for the friendly service rendered. :) Will definitely come back again!\n\n",
        "F Basrai\n2 reviews\nRated 5.0 out of 5,\nThe ambience is amazing, no other place in singapore beats this. Our masseuses Pat and Sally were professional and highly skilled. They also listened to our requirements carefully before starting the massage. My wife and I would definitely freqeuent this place again and recommend other couples to do so too.\n\n",
        "diana ho\n3 reviews·3 photos\nRated 5.0 out of 5,\nA very relaxing and rich aroma massage I had at Aramsa . Highly recommended . I truly enjoyed . It’s really good . I’m being served by Fion .Thank you Fion! Excellent skills. :))\n\n",
        "S-Kay Gopal\n2 reviews\nRated 5.0 out of 5,\nPauline and  claudine did a spa service for my ans my wife. They did an excellent service and the massage was really awesome. It was a great time and we really enjoyed. Both of them were very dedicated and looked after us very well. We will be back again and will look for Pauline and Claudine\n\nRegards\n\nSiva\n\n",
        "Faraliza Tan\n1 review\nRated 5.0 out of 5,\nThe whole spa experience was very relaxing and the ambience was lovely! Joey and Grace delivered excellent service and we were very relaxed from the massage. We will definitely come back again.\n\n",
        "Gary Teo\n2 reviews\nRated 5.0 out of 5,\nYvonne is great! The massage is high quality and the use of strength can be adjustable when asked. I was guided into a deep relaxation and all of my muscles were loosened when she applied pressure. Highly recommended!\n\n",
        "Selena LAHAIE\n2 reviews\nRated 5.0 out of 5,\nI just experienced the Weekday Aromatherapy Special with Eileen Kay and truly enjoyed it! She’s an excellent massage therapist that hits all the right pressure points! The ambiance at Aramsa Spa is very grounding and energizing 🌴🌳🌱🌿 I highly recommend it !\n\n",
        "Anthony Chan\n4 reviews·2 photos\nRated 5.0 out of 5,\nStephanie and SuniSha are skillful and professional. My wife and I are enjoying a good massage and they make a wonderful evening for us.\n\n",
        "Anjana Narayanan\n3 reviews\nRated 5.0 out of 5,\nStephanie did an amazing and relaxing massage. The spa is quiet and tucked away from the hustle and bustle of Singapore. Totally worth a visit.\n\n",
        "Olivier H\nLocal Guide·83 reviews·412 photos\nRated 4.0 out of 5,\n2nd time (updated review)\nMassage was still really good but overall service  below the first time (Welcome, payment, ...)\nAnyway still a good and recommended place. Few photos added.\n\n(First review) So good ... A bit pricey unfortunately, else I would come far more often.\nBeautiful zen place 👍😉\n\n",
        "Luzelle Jones\n4 reviews\nRated 5.0 out of 5,\nFirst visit to Aramsa and will be back! Professional and friendly staff. Great facility. Can’t fault them on anything. Had an amazing treatment with Wendy for wrap, scrub and massage.\n\n",
        "Sheri Kan\n2 reviews\nRated 5.0 out of 5,\nWas attracted to Aramsa - The Garden Spa due to their good reviews and their affordable weekday massage package! …More\n\n",
        "tyeb papar\n2 reviews\nRated 5.0 out of 5,\nJen and Eileen were excellent and very polite.We did a couple spa.Both of them coordinated everything very well and smooth.We were very happy with their service. Keep it up.\n\n",
        "Prama Sundari\n1 review\nRated 5.0 out of 5,\nPat and Linda were friendly and good in massaging. They explained the process and constantly checked if we were OK. The experience was nice.\n\n",
        "Meihan Boey\n1 review\nRated 5.0 out of 5,\nHad a great massage by therapist Wendy. Beautiful place and I took advantage of the weekday special. At $108 for an hour massage I felt it was worth the price, as this included aroma oils & hot stones. Feels like being in Bali! Definitely recommended.\n\n",
        "Esther Che\n1 review\nRated 5.0 out of 5,\nHad a great time of relaxation at Aramsa. The extensive space of lush greenery really brings another dimension of relaxation with nature. It was like being transported to a different world. Pauline was attentive and her massage was on …More\n\n",
        "Cherlyn Tang\n1 review\nRated 5.0 out of 5,\nMy first time here was lovely! While it was last minute, I managed to get an appt with the help of the friendly staff. The entire experience was very nice, especially the massage. I always have stiff neck and shoulders, and Eileen placed …More\n\n",
        "j j\n1 review\nRated 5.0 out of 5,\nLinda is very good and patient. She really works at all my muscles and makes me feel very relaxed. Highly recommended!\n\n",
        "Adz Saadon\n1 review\nRated 5.0 out of 5,\nShout out to great service by Ms Pauline, Ms Eileen and Ms Fion. Awesome experience and great care by them to make us comfortable throughout too. They made it extra special with an impromptu birthday decor when they found out it was my hubby’s birthday. Super sweet!\n\n",
        "amelia chee\n1 review\nRated 5.0 out of 5,\nPauline and Grace were very good and polite on our coming to the spa. Very skilled and made sure that we were comfortable and relaxed during our appointment. The staff Eileen even provided me for charger because I was losing battery. Overall really really good experience\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6456 6556\">6456 6556</span>",
    "Website": "http://www.aramsaspas.com/"
}