{
    "Name": "At Ease Foot Reflexology & Body Massage",
    "Products": null,
    "Address": "7C Binjai Park, Singapore 589821",
    "Opening Hours": "Saturday 11am–10:30pm\nSunday 11am–10:30pm\nMonday 11am–10:30pm\nTuesday 11am–10:30pm\nWednesday 11am–10:30pm\nThursday 11am–10:30pm\nFriday 11am–10:30pm\nSuggest new hours",
    "Rating": "5.0\n18 reviews",
    "Reviews": [
        "\n\nRated 5.0 out of 5,\n\n\n",
        "\n\nRated 5.0 out of 5,\n\n\n",
        "\n\nRated 5.0 out of 5,\n\n\n",
        "Mohd A.\nLocal Guide·99 reviews·403 photos\nRated 5.0 out of 5,\nFirst time visiting here upon recommendation from a friend and had no regrets. Clean and quiet vibes — perfect for an hour or two of relaxation. The masseuse I had was skilled and the massage was amazing.\n\nAbsolutely no package sales pressure tactic whatsoever, in fact they didn’t talk about it at all at the counter or during the massage.\n\nWill recommend and will come again!\n\n",
        "Kedar Tembe\nLocal Guide·217 reviews·30 photos\nRated 5.0 out of 5,\nThe best massage I've had in Singapore, and I've tried at least 50 different places. At ease has the best therapists and I love the lighting and the music they play there. It's very reasonable priced, and a special mention of Rose, who is the best masseuse I've had in Singapore by a long shot. Their membership is very reasonable, and member costs are really very reasonable. They also give a membership insurance which protects the customers if the spa closes down. 💯% will recommend this place\n\n",
        "Jeremy Tan\nLocal Guide·42 reviews·40 photos\nRated 5.0 out of 5,\n1) All masseurs are highly skilled and can give a good rubdown.\n2) The ambience is so comfortable. Dimmed lights, soothing ambient music, cool and comfortable environment.\n3) The little touches really perk me up: Cold towels before the massage, warm foot soak before massage, flower tea served before massage, big and comfortable massage chairs, free and fast WiFi, and free apples for customers. Talk about holistic enjoyment!\n4) the price point is really valuable considering all they are providing to clients.\n\nI would absolutely be recommending this to anyone who asks. And if I may go one step further, I think this is the best massage place in Singapore!\n\n",
        "Eugene Ang\n1 review\nRated 5.0 out of 5,\nHi,\nMy Spouse and I have been visiting here as member for 5years since their previous establishment at Bukit Panjang.\nAll the way consistant services and skillful massage.\nEspecially appreciate to staffs Ms. Amy, Jasmine, Wei Wei.\nHighly recommended this place!\n\n",
        "Maria Ng\nLocal Guide·74 reviews·15 photos\nRated 5.0 out of 5,\nI came for the weekday afternoon massage special. I like the soothing ambience, friendly service, and best of all, great massage! If you’re in the area, this is the massage place to check out!\n\n",
        "Kenneth Leow\n4 reviews·1 photo\nRated 5.0 out of 5,\nHave been frequenting them for years. Clean and comfortable environment. Cheers!\n\n",
        "SG Food Travel\nLocal Guide·239 reviews·398 photos\nRated 5.0 out of 5,\nFormerly known as Ming Zu Foot Reflexology in Upper Bukit Timah which offered good massage. Quiet environment for relaxing. Suggest to book in advance to avoid disappointment.\n\n",
        "Lisa Ti\nLocal Guide·89 reviews·282 photos\nRated 5.0 out of 5,\nReally nice relaxing place. Lovely, friendly service. Not too expensive. Would come back here again!\n\n",
        "Carl Tan\nLocal Guide·36 reviews·192 photos\nRated 5.0 out of 5,\nPolite service. Good quality of massage.\n\n",
        "Khairul Azmi\nLocal Guide·14 reviews·21 photos\nRated 5.0 out of 5,\nGood service, good massage\n\n",
        "World Traveler\nLocal Guide·31 reviews·22 photos\nRated 5.0 out of 5,\n(Translated by Google) Oooh aaaaah\n\n(Original)\nOooh aaaaah\n\n",
        "Milesthng\n32 reviews·10 photos\nRated 5.0 out of 5,\n\n\n",
        "Tony Greaney\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Sophia Yeo\n6 reviews\nRated 5.0 out of 5,\n\n\n",
        "James A\n12 photos\nRated 5.0 out of 5,\n\n\n",
        "Elixiee\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Glenda Ng\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Angie Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 9661 0832\">9661 0832</span>",
    "Website": "https://atease.sg/"
}