{
    "Name": "Beauty World Thai Massage",
    "Products": null,
    "Address": "144 Upper Bukit Timah Rd, #01-18, Singapore 588177",
    "Opening Hours": "Saturday 10am–10pm\nSunday 10am–10pm\nMonday 10am–10pm\nTuesday 10am–10pm\nWednesday 10am–10pm\nThursday 10am–10pm\nFriday 10am–10pm\nSuggest new hours",
    "Rating": "4.7\n66 reviews",
    "Reviews": [
        "Stefanie Lim\n9 reviews\nRated 5.0 out of 5,\nStaff is friendly, kind and patient. I would highly recommend this place! They don't try to upsell and are very accommodating. Massage is excellent as well.\n\nGreat and consistent pressure applied and i left feeling like well kneaded dough. I almost fell asleep!\n\nSomeone previously left a review saying they were bothered by the staff chatting with each other while massaging. This doesn't bother me at all and doesn't take away from the fact that the masseuse is excellent. I could care less that she's chatting away during a 2hr massage as long as she gets my kinks out.\n\nWill 💯 be back!\n\nI hope they stick around for awhile!\n\n",
        "claire kwan\nLocal Guide·11 reviews·9 photos\nRated 5.0 out of 5,\ndecided to come here after seeing a friend's igstory about how this is her monthly go-to. first time doing a full body thai massage and first time here as well. opted for 60mins with oil, paid $54. had a lovely experience and i think this is going to become my go-to for full body thai massage as well hehe. fuss-free, good vibes, warm staff, clean and cozy, friendly and skilled masseur. hurt a little here and there because my shoulders/neck/upper back is/are really quite tight, but a good amount of strength was used. nothing too unbearable. keep it up!!!! :>\n\n",
        "Dominic Neo\nLocal Guide·36 reviews·47 photos\nRated 5.0 out of 5,\nThoroughly enjoyed a fantastic oil massage - $78 for 90 mins - by Nat. She applied consistent pressure and assured technique. 100% recommended for physically active folks who have hip/lower back aches. You feel like you’re transported back to Bangkok with the Thai music as well.  Great value and experience. Will definitely be back.\n\n",
        "Stefanie Lim\n9 reviews\nRated 5.0 out of 5,\nStaff is friendly, kind and patient. I would highly recommend this place! They don't try to upsell and are very accommodating. Massage is excellent as well.\n\nGreat and consistent pressure applied and i left feeling like well kneaded dough. I almost fell asleep!\n\nSomeone previously left a review saying they were bothered by the staff chatting with each other while massaging. This doesn't bother me at all and doesn't take away from the fact that the masseuse is excellent. I could care less that she's chatting away during a 2hr massage as long as she gets my kinks out.\n\nWill 💯 be back!\n\nI hope they stick around for awhile!\n\n",
        "claire kwan\nLocal Guide·11 reviews·9 photos\nRated 5.0 out of 5,\ndecided to come here after seeing a friend's igstory about how this is her monthly go-to. first time doing a full body thai massage and first time here as well. opted for 60mins with oil, paid $54. had a lovely experience and i think this is going to become my go-to for full body thai massage as well hehe. fuss-free, good vibes, warm staff, clean and cozy, friendly and skilled masseur. hurt a little here and there because my shoulders/neck/upper back is/are really quite tight, but a good amount of strength was used. nothing too unbearable. keep it up!!!! :>\n\n",
        "Dominic Neo\nLocal Guide·36 reviews·47 photos\nRated 5.0 out of 5,\nThoroughly enjoyed a fantastic oil massage - $78 for 90 mins - by Nat. She applied consistent pressure and assured technique. 100% recommended for physically active folks who have hip/lower back aches. You feel like you’re transported back to Bangkok with the Thai music as well.  Great value and experience. Will definitely be back.\n\n",
        "Skylight Neo\n4 reviews·1 photo\nRated 5.0 out of 5,\nSeriously this is one of the best Thai massage you can find in Singapore.\n\nFrom feeling sluggish, heavy and aching, all my shoulder ache and pain were gone within that 1 hour body massage session (highly recommend with oil) Coco really know how to find the point that is causing the ache and use her skills and pressure to get rid of it.\n\nSeriously rather than medicine, sometimes all you need is one good Thai massage session. Highly recommend!\n\n",
        "Timothy Wong\n18 reviews·10 photos\nRated 5.0 out of 5,\nMade a booking via whatsapp and came down to this shop without much expectation because I just wanted a simple massage to ease up all those tension after working from home for too long. Arrived way earlier before my appointment time and from the shop front, it seemed like a small unassuming shop operated by a few aunties.\n\nSaw a lady sitting outside the shop and told her that I am early for my appointment but she mentioned that it's fine and allowed me to proceed in anyway. Turned out that she (Coco) is actually the owner of the shop. Massage was superb and felt much better than what I paid for. I added another $10 to try out cupping and Coco made me comfortable while also explaining the benefits to me.\n\nThe walls are paper thin and the masseurs talk to each other quite a lot during the massage session, so if noise troubles you then this might not be the place for you, but if you are looking for a good authentic solid Thai massage, then you found just the right place.\n\n",
        "Tart T\nLocal Guide·139 reviews·156 photos\nRated 5.0 out of 5,\nStrong massage given by Coco herself - comfortable experience and really felt she put the perfect amount of pressure to remove the kinks, especially in my shoulders. Cracking at the end was an interesting touch as well. Highly recommend\n\n",
        "Mavrik Oni\n4 reviews·8 photos\nRated 5.0 out of 5,\nStumbled upon this hidden gem.\nI opted for traditional massage 1hour @ $49(Aug National day promo)\n\nMasseuse Min was very friendly and skilled!!\nShe also constantly checked if I was ok with the pressure\nLots of cracking and stretching.\nReally enjoyed my session with her , all the tension in my body was released felt like a new born lol.\n\nDon't expect high class spa pattern ,\nthis is your no frills super authentic thai massage.\nA little bit of happy chatter here and there but overall positive vibe.\nBetter to call for appointment as they have limited space.\n\nSo glad I found this place, already looking forward to my next visit!\n\n",
        "Hong Yi Teo\nLocal Guide·18 reviews·10 photos\nRated 5.0 out of 5,\nHighly recommended Thai massage. Better than the massages I've had in Thailand or jb (Bangkok Spa and some others)\n\nSo far, I've always asked for Joy. V controlled pressure and she does the cracking well. Helping to share cos business hasn't been good due to covid and they're having an offer till end august. 49 for 1 hour oil massage.\n\n",
        "Belinda Yap\n10 reviews\nRated 5.0 out of 5,\nDone 120mins oil massage with Cindy today. She was professional and friendly. Felt so much better after the massage. Definitely worth the trip.\n\n",
        "Rachel Ong\nLocal Guide·22 reviews·107 photos\nRated 5.0 out of 5,\nExcellent massage! Feels very authentic! :) Was very relaxed after the massage. I went for the $30 head and shoulder massage. It was very worth it!\n\n",
        "T M.Y.\n4 reviews·4 photos\nRated 5.0 out of 5,\nDo not be deceived by its unassuming appearance :D even though it may not look grand, the staff are very skilled and they get the job well done. Fuss free. Warm and happy staff. Good pricing. Ache was gone and I could lift up my head again after the massage. Will visit again!\n\n",
        "Janice Tsai\nLocal Guide·44 reviews·174 photos\nRated 5.0 out of 5,\nFirst time trying this place out. I called to make an appointment for the same day and was accommodated accordingly. Went with the 1 hour oiled massage at $54. The rooms were extremely dark and housed in makeshift rooms of plywood walls and curtains. The masseuse all talked amongst one another over the curtains but it wasn’t a big deal because they were all having a good time, plus it didn’t jeopardize the massage itself.\n\nThe massage itself felt SO good. Pressure was consistent throughout the entire massage. At the end, the lady cracked my back and neck and released literally years of built up tension. It was SO loud we both were a bit shocked and laughed. I was offered warm water after. 100% would recommend!\n\nNote: They don’t accept visa or AMEX. Only cash, grabpay or paynow.\n\n",
        "jason Li\n13 reviews·6 photos\nRated 5.0 out of 5,\nGood proper clean Thai massage. Loosened my stuff muscles. Masseur was patient with my request for differing strength level and muscle groups\n\n",
        "august ken\n4 reviews·1 photo\nRated 5.0 out of 5,\nI went there because i been looking for a good massage parlour , Some other thai massage has alot of negative reviews so i second guess until i stumble upon this amazing massage parlour, honestly it was the best massage ever!! Staffs are v nice, highly skilled & friendly.. I also post about this parlour to my instagram!! I will come back again after 1 month!!\n\n",
        "Marlina Tugimin\n2 reviews\nRated 1.0 out of 5,\nMassage is ok but masseurs kept talking in Thai among themselves across the rooms and masseur kept going out to pick up ringing shop phone. Frustrating and irritating.\n\n",
        "Wong Wong\nLocal Guide·87 reviews·32 photos\nRated 5.0 out of 5,\nCoco is a very experience lady.. Price is reasonable and provide good Thai massage\n\n",
        "b0r1ng3rZz\nLocal Guide·22 reviews·77 photos\nRated 4.0 out of 5,\nVery authentic Thai massage. It is noisy but it is good.\n\n",
        "Audrey Ngo\n15 reviews·26 photos\nRated 5.0 out of 5,\nThe best thai massage I ever had in Sg + bkk vibe. 1 hour flew by too quickly!\n\n",
        "Han Han\nLocal Guide·82 reviews·22 photos\nRated 5.0 out of 5,\nNo frills and very good Thai massage just like in Thailand. With or without oil. They knead and crack your trouble away.\n\n",
        "Max N\nLocal Guide·48 reviews·85 photos\nRated 5.0 out of 5,\nNo frills, reasonable price and good service. The massage therapist (didn't get her name) was very good with maintaining her strength. Always had very stiff neck and shoulder, but the 1 hour session was excellent. I had communicated to her about my desire to focus more on my neck and shoulders and she did focus on these areas unlike other places I have been to.\n\nIt was also fairly easy to get a slot (Monday afternoon). But do call in advance to check with them! Overall very pleased with the service provided. Will definitely return again!\n\n",
        "andreean\nLocal Guide·41 reviews·59 photos\nRated 5.0 out of 5,\nVery good place for Thai massage, skilled therapist and friendly atmosphere. I felt like in Thailand :).  I do recommend this place!\n\n",
        "kop Ping\n4 reviews·3 photos\nRated 5.0 out of 5,\nMade a booking for two today. Massage turned out to be way BETTER than any other shops we frequent. Massage was smooth. Pressure point was precise. Nothing to complain of. Really.. Highly recommended!!\n\n",
        "Anthia\n7 reviews\nRated 5.0 out of 5,\nThis no-frills massage spot is a hidden gem! The massage therapists are from Thailand and they specialise in authentic Thai-style massage, which will sort out your pesky knots and tight muscles. Lady boss Coco was my therapist and I fully recommend her for her perfect pressure and expert hands. My hour-long session was painful but worth it as I felt much more relaxed after. Booking via Facebook was very easy too!\n\n",
        "Pei Ling Lim\n6 reviews·2 photos\nRated 5.0 out of 5,\nJoy was helpful and had really good massage skills. She relied the knots in my body easily! The 2 hours massage was worth the time and money!\n\n",
        "G (TC)\nLocal Guide·305 reviews·1,732 photos\nRated 5.0 out of 5,\nGreat massage by Pauline. First time I've had a Thai massage and I really enjoyed it. Pauline was fantastic\n\n",
        "Melody Tan\n5 reviews·6 photos\nRated 5.0 out of 5,\nI've had chronic backaches for the last 12 years ever since my Scoliosis operation. Been to many massage parlours everywhere - Sg, Msia, Thailand, Cambodia, Indonesia... in hopes of getting my stubborn knots (esp neck, shoulders & back) sorted.\n>Comms - Fb messaged on Xmas eve to book a slot for 2pax. Got prompt replies by early the next morning and was scheduled a slot on Xmas day.\n>Ambience - Looks a little shady from the outside. 6 beds avail, separated by curtains. No sound proofing so you can hear all the masseurs chatting in Thai throughout, but it adds to the feel I guess. Coupled with Thai music playing softly, I really thought I was in Bkk.\n>Skills - Linda was amazingly strong and thorough. She acknowledged that my back was problematic but persisted in pressing the knotty areas. Linda has been there for 10yrs, so she was definitely pretty pro. Hands-down one of the BEST massage sessions (wanted 1.5hr but was only given 1hr as they were gonna close early on PH). 200% CONFIRM GOING BACK. GO TRY IT YOURSELF :D\n\n",
        "Jay Lim\n4 reviews\nRated 5.0 out of 5,\nMassaue name LINDA is very skillful. She is a very experienced and skillful maassaue who provides very good massage. Unlike other massaues that you will feel pain after the session. She is very well versed in her technic to give our tired body a nice relax massage. Highly recommend to you, worth every penny spent.\n\n",
        "Vic Nash\n2 reviews\nRated 5.0 out of 5,\nAwesome message by mint. Very good place the ladies may be older but they have good strength and skills. Really recommend for anyone who is frequently exercising and need to recover fast.\n\n",
        "KL Cheong\n4 reviews\nRated 5.0 out of 5,\none of the best Thai massage in SG.\n\n",
        "Karen\nLocal Guide·105 reviews·73 photos\nRated 5.0 out of 5,\nThere are no sound proof compartments and the masseurs talk to each other across each compartments. BUT the massage is very very good. will return again.\n\n",
        "james tay\nLocal Guide·97 reviews·208 photos\nRated 5.0 out of 5,\nFriendly, professional, quality massage.\n\n",
        "Gladys Kang\n6 reviews·2 photos\nRated 5.0 out of 5,\nGood authentic Thai Massage.  Woudl recommend to anyone looking for Thai Massage by Thai ladies as there are not many in Singapore\n\n",
        "Vicky.F Kheo\nLocal Guide·86 reviews·116 photos\nRated 5.0 out of 5,\nReal authentic thai massage experience in Singapore. All masseur are from Thailand.\n\n",
        "Sandra Ong\n20 reviews·52 photos\nRated 4.0 out of 5,\nWent there twice... Can try!\nStaff are friendly. Boss Coco is good with her skills. Do call for appointment to avoid waiting...\n\n",
        "Lester Kok\nLocal Guide·149 reviews·1,258 photos\nRated 5.0 out of 5,\nVery authentic Thai massage\n\n",
        "Karthikeyan Puniamoorthy\n12 reviews·6 photos\nRated 5.0 out of 5,\nOne of the best massages I've had in a long while.\n\n",
        "Kanto Momo\nLocal Guide·30 reviews·32 photos\nRated 5.0 out of 5,\nVery thai,  feel like bangkok, massage was good.\n\n",
        "Nat Yang\nLocal Guide·18 reviews·7 photos\nRated 5.0 out of 5,\nGood massage and friendly aunties.\n\n",
        "Adrian Seah\n102 reviews·186 photos\nRated 4.0 out of 5,\n60min is $54\nMassage is good !\n\n",
        "AK\nLocal Guide·182 reviews·495 photos\nRated 4.0 out of 5,\nThis is true...professionalism...rectify my rib cage strain...👍🏻\n\n",
        "Serene Ang\n13 reviews\nRated 5.0 out of 5,\nGood massage\n\n",
        "GX WEN\n1 review\nRated 5.0 out of 5,\nHighly recommended!👍👍👍\n\n",
        "florence RG scorps\nLocal Guide·49 reviews·286 photos\nRated 4.0 out of 5,\nNice place\n\n",
        "Gigi Goh\nLocal Guide·9 reviews·2 photos\nRated 5.0 out of 5,\n\n\n",
        "Zhen Wei Kong\nLocal Guide·19 reviews·18 photos\nRated 5.0 out of 5,\n\n\n",
        "Kugi Papa\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "byron go\nLocal Guide·7 reviews·163 photos\nRated 4.0 out of 5,\n\n\n",
        "Kam Tong Jamey Poon\n2 reviews·6 photos\nRated 5.0 out of 5,\n\n\n",
        "issui shioura\n2 reviews\nRated 4.0 out of 5,\n\n\n",
        "Valobashar kicho kotha\n7 reviews·12 photos\nRated 5.0 out of 5,\n\n\n",
        "Sumit Das\nLocal Guide·21 reviews·51 photos\nRated 3.0 out of 5,\n\n\n",
        "Azy Abdullah\n2 reviews·2 photos\nRated 5.0 out of 5,\n\n\n",
        "Low Zhijun\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Lavinia C\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "june003\n7 reviews\nRated 3.0 out of 5,\n\n\n",
        "Ashley Gupta\n16 reviews·2 photos\nRated 4.0 out of 5,\n\n\n",
        "Zephyr Mak\n5 reviews·9 photos\nRated 5.0 out of 5,\n\n\n",
        "Jitender Verma\nLocal Guide·134 reviews\nRated 5.0 out of 5,\n\n\n",
        "qiu yuanxing\nLocal Guide·4 reviews·24 photos\nRated 5.0 out of 5,\n\n\n",
        "Cindy C\n5 reviews·13 photos\nRated 5.0 out of 5,\n\n\n",
        "Kali Sharma\n4 reviews·11 photos\nRated 5.0 out of 5,\n\n\n",
        "SRS BACK\nLocal Guide·16 reviews·204 photos\nRated 4.0 out of 5,\n\n\n",
        "N. Hanie\n1 review\nRated 5.0 out of 5,\n\n\n",
        "shannon yeo\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Bernard Chan\nLocal Guide·12 reviews\nRated 4.0 out of 5,\n\n\n",
        "Firaz Kamal\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n"
    ],
    "Phone": "6467 1557",
    "Website": "Info is not retrievable"
}