{
    "Name": "Blind Massage Services",
    "Products": null,
    "Address": "1 Tanjong Pagar Plaza, #02-55, Singapore 082001",
    "Opening Hours": "Saturday 11am–8pm\nSunday 11am–8pm\nMonday 11am–8pm\nTuesday 11am–8pm\nWednesday 11am–8pm\nThursday 11am–8pm\nFriday 11am–8pm\nSuggest new hours",
    "Rating": "4.8\n164 reviews",
    "Reviews": [
        "Eden Lau\nLocal Guide·21 reviews·7 photos\nRated 5.0 out of 5,\nI went at noon on a Monday — they took me in immediately and the service was so warm and friendly! As the shop name suggests, everyone here is hard of sight. The shop interior is dim/dark. The massage was FANTASTIC. Got myself a 45min foot and 45min shoulder massage for a cool $50. Definitely coming back here again.\n\n",
        "Sharon Eng\nLocal Guide·14 reviews·16 photos\nRated 5.0 out of 5,\nReally good place to get a massage! Especially after sitting at the desk all day. The prices are unbeatable, the therapists are skilful and the place is neat and tidy. The best thing is that you will be supporting dignified work for persons with visual disabilities. ❤️\n\nUpdate: My shoulder ache disappeared the next day! So impressed I’m gonna go back every week!\n\n",
        "CK C\nLocal Guide·661 reviews·1,604 photos\nRated 4.0 out of 5,\nNo frills massage at reasonable prices (Note recent changes). There are many masseurs and their skills are comparable to (if not better than) those in the  ‘normal’ parlours.\n\n",
        "Eden Lau\nLocal Guide·21 reviews·7 photos\nRated 5.0 out of 5,\nI went at noon on a Monday — they took me in immediately and the service was so warm and friendly! As the shop name suggests, everyone here is hard of sight. The shop interior is dim/dark. The massage was FANTASTIC. Got myself a 45min foot and 45min shoulder massage for a cool $50. Definitely coming back here again.\n\n",
        "Sharon Eng\nLocal Guide·14 reviews·16 photos\nRated 5.0 out of 5,\nReally good place to get a massage! Especially after sitting at the desk all day. The prices are unbeatable, the therapists are skilful and the place is neat and tidy. The best thing is that you will be supporting dignified work for persons with visual disabilities. ❤️\n\nUpdate: My shoulder ache disappeared the next day! So impressed I’m gonna go back every week!\n\n",
        "CK C\nLocal Guide·661 reviews·1,604 photos\nRated 4.0 out of 5,\nNo frills massage at reasonable prices (Note recent changes). There are many masseurs and their skills are comparable to (if not better than) those in the  ‘normal’ parlours.\n\n",
        "Janis Lim\n4 reviews\nRated 5.0 out of 5,\nFirst time visit. Did a 1 hour foot and 1 hour shoulder/back. The massages were fantastic, even better than some of the top massage places in SG. The therapists hit the right spots and helped to relieve the tension in problematic areas. Thank you! Will definitely come back again.\n\n",
        "Andrena Ong\n3 reviews·7 photos\nRated 5.0 out of 5,\nDefinitely one of the best place to get your stiff shoulders and tired soles fixed. Super on point in the massage and the pressure is just nice for me.\n\nGreat service and value for money!\nPlease call and book so they can take in more customers. :)\n\n",
        "Andy Lo\nLocal Guide·118 reviews·269 photos\nRated 5.0 out of 5,\nReally enjoy my visits. I’ve been visiting this establishment regularly. The price is exceptional for the level of quality I get. I have chronic pain in my leg due to an injury in the past and I am quite physically active. The masseuse are visually impaired, but their heighten sense of touch allows them to know where exactly on your body requires more attention. Really excellent place to get a no to thrift massage.\n\n",
        "Vivien Ng\nLocal Guide·98 reviews·182 photos\nRated 5.0 out of 5,\nProbably the cheapest massage in town! Masseurs are very skilled, and the massage was really comfortable. Will definitely come back!\n\n",
        "Julia O\n6 reviews\nRated 5.0 out of 5,\nI would say I had the best massage I have ever gotten here! Its different from your regular spa massage since amenities are basic but the skills of the masseuse is top notch, they can target all the right and sore spots with precision with the right amount of force. And price is soooo reasonable compared to all other massage places. HIGHLY RECOMMEND COMING HERE FOR MASSAGE\n\n",
        "Arvind Kozhiyalam\nLocal Guide·114 reviews·29 photos\nRated 5.0 out of 5,\nOne of the better Massage services are offered here. The place is housed in Tanjong Pagar Plaza, and is easy to find. Staff are courteous, task oriented and customize the pressure as needed. Definitely with return as the value for money is very very good.\n\n",
        "Adrian Soh\nLocal Guide·8 reviews·13 photos\nRated 4.0 out of 5,\nHappened to be in the area and was looking for a place to soothe a backache. Better than expected. Did a 60min back and 60mins foot massage. Was there slightly after lunch hour and just before the crowd came. Lucky to be able to get my massages without having to wait. Will be back again\n\n",
        "X H\n3 reviews\nRated 5.0 out of 5,\nI’ve been here a few times but realised i have not given them a review. Their massage are always on point, their staff are friendly and happy. I always get a great massage from them and has recommended my family and friends to come here. Please support them during these pandemic as business hasn’t been that good. You will not regret coming here :)\n\n",
        "Nurul Mimsy\nLocal Guide·72 reviews·300 photos\nRated 5.0 out of 5,\nHonestly one of the best massage sessions that I’ve had. The place isn’t of spa standards but it’s the technique and friendly service that would make me return to this place. The prices are also very affordable for the services that are offered.\n\nI’m really happy to see a place like this where our visually impaired friends can have an opportunity to find an honest living. I hope one day, you guys will be so successful that you can franchise and open multiple outlets across Singapore. Keep up the good work! ❤️\n\n",
        "Leroy Koh\n2 reviews·9 photos\nRated 5.0 out of 5,\nWent for a 60 minute head shoulders and neck massage in the evening with my girlfriend. I made an appointment the previous day through SMS with the phone number listed on their Facebook page and glad I did because the place was packed; for a good reason\n\nThe services rendered are professional, no frills and to the point. Once we got started, I let the masseuse (Richard) know about pains/tightness I was experiencing and he began pressing away, all whilst asking if the massage was ok. Funny question by him because it was a great massage, felt A LOT of relief in my back and shoulders immediately after.\n\nWill be returning here regularly and trying out the full body and foot massages!! I’m sure I won’t be disappointed :)\n\n",
        "Lau Sherwin\n4 reviews·1 photo\nRated 5.0 out of 5,\nFuss-free but excellent- there probably isn't anywhere else providing comparable service at such prices and location. They don't use oils, so you can even pop by before an appointment in town. I suggest calling ahead if you're going on a weekend (I go almost every other week), and ask for Desmond (my go-to). Enjoy!\n\n",
        "Esther Ong\nLocal Guide·46 reviews·14 photos\nRated 5.0 out of 5,\nVery skillful masseuses. Just from massaging, they could tell my tight muscle issues and did their best to loosen it.\n\n",
        "Riri T\n3 reviews\nRated 5.0 out of 5,\nSeriously they are really good. I used to visit many massga place from China Town to city to ... but this place is just different level. I satisfied ALWAYS from each different massager. They are humble and great customer service. I love it. It is far from my house but I won't go other massage place,  except here. Thank you so so much!!!! I will come back again soon.\n\n",
        "Amy Ling\n3 reviews\nRated 5.0 out of 5,\nPopped by for a random massage and was assigned Kim. Did a 30 mins shoulder + 30 mins foot massage for $30. Value for money. Kim was skilful and exerted good pressure on my aching calves. Massage was better than I had expected! It was my first and definitely not my last visit 👍\n\n",
        "yuankang liu\nLocal Guide·44 reviews·3 photos\nRated 5.0 out of 5,\nNo frills massage place located in the CBD area. The massage was strong and effective. The staff are friendly and from the constant stream of customers one can see the popularity of the place. Will definitely come back for another session.\n\n",
        "Minkyung Park\nLocal Guide·206 reviews·376 photos\nRated 5.0 out of 5,\nI strongly recommend this shop, you must go there!! I went there with my husband today, staffs were amazingly kind and professional. Now my shoulder and neck are so soft .... like no stress moment!! I will definitely be there again :)\n\n",
        "Dorachmifasola Mew\n7 reviews·1 photo\nRated 5.0 out of 5,\nReally heart warming place with detailed massage patterns that ease muscle tensions and every massage press was with suitable strength. Had the full body massage at affordable price and non-stop massaging for 60minutes. Susan specially helped me with massaging my hand thats super tense. The whole experience was really relaxing and will come back again!\n\n",
        "Shaun Khoo\n8 reviews·11 photos\nRated 5.0 out of 5,\nHave aching back pain and decided to try it out 11 Jan. Body felt light after the massage. Feels good. Price is reasonable.\n\n",
        "Rick Neo\nLocal Guide·55 reviews·186 photos\nRated 4.0 out of 5,\nSimple & basic place for message. The masseurs are experienced and they are able to address the sore points.\n\n",
        "jeremy ho\nLocal Guide·17 reviews·22 photos\nRated 5.0 out of 5,\nAwesome experience. Foot and shoulder massage super shiok and worth it! Everyone is very experienced and ultra friendly, they can even remember your name after the 1st visit. Highly recommended\n\n",
        "Zheng Waiwai\n49 reviews·9 photos\nRated 5.0 out of 5,\nVery friendly people. No frills attached but the service is very good and they get their job done, they’ve helped to remove my knots several times and it really feels quite shiok at the end of it. Can indulge in friendly conversations with them too. Cashless payment is available. Will visit again for sure!! Thank you!\n\n",
        "amanda amanda\n4 reviews·2 photos\nRated 5.0 out of 5,\nPin pin gives the best full body massage. Ladies who are afraid of painful massages, fret not. She will customize the pain level according to your tolerance :)\n\n",
        "hau teng\n5 reviews·4 photos\nRated 5.0 out of 5,\nEnjoyed the full body massage. Masseur was attentive and skilful, able to ease off my tensed neck, shoulder and lower back from lots of desk works\nEnvironment is simple, neat and clean.\nWill recommend to friends and back again :)\n\n",
        "Isabel Phua\n1 review·1 photo\nRated 5.0 out of 5,\nHIGHLY RECOMMENDED and must go!\nNo regrets. Don't expect spa environment but the deal is the skill, point and technique. Amazing massage. Tried the full body massage.\nAll the points on point.\nAll the knots not there.\nSuch relieve and baby sleep after the massage. Staff were also very understanding to keep volume minimal and not chit chatting during the massage. Best I've every tried from oil to deep tissue to lymphatic etc, this massage is the best and will definitely return and make this my regular spot.\n\n",
        "Melissa Koh\n9 reviews·11 photos\nRated 5.0 out of 5,\nFriendly, no sales pressure vibe. Kept checking back if the pressure points were OK for me and encouraged me to voice out if not. I went 2 times in a week. Cured my sore shoulders. Looking forward to going back!\n\n",
        "Evlin L\n10 reviews·1 photo\nRated 5.0 out of 5,\nGreat, affordable recommendation from a friend! Enjoyed the experience and nice conversations. Staff are very friendly and massage strength was good (Thank you Richard/dreamer!)\n\n",
        "Doris Leung\n15 reviews·20 photos\nRated 5.0 out of 5,\nI go there weekly. Affordable and strong massage. I have tried so many massage places all around Singapore and this is the only place I keep coming back. You do need to book ahead especially on the weekend since they get quite packed. Please give them a try if you are looking for a good no frill massage!\n\n",
        "Teresa Lo\n1 review\nRated 5.0 out of 5,\nGreat service as usual and very friendly people. I don't usually post reviews but I just felt very bad when I heard about customers who made booking but did not turn up and did not pick up the phone when the masseur called to check if the customers are coming. As a result they lost income for that hour as they turned down a few walk-in enquiries as they reserved the slot for the customers who did not turn up in the end. Do call them to inform if there is any change to your plans and they will appreciate that. Richard was very patient to help with my sore neck and shoulder. Thank you!\n\n",
        "Eveline How\nLocal Guide·16 reviews·6 photos\nRated 5.0 out of 5,\nGreat massage by blind masseurs who want to use their skills for their own livelihood. Wee Sin, Pin Pin, Swee Tin, Desmond, and their team are trained to do foot reflexology and body massage. I find myself alternating between foot massage, shoulder and back massage, and full body massage (fully clothed). Text for a time slot and Wee Sin will reply quickly. Appointments are highly recommended as they can get busy.\n\n",
        "Goh Kim\n9 reviews·6 photos\nRated 5.0 out of 5,\nGood place for the massage.\nAffordable price and friendly.\nHope they open in East side.\n\n",
        "Nicholas Poon\n6 reviews\nRated 5.0 out of 5,\nIt was my first time here and I got to say that Bernard was great! I will definitely recommend my fellow peers to come and try out this place!\n\n",
        "Gyuri Jung\nLocal Guide·160 reviews·9 photos\nRated 5.0 out of 5,\nI loved the massage and the quiet, relaxing ambiance. The gentleman who massaged me was very skilful and I felt much better after the treatment. Do not expect a five star spa quality interior, but the service  definitely deserves five stars.\n\n",
        "E Lee\n7 reviews·7 photos\nRated 5.0 out of 5,\nThis place offers great massages at reasonable prices. Tried the shoulder-feet bundle and both areas. especially the shoulders felt much better afterwards. The shoulder massage includes brief massages of the head and arms. Shifu who did the massage was skilful and friendly, as were the other staff of the place - friendly, humourous and good at what they do.\n\nDefinitely worth repeated visits.\n\n",
        "Kara S\nLocal Guide·127 reviews·39 photos\nRated 5.0 out of 5,\nI was achy after my flight from London and the shoulder neck massage was just what I needed. The staff are kind and very talented. Great value for money.\n\n",
        "Ruth Lee\n5 reviews·1 photo\nRated 5.0 out of 5,\nI booked Pin Pin for 1h full body massage and 30min foot reflexology today. Both were amazing 😊 She expertly knows where to press with the right amount of pressure. She has great customer service - asking where I would like to focus on, and even asking if I am wearing slippers/shoes to see if she needs to wipe down my feet. And for $55 for 90min - what value for money!!! Do support them!!\n\n",
        "Jason Lim\nLocal Guide·132 reviews·798 photos\nRated 5.0 out of 5,\nWell I am a repeated customer here. Services are good I strongly recommend bernard for those who are having sore parts and can withstand strong force. Value for money but best part is able to support the disabled in the society and encourage them to work\n\n",
        "S T\nLocal Guide·153 reviews·198 photos\nRated 5.0 out of 5,\nChance upon this place while having food at tanjong pagar food center. Not your atypical massage place. The staffs are visually impaired. Why they special then? It is their non discriminating way of serving customer. In a typical place. Most other operators will judge you via your physical build and deploy unusual heavy strength and thus sometime resulted in bruising.\nThis place however is different, 3 of my attempts were greeted with masseuse who consistently ask about the area of concern and will consistently kneeling out the stuff muscle. Result: painless smooth out muscle.\n\nExpect long queue and turn away for walking customer. please do call 1 day in advance for arrangement.\nAlso good note to ask for their name for future return.\nThey are generally nice chatter. Make their day great and they will make your greater.\n\n",
        "Steph Y\n19 reviews·19 photos\nRated 5.0 out of 5,\n30min foot + 30min shoulder massage for $30 🙌🏼 Super good deal and also the masseuse did a really good job not just 摸摸而已. Even though we started around 7+, they still agreed to the 1hr combo and ended up eating their dinner late. V nice pp too 😌\n\n",
        "HY TAN\nLocal Guide·9 reviews·5 photos\nRated 5.0 out of 5,\nFirst time trying, friendly people and good massage\n\n",
        "Secularism\n2 reviews\nRated 5.0 out of 5,\nI will write based on my experience since this is my first time going to their place :\n\n1) You can request either male or female masseur.\n2) Do make a call and book for appointment date and time first before heading down.\n3) Affordable and a simple ambience.\n\nOveralls, they did a professional job. I choose full body massage and reflexology foot massage. It's nice. Looking forward to come again one day.\n\n",
        "Dennis Heng\nLocal Guide·101 reviews·67 photos\nRated 5.0 out of 5,\nDid a 30 minute neck and shoulder massage with Wee Sin, and it was really great. Prices are affordable, located in town area but the shop may be a little hard to locate. Would definitely be back if i’m around the area again!\n\n",
        "Kissy Distributor\n2 reviews\nRated 5.0 out of 5,\nI had a 30 minutes neck and shoulder massage done by Richard. It was an amazing massage, i felt my tensed muscles were so much relieved. Will definitely be back again.\n\n",
        "Eileen Ng\n7 reviews\nRated 5.0 out of 5,\nEnjoyed the massage experience here! The masseurs are so friendly and we can feel the warmth. Highly recommended\n\n",
        "Suzanne Sim\nLocal Guide·90 reviews·101 photos\nRated 5.0 out of 5,\nHad a very good body (fully clothed) massage by the lady therapist. She used the right amount of pressure and i can feel a sense of release in my neck and shoulder, which has been tight for a while now. Very clean environment. I noticed that they changed the sheets and towels after each customer - very commendable. They accept cash or card. I will definitely come again.\n\n",
        "Tarcisus Ho\nLocal Guide·360 reviews·2,473 photos\nRated 5.0 out of 5,\nReally love the massage here. Best and most affordable massage I experienced.\n\nWent for a hour massage which cost $30. Consist of 30 mins of foot and 30 mins of neck and shoulder massage. The touch by the therapist is therapeutic and meaningful. Love the neck and shoulder massage which help to ease some nagging tension.\n\n",
        "Renuka Gopal\nLocal Guide·55 reviews·275 photos\nRated 4.0 out of 5,\nHad a massage session done. It was a pretty enjoyable session. Best to go more often to figure out which masseuse is better for you. The prices are good as well. Always best to make an appointment as well, as sometimes they may not be able to handle walk-ins.\n\n",
        "Alex C\n19 reviews·1 photo\nRated 5.0 out of 5,\nHad one of the best massages here! No more knots, no more aches. Fantastic service with most attentive, caring and loveliest people. I would recommend 100%!\n\n",
        "Haessal Kim\n5 reviews\nRated 5.0 out of 5,\nI had a great experience! So skillful and caring people here. Definitely I will come back. Just a little tip, make sure you have eaten something before the massage! No empty stomach recommended as it can get you dizzy.\n\n",
        "Iwan Yuliyanto\nLocal Guide·112 reviews·118 photos\nRated 5.0 out of 5,\nVery affordable price. Enjoyed the shoulder, neck and back massage. Do call them to make appointment beforehand.\n\n",
        "T Lo\nLocal Guide·70 reviews·40 photos\nRated 5.0 out of 5,\nA shop that situated in an old plaza. Much like a heartland place despite located at cbd area.  The masseuse is very experience and massage my migraine away. Good value for money. Massage with clothes on and yet the massage is effective. Staff are very friendly.  Will go again.\n\n",
        "Eunice Chan\n43 reviews·128 photos\nRated 5.0 out of 5,\nHighly recommend the bundled package! Masseuse was highly skillful and really cured my sore shoulders :)\nPayment methods accepted: Paylah, Cash\n\n",
        "Jasmin M\nLocal Guide·51 reviews·155 photos\nRated 5.0 out of 5,\nWe loved this place, is really low key and looks like mostly locals go there. They did a really good job, and we left feeling relax! They know what they are doing when it comes to massages. If you are expecting a fancy place, this is not it, but you won’t regret it\n\n",
        "G Chan\nLocal Guide·12 reviews\nRated 5.0 out of 5,\nwent for massage on a sat afternoon. lucky there was a slot.\nI was having very bad backache. gd massage. though very pain, but feel very relax after that.\nlike another customer, they really work on ur knots. unless u complain very pain.\nsmall, clean and unassuming space.\nvery reasonable charges\n$30/hour - massage of head, neck and shoulders\n\n",
        "Gary Goh\nLocal Guide·49 reviews·133 photos\nRated 5.0 out of 5,\nProfessional masseuse, really enjoyed the service. Do book in advance. These guys are so good they get booked up pretty quickly\n\n",
        "Orlin Vladikov\nLocal Guide·23 reviews·41 photos\nRated 5.0 out of 5,\nExcellent massage at a very reasonable price. Highly recommended by a regular.\n\n",
        "Andre, PH Koo\nLocal Guide·249 reviews·1,297 photos\nRated 5.0 out of 5,\nChanced upon this shop today and was very impressed. Had a tight shoulder and the massuer helped untie the knots. Definitely will come again\n\n",
        "Yeelyn T\nLocal Guide·68 reviews·43 photos\nRated 5.0 out of 5,\nOverall its a friendly environment. The shifu who help to massage is skillful and attentive. Will definitely go again. 👍\n\n",
        "Sunday Fun-day with Aisha\n4 reviews\nRated 5.0 out of 5,\nIt's my go to place for a massage! They are very dedicated and best with their job. I like supporting them. Highly recommended!\n\n",
        "Ayaka\nLocal Guide·12 reviews\nRated 5.0 out of 5,\nMy therapist was really great. Not only he understands right lints, he was very sincere until the last moment. It’s worth coming here.\n\n",
        "J G (DigiJ)\nLocal Guide·51 reviews·17 photos\nRated 5.0 out of 5,\nFound this from other reviewers and it really didn't disappoint. Very friendly masseurs with very strong touch and knows how to work out those knots. Prices are extremely reasonable too for what they're offering.\n\n",
        "K K\nLocal Guide·111 reviews·163 photos\nRated 5.0 out of 5,\nWalked in today and was lucky to squeeze in a 30mins session. The blind massage was great! They recommended to call to book and I'll sure will!\n\n",
        "Rachel Trezoglou\nLocal Guide·31 reviews·33 photos\nRated 5.0 out of 5,\nSuper good massage where they ask if the pressure is okay\n\n",
        "Steven Nohal\n8 reviews\nRated 5.0 out of 5,\nI found these people to be genuinely caring and very knowledgeable about massage and its benefits. I had a great experience and would highly recommend them to anyone looking for a good massage.\n\n",
        "Hosky\n14 reviews·3 photos\nRated 5.0 out of 5,\nGreat massage and the loveliest staff that really know their stuff. Prices are sensational as well. I highly recommend.\n\n",
        "Chris Lai\nLocal Guide·136 reviews·480 photos\nRated 5.0 out of 5,\nDeep tissue massage at very low and affordable prices. Show your support for the blind community!\n\n",
        "Weiping Liu\nLocal Guide·7 reviews\nRated 5.0 out of 5,\nThey are good! Hit the right spot almost immediately and with good strength. Definitely value for money. My to go to now when I feel a need for massage.\n\n",
        "Chong Bee Yen\nLocal Guide·38 reviews·9 photos\nRated 4.0 out of 5,\nVery friendly staff and they remember the names of regular customers. And fantastic massage!\n\n",
        "Ray Paleg\nLocal Guide·23 reviews·14 photos\nRated 5.0 out of 5,\nAwesome massage for great prices! They do a great job and great service\n\n",
        "L Forest\n4 reviews\nRated 5.0 out of 5,\nVery comfortable full body massage, highly recommended, will go again :D\n\n",
        "Yabing Liu\nLocal Guide·141 reviews·252 photos\nRated 5.0 out of 5,\nThe place is clean and the staff are professional. The masseuse got all the right spots. Highly recommended!\n\n",
        "Vik Su\nLocal Guide·26 reviews·38 photos\nRated 5.0 out of 5,\nGreat place, good pricing, good social giving back for the disadvantaged proving they might be better masseurs than some around the area\n\n",
        "Aylwyn Gan\nLocal Guide·123 reviews·265 photos\nRated 5.0 out of 5,\nVery good and reasonable foot massage located in a quiet corner. Call first to reserve before going down on weekends. Can get crowded.\n\n",
        "Winse Tan\nLocal Guide·80 reviews·46 photos\nRated 5.0 out of 5,\nLove the massage service here!!! Awesome please go do support\n\n",
        "Melaka Atalugamage\nLocal Guide·28 reviews·5 photos\nRated 5.0 out of 5,\nAwesome service. The masseurs are very professional. We had a great time. Highly recommended\n\n",
        "Amanda Zhou\nLocal Guide·66 reviews·42 photos\nRated 5.0 out of 5,\nFantastic massage at affordable rates. Give it a try if you’re around the area :)\n\n",
        "Shankari J\n1 review\nRated 1.0 out of 5,\nI bought a head, shoulder and neck massage package but all the three points were not even massaged and only the back was massaged for a good 50 minutes and it was a painful experience.\n\n",
        "L ZF\nLocal Guide·224 reviews·173 photos\nRated 5.0 out of 5,\nGood service. Try to book at least 1 day in advance.\n\n",
        "Shannon Rachel Lee Chaluangco\n19 reviews·3 photos\nRated 2.0 out of 5,\nWalked all the way there during lunch and it was not open. No hours are stated anywhere, not even on the door. Hours would be useful. It can't possibly be open at random times at whim if it's trying to be a serious business?\n\n",
        "Joshua Lek\n5 reviews\nRated 5.0 out of 5,\nGreat service, great price. The people are really nice. Be sure to make an appointment, as they have limited staff.\n\n",
        "Zyrus Ryo Wei Kang\nLocal Guide·15 reviews·17 photos\nRated 5.0 out of 5,\nAddicted to the massage here just after my first session! Very professional.\n\n",
        "kübra akçay\n10 reviews·3 photos\nRated 5.0 out of 5,\nI had a very positive experience. These people know where and how to touch on your body. Must try.\n\n",
        "Alexander Freickmann\n91 reviews\nRated 5.0 out of 5,\nReally enjoyed their service, felt super relaxed afterwards. Prices are also very good for what you get.\n\n",
        "Lucy\n51 reviews·25 photos\nRated 5.0 out of 5,\nAbsolutely incredible massage .....lovely practitioners, can’t wait to go back!\n\n",
        "chiming wong\nLocal Guide·17 reviews·63 photos\nRated 5.0 out of 5,\nGreat service. Gentle and on point massage.\n\n",
        "Terrence Mah\nLocal Guide·30 reviews·21 photos\nRated 5.0 out of 5,\nProfessionals. No hard sell. Very clean.\n\n",
        "Mariko\nLocal Guide·82 reviews·35 photos\nRated 5.0 out of 5,\nRecommend to call to make an appointment.Body massage is great, and powerful\n\n",
        "Angeline Wong\nLocal Guide·83 reviews·84 photos\nRated 5.0 out of 5,\nProvide good quality oil free massage. Reliefs muscular aches.\n\n",
        "Lin Xin\nLocal Guide·68 reviews·87 photos\nRated 5.0 out of 5,\nBeautiful people who are full of zest of life and are always ready to give me a glimpse me a glimpse of how the visually impaired in singapore get about daily lives!\n\n",
        "Hervé Caux\nLocal Guide·85 reviews·112 photos\nRated 4.0 out of 5,\nVery good massage, nice people in there.\n\n",
        "Harry\nLocal Guide·176 reviews·79 photos\nRated 5.0 out of 5,\nExcellent massage, cheerful practioners and superb value. Will return!\n\n",
        "Tan Qiuhua\nLocal Guide·36 reviews\nRated 5.0 out of 5,\nVery genuine service and they have good skills at affordable prices. At the same time also helping them.\n\n",
        "Jay Wai\n14 reviews·3 photos\nRated 5.0 out of 5,\nReasonable fee + good service\n\n",
        "Pauline Han\n2 reviews\nRated 5.0 out of 5,\nLike the strength & accuracy, better than normal people do. Highly recommended & definitely will come back 😀\n\n",
        "Joice Tjen\nLocal Guide·104 reviews·671 photos\nRated 5.0 out of 5,\nCall first to reserve :)\n\n",
        "Fadzullah Hassan\nLocal Guide·13 reviews·6 photos\nRated 5.0 out of 5,\nGood place to get those knots eased. The blind massuese are skillful and very polite.\n\n",
        "Darren Lau\nLocal Guide·28 reviews·18 photos\nRated 5.0 out of 5,\nCheap n friendly people😇\n\n",
        "Donny Koh\nLocal Guide·44 reviews·20 photos\nRated 5.0 out of 5,\nExtreme good massage at a very reasonable price\n\n",
        "Bindi Makhbal\n9 reviews·1 photo\nRated 5.0 out of 5,\nWould definitely go back again. Days of ache has been resolved.\n\n",
        "Nagu Koppula\nLocal Guide·55 reviews\nRated 5.0 out of 5,\nVery good and worth the dollar\n\n",
        "Crston Tan\nLocal Guide·152 reviews·100 photos\nRated 3.0 out of 5,\nBetter than some normal massue\n\n",
        "engineer cute\nLocal Guide·16 reviews·12 photos\nRated 5.0 out of 5,\nmy back feel better thanks 👏👌\n\n",
        "Linda I.\n13 reviews·1 photo\nRated 5.0 out of 5,\nThank you... Your hands healed my backpain!\n\n",
        "Yeoss\n12 reviews\nRated 5.0 out of 5,\nThey might be blind and equality is important.\n\n",
        "Aravindaran Kanakaratnam\n12 reviews·5 photos\nRated 5.0 out of 5,\nVery\ngood\n\n",
        "k t\nLocal Guide·27 reviews·6 photos\nRated 5.0 out of 5,\nGreat massage!\n\n",
        "Hamza Gharfane\nLocal Guide·19 reviews·19 photos\nRated 5.0 out of 5,\nVery good service\n\n",
        "A Nag\n7 reviews·1 photo\nRated 5.0 out of 5,\nGreat experience!\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 9793 0255\">9793 0255</span>",
    "Website": "https://www.facebook.com/BlindMassageService/"
}