{
    "Name": "Chakra Tantra Massage Singapore - Outcall Massage",
    "Products": null,
    "Address": "111 North Bridge Rd, Singapore 179098",
    "Opening Hours": "Saturday Open 24 hours\nSunday Open 24 hours\nMonday Open 24 hours\nTuesday Open 24 hours\nWednesday Open 24 hours\nThursday Open 24 hours\nFriday Open 24 hours\nSuggest new hours",
    "Rating": "4.3\n30 reviews",
    "Reviews": [
        "Theresa Tam\n25 reviews\nRated 5.0 out of 5,\nI love this massage center and I always went here whenever I feel dizzy and tired. I love the facilitation and how professional they are on their work. The reception is impressive and responds very fast. I recommend this massage center because they are very accommodating and loving the area because it is organized. They deserve a five-star rating.\n\n",
        "Dre To\n36 reviews\nRated 5.0 out of 5,\nI love this place and I always went here whenever I feel stress at work. I think the staff of this massage parlor already knows me since I visit this place two or three times every month. The staff who massage me frequently is professional and really knows which spot at my back feels great tension. They deserve a five-star rating.\n\n",
        "Frederic\n1 review\nRated 5.0 out of 5,\nimpressive experience !  The reception respond quickly, and the therapist came in short time. Tina is an excellent therapist with her amazing hands.  It was the most comfortable service I have ever had. Bravo!!  Anybody who is interested in tantric massage should order her service.\n\n",
        "Theresa Tam\n25 reviews\nRated 5.0 out of 5,\nI love this massage center and I always went here whenever I feel dizzy and tired. I love the facilitation and how professional they are on their work. The reception is impressive and responds very fast. I recommend this massage center because they are very accommodating and loving the area because it is organized. They deserve a five-star rating.\n\n",
        "Dre To\n36 reviews\nRated 5.0 out of 5,\nI love this place and I always went here whenever I feel stress at work. I think the staff of this massage parlor already knows me since I visit this place two or three times every month. The staff who massage me frequently is professional and really knows which spot at my back feels great tension. They deserve a five-star rating.\n\n",
        "Frederic\n1 review\nRated 5.0 out of 5,\nimpressive experience !  The reception respond quickly, and the therapist came in short time. Tina is an excellent therapist with her amazing hands.  It was the most comfortable service I have ever had. Bravo!!  Anybody who is interested in tantric massage should order her service.\n\n",
        "Tim J. Travis\n2 reviews\nRated 4.0 out of 5,\nSingapore being the Asia regional hub, I've heard of highly skilled massage service here. Having said that, I was not disappointed with Chakra tantra massage, the lady is experienced. The only complain I have is she's late for 35 minutes, which is a long wait for me, but acceptable due to the heavy traffic at 6pm.\n\n",
        "Ron Tan\n4 reviews\nRated 5.0 out of 5,\nIt was awesome experience with Chakra Tantra Massage Singapore. Chakra Tantra Massage is a true outcall knead in Singapore. When I were in Singapore I utilized their administration. I got more than I anticipated. Worth each penny and doubtlessly I will return once more!!\n\n",
        "Billy Carranza\n5 reviews\nRated 5.0 out of 5,\nChakra Tantra Massage is an authentic outcall massage in Singapore. When I were in Singapore I used their service. I got more than I expected. Worth every penny and definitely I will come back again!!\n\n",
        "Jay Kovak\nLocal Guide·50 reviews\nRated 4.0 out of 5,\nTantric sensual massage, when it is done well, it is one of the real happy things in life. There are many versions of tantric massage depending from the country and also the company. I had a happy time with the girl from Chakra Tantra massage.\n\n",
        "Regin Clark\n6 reviews\nRated 5.0 out of 5,\nI had a wonderful experience, Chakra tantra massage singapore send an experience massage therapist and I feel refreshed from head to toe after my session. Thumbs up.\n\n",
        "Louise T. Miranda\n6 reviews\nRated 5.0 out of 5,\nChakra Tantra Massage is an authentic outcall massage in singapore. This is one of the best massage parlours in Signapore! If i ever visit Singapore again i will call them..\n\n",
        "Ayesha Bareen\n9 reviews\nRated 5.0 out of 5,\nExcellent! Great massage from professional and experienced masseuse who knew how to target right spots.\n\n",
        "Denson Liu\n2 reviews\nRated 5.0 out of 5,\nGood service, i book the massage a day in advance and they're able to send a experienced masseuse on time. What a pleasant experience.\n\n",
        "haugeb koo\n3 reviews\nRated 1.0 out of 5,\nMy Bad experiencing trying this chakra company for suck massage not worth of it .The therapist came into my hotel just give a fast blow and just rub me without  any massage knowledge .Never Never pay such a amount for such a suck  massage.\n\n",
        "E S\nLocal Guide·15 reviews\nRated 1.0 out of 5,\nFake girl sent with zero experience in massage and did not worth 200 was charged really disappointed becarefull it's a total rip off this place.\n\n",
        "Syd Parham\nLocal Guide·19 reviews\nRated 5.0 out of 5,\nHad a great tantric massage thanks to my therapist, you are true professional.\n\n",
        "Donna Reilly\n1 review\nRated 5.0 out of 5,\nI recently visited Singapore and I would like to say a big thаnk уоu fоr my аmаzing tаntrа mаѕѕаgе lаѕt week. Everything was реrfесt. I lоvе уоur masseuses who аrе vеrу nice a proffesional. I аlѕо appreciate the luxurу ѕtуlе оf уоur Cеntеr thаt tооk mе frоm buѕу days to оаѕiѕ оf tаntrа. Mу masseuse rеlеаѕеd аll ѕtrеѕѕ I hаd had аnd gave mе energy for the next 2 wееkѕ! I have been in mаnу tаntrа сеntеrѕ before but only with уоu I fеlt tоtаllу satisfied аnd I wоuld likе tо rесоmmеnd уоu tо еvеrуоnе whо wоuld likе to cross usual wауѕ оf thinking аnd experience thе rеаl meaning оf the wоrdѕ \"rеlаx your bоdу аnd mind\".\n\n",
        "Li Qiang\n2 reviews\nRated 5.0 out of 5,\nFirst time trying this massage, interesting and good. Experienced therapist.\n\n",
        "Richard Lindinger\n1 review\nRated 4.0 out of 5,\nI booked a couple massage with chakra and it was a wonderful experience.\n\n",
        "Brook Lowry\n84 reviews\nRated 5.0 out of 5,\nExcellent customer service! I highly recommend them! It was pleasure to be here! 10+\n\n",
        "leow yew seng\n15 reviews\nRated 1.0 out of 5,\ninexperienced therpist plus they charge ridiculous price. Very disappointed session.\n\n",
        "Jacob Vu\nLocal Guide·20 reviews\nRated 5.0 out of 5,\nThank you for the relaxing and authentic massage.\n\n",
        "Zhang Yong\n3 reviews\nRated 5.0 out of 5,\nThank you for the massage, will be back again.\n\n",
        "Dominik\nLocal Guide·132 reviews·5 photos\nRated 5.0 out of 5,\nVery nice and professional.\n\n",
        "Petra Ong\nLocal Guide·14 reviews\nRated 5.0 out of 5,\nThank you for the massage session.\n\n",
        "Lela Ang\n2 reviews\nRated 5.0 out of 5,\ngoood\n\n",
        "Andy Tan\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "Dong Su Lee\nNo Past Reviews\nRated 3.0 out of 5,\n\n\n",
        "Kaymun Amin\n5 reviews·4 photos\nRated 5.0 out of 5,\n\n\n",
        "Sri Astuty\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "めーめーさん\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Yuvaraj Poola\n1 review\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 9059 9987\">9059 9987</span>",
    "Website": "http://www.chakratantramassage.com/"
}