{
    "Name": "Core Concepts Physiotherapy Novena Square",
    "Products": null,
    "Address": "238 Thomson Road, #03-32 Velocity, Novena Square, 307683",
    "Opening Hours": "Saturday 9am–6pm\nSunday Closed\nMonday 9am–6pm\nTuesday 9am–6pm\nWednesday 9am–6pm\nThursday 9am–6pm\nFriday 9am–6pm\nSuggest new hours",
    "Rating": "4.9\n101 reviews",
    "Reviews": [
        "Shaun Quek\nLocal Guide·28 reviews·32 photos\nRated 5.0 out of 5,\nWent to have a sports massage for my lower back issue. Therapist Johanna did an amazing job! She not only attacked the main problem but the peripherals too. On top of that, she held conversations well, and constantly check up on how I was doing. The room wasn't silent and awkward. After the session, my back muscle pain was thoroughly relieved. So good. Will go again!\n\n",
        "KH Tay\n2 reviews\nRated 5.0 out of 5,\nGreat experience with Isaac of Core Concepts Novena. Front desk staff also very helpful. Had bad back sprain and Isaac helped me thoroughly with his very professional ministrations and advice. Wouldn't hesitate to recommend to anyone needing physio.\n\n",
        "P Liew\n5 reviews·3 photos\nRated 5.0 out of 5,\nKnowledgeable and Professional Physiotherapists at  Core Concepts guided me in my shoulder post-ops recovery.\n\nTheir clinics are well equipped &  the expert Physiotherapists work as a team to seamlessly manage my recovery program.\n\nGreat customer service in scheduling and reminding me about my appts, with multiple location easily accessible by Public Transport is a big plus.\n\nThank you Core Concepts for taking great care of your clients.\n\n",
        "Shaun Quek\nLocal Guide·28 reviews·32 photos\nRated 5.0 out of 5,\nWent to have a sports massage for my lower back issue. Therapist Johanna did an amazing job! She not only attacked the main problem but the peripherals too. On top of that, she held conversations well, and constantly check up on how I was doing. The room wasn't silent and awkward. After the session, my back muscle pain was thoroughly relieved. So good. Will go again!\n\n",
        "KH Tay\n2 reviews\nRated 5.0 out of 5,\nGreat experience with Isaac of Core Concepts Novena. Front desk staff also very helpful. Had bad back sprain and Isaac helped me thoroughly with his very professional ministrations and advice. Wouldn't hesitate to recommend to anyone needing physio.\n\n",
        "P Liew\n5 reviews·3 photos\nRated 5.0 out of 5,\nKnowledgeable and Professional Physiotherapists at  Core Concepts guided me in my shoulder post-ops recovery.\n\nTheir clinics are well equipped &  the expert Physiotherapists work as a team to seamlessly manage my recovery program.\n\nGreat customer service in scheduling and reminding me about my appts, with multiple location easily accessible by Public Transport is a big plus.\n\nThank you Core Concepts for taking great care of your clients.\n\n",
        "Dinesh Silva\n1 review\nRated 5.0 out of 5,\nWent to visit Core Concepts because  I was suffering from a stiff shoulder and muscle pain. Johanna the one who attended to me, was very patient and meticulous with my shoulder issue.\n\nShe provided explanation and ensured that I was comfortable throughout my session as my shoulder area was very painful. A the end of my session my shoulder and neck area was feeling better.\n\nHighly recommend to visit her for a strong massage session at the Novena Outlet.\n\n",
        "Si Hui Lee\n2 reviews\nRated 5.0 out of 5,\nFollowing recommendations from family members, I visited Core Concepts to treat my back pain as I didn't want to rely on pain medications and injections. With the care from Yi Ren, Sara and Cheryl, my back issue has now been resolved and they have patiently introduced exercises to correct my poor posture as well. I'm glad that my standard of living has improved greatly without the need for medication and will highly recommend their service for anyone facing similar issues as well!\n\n",
        "Shen K\n12 reviews\nRated 1.0 out of 5,\nExcellent and prompt customer service. Unfortunately, my pain issues were not addressed after attending 4 sessions.\n\nI do like the idea of having a team to look into your case, but that also means you have to repeat yourself several times. In my case, I was attended by 3 different therapists. The 2 therapists (who were not involved in my initial diagnosis) needed clarification/confirmation before starting the treatment as they were looking into my case based on the data displayed on their system. I could feel that there's an obvious communication gap between the therapists - they didn't seem to have had discussed my case internally for further diagnosis and progression check as they were relying very much on the system (which provided limited information). They are probably so used to doing it that they have subconsciously lost the personal touch with the patient. Due to the communication gap, my condition was not further scoped/diagnosed/fine-tuned, despite I had clearly mentioned that there was no sign of improvements after the treatments.\n\nBesides, they focused very much on manual therapy and exercises - they did not suggest any alternative treatment (e.g. shockwave therapy, dry needling etc.) in an attempt to combine various approaches in tackling my pain issues from different angles. I can't be sure if this is due to the lack of communication among the therapists as I mentioned above, or they were trying to make me attend more sessions.\n\nIf you are looking for a well-rounded service with a personal touch and prompt corrective actions, I don't think this is the right place. I sought treatment from another provider and I was treated by a therapist (as opposed to a team of therapists) who knows my case very well and therefore able to continuously diagnose my case and provide adjustments/alternative treatments based on my progression. My pain level has subsided about 50% after the first treatment, and my condition has vastly improved on the next day!\n\nI hope this review gives you a fair perspective so you could make the right decisions.\n\n",
        "Wanyi Lee\nLocal Guide·34 reviews·27 photos\nRated 5.0 out of 5,\nCore concepts has really professional physiotherapists and massage therapists! They always solve my issues whenever I have injuries or experience pain on the wrist, back, shoulder, and legs. Shane, Felicia, Weijuan are very professional and helpful, and they also share good methods for me to maintain my regime so that I don’t have to come back once my treatments are done. They’re also really friendly and personable! Their receptionists are also very friendly, helpful, and always help in my queries. Thanks everyone!\n\n",
        "M. Loh\n1 review\nRated 5.0 out of 5,\nI had sprained my left ankle about 3 weeks prior to my first consultation for my ankle. I had been informed by a GP that my sprain that it would take 3 to 4 weeks to heal. But after 3 weeks, I still couldn't even walk for 5 minutes without a walking aid.\n\nUpon walking into Core Concepts, Addy, one of the counter staff, noticed that I couldn't walk and immediately offered to help me get drinks and snacks. Louis, the other counter staff, repeated his offer in earnest. I was surprised that they noticed my situation and their kindness warmed my heart. Though I didn't need anything, it left a deep impression on me as I've never known any establishment to go out of their way to make a customer feel comfortable.\n\nThe first therapist to be assigned to me upon my arrival was Chye Tuan. I was greatly impressed by how quickly and definitively he assessed my ankle. He had assessed my injury far better than a GP! He told me that it was actually still sprained and it was an eversion sprain that would need 6 to 8 weeks to heal instead. He propped my left leg up and massaged it to get the fluids around my swollen ankle to drain away, and when he was done, I could walk again without aid! It felt like a miracle just happened to me. Though my ankle was still sprained and the pain returned sometime later, it was an incredible relief to walk without a walking aid.\n\nAnother counter staff, Joanna's bright and cheerful personality and helpful nature was always a warm welcome whenever I step into the reception. Her friendliness made the waiting time go by quickly. She was also helpful in telling me that if I ever needed advice in between sessions, I merely needed to drop a line to the Core Concepts number. It shows the company cares a good deal about their patients.\n\nMy subsequent physiotherapy sessions were covered by Isaac Tai, with Chye Tuan reviewing my progress every couple of weeks in separate sessions. From the very first session I had with Isaac, he had been friendly, gentle, enthusiastic, patient and very kind to me. He never failed to go the extra mile, like showing me pictures of foot anatomy because he realised that I was a visual person and learned by seeing, he even taught me a new exercise on how to improve my flat feet which I did find interesting as he said I would. I still remember them and practise them whenever I can, and I pay attention to how my feet land on the ground because of his explanations and instructions. Isaac is an amazingly intelligent and analytical therapist as he would constantly observe and assess my condition and what I needed, and he would address every single one of my concerns and questions patiently. I was very impressed by his maturity, self-control and professionalism at handling trying moments, especially moments where I had unwittingly tested his patience a few times. He always made the effort to explain many things to me just so I could understand. Isaac's intention to help me recover and keep me safe was so steadfast that I came to trust him explicitly.\n\nIsaac was particularly good with teaching me the exercises I had to do. He started off demonstrating what I needed to do, then got me to try them and gradually corrected me. Without his specific instructions, observation, guidance and patience, I would not have been able to do them well. Because of his efforts, I came to appreciate them and I could feel myself gaining strength as time passed.\n\nIsaac made the sessions fun and enjoyable too. He cared and treated me as a real person with a life outside and, not some patient and merely did his job which would've been acceptable and pragmatic too. As a result, I felt at home, safe, heard and understood.\n\nI highly recommend Core Concepts and give their staff my highest commendation for their amazing attitude, impressive work ethics and outstanding work as it was due to their efforts that I recovered well and had a pleasant experience through the process.\n\n",
        "Su lala\n1 review\nRated 5.0 out of 5,\nVery good experience with this place. Professional physiotherapist Shane, massage therapist Felicia and functional trainer Li Hoon has helped me with my recovery for shoulder dislocation and calves pain. Felicia really have goods hands and I always enjoyed every sports massage session.\n\n",
        "Pang Meng Chye Anthony\n1 review\nRated 5.0 out of 5,\nKnowledgeble physiotherapist who was able to resolve the pain from the muscle spasm in my lower back. Front-desk staff was friendly and welcoming regardless whether you are new or returning patient. Highly recommended.\n\n",
        "Wanyi Lee\nLocal Guide·34 reviews·27 photos\nRated 5.0 out of 5,\nCore concepts has really professional physiotherapists and massage therapists! They always solve my issues whenever I have injuries or experience pain on the wrist, back, shoulder, and legs. Shane, Felicia, Weijuan are very professional and helpful, and they also share good methods for me to maintain my regime so that I don’t have to come back once my treatments are done. They’re also really friendly and personable! Their receptionists are also very friendly, helpful, and always help in my queries. Thanks everyone!\n\n",
        "M. Loh\n1 review\nRated 5.0 out of 5,\nI had sprained my left ankle about 3 weeks prior to my first consultation for my ankle. I had been informed by a GP that my sprain that it would take 3 to 4 weeks to heal. But after 3 weeks, I still couldn't even walk for 5 minutes without a walking aid.\n\nUpon walking into Core Concepts, Addy, one of the counter staff, noticed that I couldn't walk and immediately offered to help me get drinks and snacks. Louis, the other counter staff, repeated his offer in earnest. I was surprised that they noticed my situation and their kindness warmed my heart. Though I didn't need anything, it left a deep impression on me as I've never known any establishment to go out of their way to make a customer feel comfortable.\n\nThe first therapist to be assigned to me upon my arrival was Chye Tuan. I was greatly impressed by how quickly and definitively he assessed my ankle. He had assessed my injury far better than a GP! He told me that it was actually still sprained and it was an eversion sprain that would need 6 to 8 weeks to heal instead. He propped my left leg up and massaged it to get the fluids around my swollen ankle to drain away, and when he was done, I could walk again without aid! It felt like a miracle just happened to me. Though my ankle was still sprained and the pain returned sometime later, it was an incredible relief to walk without a walking aid.\n\nAnother counter staff, Joanna's bright and cheerful personality and helpful nature was always a warm welcome whenever I step into the reception. Her friendliness made the waiting time go by quickly. She was also helpful in telling me that if I ever needed advice in between sessions, I merely needed to drop a line to the Core Concepts number. It shows the company cares a good deal about their patients.\n\nMy subsequent physiotherapy sessions were covered by Isaac Tai, with Chye Tuan reviewing my progress every couple of weeks in separate sessions. From the very first session I had with Isaac, he had been friendly, gentle, enthusiastic, patient and very kind to me. He never failed to go the extra mile, like showing me pictures of foot anatomy because he realised that I was a visual person and learned by seeing, he even taught me a new exercise on how to improve my flat feet which I did find interesting as he said I would. I still remember them and practise them whenever I can, and I pay attention to how my feet land on the ground because of his explanations and instructions. Isaac is an amazingly intelligent and analytical therapist as he would constantly observe and assess my condition and what I needed, and he would address every single one of my concerns and questions patiently. I was very impressed by his maturity, self-control and professionalism at handling trying moments, especially moments where I had unwittingly tested his patience a few times. He always made the effort to explain many things to me just so I could understand. Isaac's intention to help me recover and keep me safe was so steadfast that I came to trust him explicitly.\n\nIsaac was particularly good with teaching me the exercises I had to do. He started off demonstrating what I needed to do, then got me to try them and gradually corrected me. Without his specific instructions, observation, guidance and patience, I would not have been able to do them well. Because of his efforts, I came to appreciate them and I could feel myself gaining strength as time passed.\n\nIsaac made the sessions fun and enjoyable too. He cared and treated me as a real person with a life outside and, not some patient and merely did his job which would've been acceptable and pragmatic too. As a result, I felt at home, safe, heard and understood.\n\nI highly recommend Core Concepts and give their staff my highest commendation for their amazing attitude, impressive work ethics and outstanding work as it was due to their efforts that I recovered well and had a pleasant experience through the process.\n\n",
        "Su lala\n1 review\nRated 5.0 out of 5,\nVery good experience with this place. Professional physiotherapist Shane, massage therapist Felicia and functional trainer Li Hoon has helped me with my recovery for shoulder dislocation and calves pain. Felicia really have goods hands and I always enjoyed every sports massage session.\n\n",
        "Elbert Bailey\n1 review\nRated 5.0 out of 5,\nMy third time here with sports injuries, and fantastic outcomes every time - thank you, Shane, and Core Concepts Team!\n\n",
        "Ai Shan Cai\n3 reviews\nRated 5.0 out of 5,\nGreat services provided by core concept at novena. Staff are all so friendly and helpful. They are very patient in accessing my injury and condition during every session. Felt such great relieve that I recovered from months of intensive pain at the neck and shoulder . Will surely recommend friends if they need physiotherapy\n\n",
        "Cheryl Goh\n2 reviews\nRated 5.0 out of 5,\nCore concepts has been a critical enabler to my rehabilitation and recovery from a major foot fusion surgery (long recovery process from being on crutches/ no weight bearing to gradual weight bearing and finally being able to wear my own shoes!). The physiotherapists and the team of massage therapists has been providing professional advice / gradual strengthening program and also providing encouragement throughout my recovery process. Big Thanks Especially to Chye Tuan/ Novena clinic and Daisy / Harbourfront clinic for their care and attention!\n\n",
        "Jonathan Quek\n5 reviews·3 photos\nRated 5.0 out of 5,\nAfter a few months of working from home I started developing a neck ache and tight shoulders. Thankfully I found out about core concepts and their sports massage service which really helped to ease the tightness and pain and can also be quite therapeutic. I even started to sleep better after the sessions so definitely give this a go if you’re suffering from pain.\n\n",
        "Rachel Ai Phang Foo\n2 reviews\nRated 5.0 out of 5,\nExcellent! Very happy with the professional and very personable team at Core Concepts in particular Shane Siow (Physiotherapist), Felicia Ng (Sports Therapist) and Li Hoong (functional trainer). I like how they worked so closely together in providing me with the best treatment plans. I appreciate their on-going motivation, tips, and expertise as I journey through the pain process to recovery! Thanks so much for your professional dedication!  Much appreciated!\n\n",
        "U-Li Ong\n4 reviews\nRated 5.0 out of 5,\nChye Tuan and Sara have exceeded my expectations when I had given up hope in addressing my sciatica caused by spinal stenosis of L4/L5.  Sara's deep tissue physio massages are the best, painful but absolutely delightful. She's able to pinpoint tired and stiff muscles I never knew existed.  Awesome hands and technique!!\n\nChye Tuan's methodical approach to my issue and reassuring confidence has given me hope I can be somewhat cured. I'll be happy if the pain is less than 50%.  This tag team together with James Lee of RetroFit is the dream team to help put my broken back together again.\n\nI love how professional Core Concepts has been from Louis at the front desk to the professional therapists.\n\nThank you, Team Core Concepts!\n\n",
        "Harry Tanujaya\n21 reviews\nRated 5.0 out of 5,\nBrought my dad to a doctor as he was experiencing an acute pain on his left knee due to a fall, however, the doctor couldn't ascertain what kind of injury he had after an X-ray and proposed my dad for an MRI scan instead. Displeased, we rejected further doctor consultation and went to Coreconcepts to visit a physiotherapist. At Coreconcepts, my dad was aided by physiotherapist, Yiren, who assessed my dad's issues. Immediately, he concluded that my dad had meniscus injury and carried out the specific therapy for him. Within 2 weeks, my dad had a significant physical improvement and he was able to walk conformably without any pain. By the 4th week, my dad was almost fully recovered and Yiren also subscribed some exercises for my dad to strengthen his legs. We were very gratified by the exemplary service and effort that Yiren had put in to help my dad recover from his injury. This place is highly recommended! Do look for Yiren if you have any doubts!\n\n",
        "Jayme Chan\n9 reviews·5 photos\nRated 5.0 out of 5,\nI've been to a few Core Concepts outlets and am pleased with my experiences so far! I went there thinking that I have a normal neck ache but they were quick to point out that it's due to my scoliosis. Each session usually leaves me feeling a lot relieved from the pain and I really appreciate the exercises which the team has taught me to strengthen the weaker back muscles. Thank you so much team!\n\n",
        "M K\n1 review\nRated 5.0 out of 5,\nThe staff at Core Concepts are very dedicated and professional. I’ve been coming to Core Concepts to fix my injuries and I’ve gotten better each time. The physiotherapists and physios are very knowledgeable and always go to the Core of the injury and are often right with the cause of the injuries I have/had! Thank you Core Concepts!\n\nHighly recommended.\n\n",
        "Tag Yuxiang\n1 review\nRated 5.0 out of 5,\nI’ve been going to Core concepts for years but this time was to fix a rotator cuff injury.  I was very fortunate to have Wei Juan as my physio, as she’s professional, knowledgeable and has a lot of positive energy which is very encouraging when you’re in pain.  She recommended me a combination of sports massages with Monica and functional training With Li Hoong which worked out very well.  Within two months, there was a marked improvement in my condition which I’ve been struggling for many months.  Wei Juan, Monica and Li Hoong are all super dedicated and passionate about their work and genuinely care for their patients.  I cannot be more pleased with their level of service and I would highly recommend Core concepts to everyone.\n\n",
        "Yulia Fernández Marcos\n5 reviews\nRated 5.0 out of 5,\nBefore I came here, I was told that I need a knee surgery, but the doctor Samuel gave me a lot of hope to avoid  that and working with Heng Li; I have made A LOT OF PROGRESS strengthening my knee, legs and upper body and it looks like I’ll be soon back to my working out routine at the gym!!!\n\nThey both are very professional and they have been taking amazing care of me!!\n\nI highly recommend them and I also want to mention that the two ladies at the reception are really kind and helpful with every appointment and insurance matters!\n\nIf you want to improve with a quality team, you should definitely come here to Core Concepts!\n\n",
        "Natalie Tarnopolsky\n11 reviews\nRated 5.0 out of 5,\nWe have just completed about a 9-month physio treatment with Chye Tuan and Li Hoong. My athlete (mainly basketball and waterpolo) son was pretty severely injured at nearly every major joint (knees, shoulders, hips, wrists, elbows, etc.) - the type of injury you read about in the paper where the kid pushes himself too hard and then ends up getting injured and not being able to play sports ever again. We went to orthopaedic surgeons, rheumatologists, multiple physical therapists, got MRIs, etc. - and it turned out to be really severe overuse - something that would not go away with a quick fix, surgery, medicine or month off. He kept getting re-injured, and meanwhile his entire body was in so much pain that he had to be pushed up the stairs or out of the car. He stooped over in pain. We decided that my son's health was too important to try to cut corners and went with Core Concepts because our rheumatologist said that they were a substantial cut above everyone else, very experienced and if we were serious about trying to salvage my son's athletic future, she would only recommend them. So we just finished a 9 month treatment with Core Concepts.\n\nI started out skeptical. However, immediately, during my first visit, I was impressed by how much Chye Tuan seemed to understand the nuances of being an athlete, the parts of the body used for different sports, how different movements translate into different types of health issues, etc. I appreciated that he really tried to understand my son's entire history and all of his issues - so what we did was completely customised to help him get better. It was not cookie cutter at all.\n\nBoth Chye and Li Hoong \"got\" my son's competitive personality and his conflict and frustration with being injured repeatedly, wanting to play, and also wanting to heal for the long term. Both he and Li Hoong worked hard to re-build my son's strength and confidence in himself so that when he goes back into sports full time, he will know how to excel without re-injuring himself. Both Chye and Li Hoong build confidence and are personable as well. Obviously, a recuperation health effort such as this requires a lot of patience and an investment of time and money. In our case, we decided that this was the top priority for my son's physical and mental health - and we needed to get the best help we could.\n\n",
        "Nicola Harford\nLocal Guide·24 reviews·49 photos\nRated 5.0 out of 5,\nGreat physio, with a wide and holistic range of treatment options. Have been coming here for a while for a few issues, and have had a great mix of treatment, from initial physio, rehab with a  functional trainer and remedial massage. The team are well educated and communicates well, I feel very looked after here. The receptionists are friendly and professional. With thanks for helping me get back on my feet!\n\n",
        "Zhen Tang Peh\n1 review\nRated 5.0 out of 5,\nAs an active individual, I've been troubled with aches and injuries associated with my lifestyle and glad to be referred to Core Concepts by the company's GP. The specialists (i.e. Chye Tuan, Monica, Debbie and Sufyan) at Core Concepts focus on a 360 recovery and rehabilitation package which includes sports massage, functional training and coaching, that have benefitted me greatly. I would recommend other sports athletes to pay them a visit.\n\n",
        "Wilfred Yeo\n1 review\nRated 5.0 out of 5,\nDid not expect myself to make such a speedy recovery in just 3 months and it's all thanks to the amazing physiotherapists and trainers. They have put in their time and effort into making sure that every patient receives ample training and treatment. I highly recommend Core Concepts to anyone suffering from muscle related injuries.\n\n",
        "Diah Nugraheni\n1 review\nRated 5.0 out of 5,\nThe therapists were quite thorough and able to solve my problem. Provided good explanation on possible cause and how to maintain.\n\n",
        "Theressa Lim\n1 review\nRated 5.0 out of 5,\nVery professional and caring Therapists. My left foot has been hurting for months. After 3 sessions with the therapist, 80% of the pain was gone.  However, the remaining 20% still lingered on. They then had me do the functional training. After few sessions, I am left with only 2% of the pain and I am being discharged. The team is very professional and effective. Thanks everyone!\n\n",
        "Willy\n1 review\nRated 5.0 out of 5,\nCheryl is both skillful and caring.\nShe goes into the root causes of the patient's pain problem and  carefully works out a healing plan together with the patient .\nHer medical skills and knowledge coupled with her medical ethics are rather encouraging for me as a chronic neck pain sufferer who have received other forms of pain management treatments before.\n\nAfter a few sessions of treatment and doing the exercises she taught me, I am feeling better and I think I should be on the road to further recovery.\n\nThanks Cheryl and Core Concepts.\n\nPaul\n\n",
        "Valerie Lee\nLocal Guide·17 reviews·8 photos\nRated 5.0 out of 5,\nMy last visit to this place was in 2013!  I had a terrible pain near right collarbone area and I googled, worrying it might be a frozen shoulder or worst AC!  I wanted to see Pui Wan, unfortunately she was fully booked out.  They referred me to Wei Juan.  She’s amazing.   She assured me it’s just a whole bunched up muscle that’s causing the extreme pain.  She worked on it for almost 20 mins and followed by ultrasound heat treatment.  The next day, the pain had subsided and I could move my arm forward and overhead.\nI am so relieved.  I will be going back to her for another follow up.\nI must say that through this experience I fully with past reviews that Core Concepts have a very good team of professionals therapists who are very experienced and passionate about their work.\nThe only area they need to work on is their first line of contact service.  Regular clients will be forgiving of their lack in customer service as they know their therapist will do a splendid job!  Others may not like a bad start if front line fails them.   All the very best.\n\n",
        "Ethan Tan\n2 reviews\nRated 5.0 out of 5,\nI had back aches at a very young age due to sports activities. It was so painful till the point that i couldn’t sleep well. Physiotherapy at core concepts has helped alleviate pain as well as improved my back strength that would benefit me in my sport activities.\n\n",
        "hoy choy fong\n1 review\nRated 5.0 out of 5,\nI have slipped disc at my lumbar spine between L4 and L5 and experienced great pain from my lower back all the way down to my right foot. The Orthopedic Specialist advised me to go for surgery but I am skeptical as there were risks involved. So I seeked help from Core Concepts and thanks to Cindy who is not just professional as a physiotherapist, she is also very thoughtful in many ways when I received treatments from her. Cindy has selflessly taught me many types of exercises (some for home and some for office) to help me to strengthen my back muscles as well as to cope with the pain. Now my back pain has significantly reduced and really thanks to Cindy for her excellent service.\n\n",
        "Claire\n2 reviews\nRated 5.0 out of 5,\nVery professional and friendly staff! Lenia was really experienced and she detected the problem and managed to relieve my upper back pain by the second week. She also taught me exercises to be done at home which helped speed up the healing and recommended Ivy for deep tissue massage to alleviate my muscle tightness in my back. Despite my low threshold for pain, Ivy did a wonderful massage which enabled more back movements without any more pain just by one session. Great job Lenia and Ivy! Thanks for everything! I am on to Pilates at Core Concepts next! 😊\n\n",
        "Chen JingJing\n2 reviews\nRated 1.0 out of 5,\nThe physiotherapist is unprofessional and lack of knowledge. I have been treated there for two months. It not only wasting money but also suffering more pain.If you want to go there, you had better go to see doctor first.\n\n",
        "Rosa Chan\n1 review\nRated 5.0 out of 5,\nHad hip joint pains for a few months now, so I thought of coming to do physio to see if it helps. After 2 session the pain is much better. Staff and therapist are all very friendly\n\n",
        "Min X\n1 review\nRated 5.0 out of 5,\nBeen coming here for 4 years now. The therapists are great; I always feel better after a session with Monica. Receptionists (including Carol) are friendly and always willing to help.\n\n",
        "MY Kee\n1 review\nRated 5.0 out of 5,\nI had a knee pain due to excessive walking. Visited Core Concepts and they very quickly and correctly identified the issue, as IlIotibial band syndrome. Solutions, both short and long term are very effective and worked for me. Thank you!\n\n",
        "Samantha Tan\n2 reviews·1 photo\nRated 5.0 out of 5,\nNice, friendly staff. Helped me to diagnose my issue and more importantly, self manage it.\n\n",
        "Diqqin Sapari\n2 reviews·1 photo\nRated 5.0 out of 5,\nGreat place to help me recover, improve and boost my well being and moral too. The theraphist and staffs are super doped and friendly. Always looking forward for my next session with them. Truly a better way to recover!\n\n",
        "Charmaine Lara\n3 reviews\nRated 5.0 out of 5,\nPhysio sessions for my ACL have been great so far, every session has improved me. Friendly and nice staffs, recommended to visit!\n\n",
        "Sam\n1 review·4 photos\nRated 5.0 out of 5,\nVery friendly and professional physiotherapist as well as receptionists within the clinic. Dr. Issac Wong is easy to approach and came up with alternative ways for me to strengthen my weak thigh muscles and it really helped in reducing my knee pain! Thanks :)\n\n",
        "Ruth Wong\n2 reviews\nRated 5.0 out of 5,\nDid a session of the facilitated stretch therapy with Li Hoong earlier this month, and she managed to resolve an issue I had with my right hip. I can run pain-free again!\n\n",
        "Sandra Kurniawati Gani\n2 reviews\nRated 5.0 out of 5,\nIt’s v helpful. Cheryl knows the core problem of my neck stiff. One time I see her, straight away I feel much better.\n\n",
        "Marilyn Ho\nLocal Guide·29 reviews·22 photos\nRated 5.0 out of 5,\nVery nice staff and Samuel who was my physiotherapist was experienced, helpful and friendly!\n\n",
        "瑜夏\n1 review\nRated 5.0 out of 5,\nFriendly people and the therapists are very professional. Alleviates my issues most of the time.\n\n",
        "Hermine Chan\n5 reviews\nRated 5.0 out of 5,\nSamuel and Li Hoon has been taking care of me well.My knee is feeling much better now. Thank you:-)\n\n",
        "Chow Wei Li\n5 reviews\nRated 5.0 out of 5,\nGreat experience with shane and xue ting helping with my physio session for my injury sustained from a car accident. Thank you\n\n",
        "Grace Chew\n2 reviews\nRated 5.0 out of 5,\nShane is very experienced and every session I felt relieved at your shoulder\n\n",
        "Samta Menghrajani\n4 reviews\nRated 5.0 out of 5,\nGreat service, very accommodating with work and travel schedules and kind therapists.\n\n",
        "George W\n5 reviews\nRated 5.0 out of 5,\nGood experience with shayne. Friendly, helpful and knowledgeable Therapist.\n\n",
        "Jasper Sng\nLocal Guide·17 reviews·23 photos\nRated 5.0 out of 5,\nReally helpful and the physiotherapist are very kind and well knowledged in their fields of expertise\n\n",
        "Ronnie Hair\n4 reviews\nRated 5.0 out of 5,\nGreat place with friendly professional physio therapist helping in recovery treatment!\n\n",
        "Nicole Teo\n1 review\nRated 5.0 out of 5,\nVery good and effective treatment. Efficient bookings, prompt replies to my messages.\n\n",
        "Chenmunn Tham\n1 review\nRated 5.0 out of 5,\nYes I'm so relieved! Shiok! Thanks to Sam and Cindy for the care and therapy!\n\n",
        "Loic LIEVRE\n2 reviews·1 photo\nRated 5.0 out of 5,\nVery good sport massage, feel much relaxed\n\n",
        "DB DB\n2 reviews\nRated 5.0 out of 5,\nVery professional and effective therapists. Thank you\n\n",
        "Charlene Koh\n7 reviews·1 photo\nRated 5.0 out of 5,\nI love it here ! I’ve been coming here for a few months and it has helped me a lot !\n\n",
        "Xinman Yeo\n7 reviews\nRated 5.0 out of 5,\nThanks Samuel and Monica! Indeed ease my muscle ache!\n\n",
        "Jayce Lin\n4 reviews\nRated 5.0 out of 5,\nProfessional, knowledgeable personnel, in addition kind and helpful! What more can one ask for!\n\n",
        "Joe Foo\n2 reviews\nRated 5.0 out of 5,\nVery convenience, great ambient and therapists\n\n",
        "Luthfie Bagarib\nLocal Guide·12 reviews\nRated 5.0 out of 5,\nTreatment is structured and effective. Highly recommended.\n\n",
        "thomas naldi\n6 reviews·21 photos\nRated 5.0 out of 5,\nVery gentle yet super professional\n\n",
        "Daffodil Lee\n1 review\nRated 5.0 out of 5,\nLocation is excellent and the place is very clean.\n\n",
        "Tan Ke Jie\n1 review\nRated 5.0 out of 5,\nGreat therapist here.\n\n",
        "Kurt O'Brien\n9 reviews\nRated 5.0 out of 5,\nGood experience. Professional staff\n\n",
        "Jasmine Tan\n1 review\nRated 5.0 out of 5,\nVery good and skilful\n\n",
        "Corine Woon\n1 review\nRated 5.0 out of 5,\nCaroline is very friendly.\n\n",
        "Eugene Fang\nLocal Guide·26 reviews·7 photos\nRated 5.0 out of 5,\n\n\n",
        "Chris Chuan Huat Tiong\n2 reviews·54 photos\nRated 4.0 out of 5,\n\n\n",
        "Vaibhav Sharma\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Natanael david Gunawan\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Ruth Tan\n2 reviews\nRated 4.0 out of 5,\n\n\n",
        "Jaime Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ginno Yong\nLocal Guide·30 reviews·2 photos\nRated 5.0 out of 5,\n\n\n",
        "Lekhaa Nair\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "FLATT J\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Tee Tuan Foo\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Sapna sreevathsa\n1 review\nRated 5.0 out of 5,\n\n\n",
        "James Tang\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "LENA FOO\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Lillian Lim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Elaine WooSK\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "fang yuanlu\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Shiyun Cai\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Lynette Goh\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Kaylee Chong\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Snower Cheung\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Wy Chan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Angelyn Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Aileen Goh\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Lilik Saksono\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Kevin Seah\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "nisa umar\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Jia Li Leong\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Kristy Teo\n12 reviews\nRated 5.0 out of 5,\n\n\n",
        "Su Jen Khoo\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Huang me me\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "JC Bougle\n8 reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "6226 3632",
    "Website": "https://www.coreconcepts.com.sg/?utm_source=GMBlisting&utm_medium=Organic"
}