{
    "Name": "Golden Pail Spa",
    "Products": null,
    "Address": "304 Thomson Rd, Singapore 307654",
    "Opening Hours": "Saturday 10am–2am\nSunday 10am–2am\nMonday 10am–2am\nTuesday 10am–2am\nWednesday 10am–2am\nThursday 10am–2am\nFriday 10am–2am\nSuggest new hours",
    "Rating": "4.6\n49 reviews",
    "Reviews": [
        "Xavier Woon\n18 reviews·34 photos\nRated 5.0 out of 5,\nThe staff in Golden Pail are very professional and skilled, especially the Lady Boss. Would highly recommend a visit if your body is feeling sore!\n\n",
        "Dilip Jayakumar\nLocal Guide·45 reviews·120 photos\nRated 5.0 out of 5,\nMassage worth every penny. The 90 minutes massage has free ear candling or body scrub too. The masseuses can speak basic English, good enough for you to let them know what kind of massage you need. Recommended and will be visiting again.\n\n",
        "Scott Brooks\n8 reviews·1 photo\nRated 4.0 out of 5,\nCalled before going in to confirm availability.\nWent with a 60 minute package of foot and lower back massage.\nThe foot massage, though hard, was very relaxing and quite good.\nThe lower back massage included hard pressure as well but I really felt good after the full hour massage.\nThe shop was clean, convenient and pleased with the service!\n\n",
        "Xavier Woon\n18 reviews·34 photos\nRated 5.0 out of 5,\nThe staff in Golden Pail are very professional and skilled, especially the Lady Boss. Would highly recommend a visit if your body is feeling sore!\n\n",
        "Dilip Jayakumar\nLocal Guide·45 reviews·120 photos\nRated 5.0 out of 5,\nMassage worth every penny. The 90 minutes massage has free ear candling or body scrub too. The masseuses can speak basic English, good enough for you to let them know what kind of massage you need. Recommended and will be visiting again.\n\n",
        "Scott Brooks\n8 reviews·1 photo\nRated 4.0 out of 5,\nCalled before going in to confirm availability.\nWent with a 60 minute package of foot and lower back massage.\nThe foot massage, though hard, was very relaxing and quite good.\nThe lower back massage included hard pressure as well but I really felt good after the full hour massage.\nThe shop was clean, convenient and pleased with the service!\n\n",
        "Leo Mat\n1 review\nRated 5.0 out of 5,\nHad an awesome experience at the Golden Pail spa. I had crunched up my back and thigh muscles from an excercise session and was finding it really hard to walk or move around. Heard a lot of good reviews about Golden Pail Spa and wanted to try the place as it was close to where i was staying. Took a 90min Therapy session. The shower area, the bed and the surroundings were kept neat with extra towels. The therapist was sure to use the pressure points correctly to ease my back pain. Further more after the session, I was also given a back scrub within the 90 mins period. All in all, it was a 10/10 for me. The two most important aspects of this place, (i) the prices are reasonable compared to the other places around. (ii) The therapist was fully professional and NO naughty business, which made it easier for me as a guy to be comfortable. Thank you to the Golden Pail Spa team who made it an excellent experience for me. Will surely be dropping in the next time as well.\n\n",
        "Melody Soh\n3 reviews\nRated 5.0 out of 5,\nThe place to get a massage after a long day. The prices are reasonable and the rooms are clean and comfortable. The service staff are always courteous and accommodating. Been coming here at least once a week since they opened over a year ago. We’re even friends with all the masseuse :-)\n\n",
        "Raymond Yong\nLocal Guide·183 reviews·203 photos\nRated 3.0 out of 5,\nNice and clean place for a hard massage. Friendly staff. Shower in every room so you can come here after your exercise, take a shower before your massage. English language may be an issue as the masseurs are mainly mainland Chinese and Vietnamese.\n\n",
        "A L\n1 review\nRated 5.0 out of 5,\nAttended by vivi for the massage, Young but strong hand. A good listener and very friendly, had a wonderful 2hours.\n\n",
        "LXO\n6 reviews·16 photos\nRated 5.0 out of 5,\nAs a frequent spa massuer lover myself, partly because of my perpetually stiff neck since young. I have embark on my journey of spa-exploration. since about 5 years ago.\nOut of the numerous shop I visit. (At least 40) Slowly I built a own “go-to-place” list whenever I have a ache or just want to be pamper.\nOften I pass by this Golden Pail Spa but never walk in. Mainly because there isn’t any\nThen one fine day, while trying to get a fix on my neck. I tried the massage there.\n\nGuess what. This is it\nThe hunt is over.\nThis is the place when I know I will get the massage that will relive my aching problem.\n\nInitially was on 1 hr + 1 hr.\nNot only the massuer who serve me was polite, attentive and meticulous from the Get-go. She also took extra attention in attending to the ouch and ahh of the sound that I couldn’t help mumbling out when she hit the right spot.\n\nMain point, that night I slept well. (I have problem sleeping ever since divorced. ) nothing short of amazing, maybe is just me or some other experiences the same thing. Whatever it is they are doing. They are doing it right.\n\nDuring this covid period, it is also comforting to know that they are strict on the mask wearing, sanitise the rooms before and after i use. And strangers like me hanging around kept with social distancing.\n(I purposely stay a while more to see how is the rest of the environment like la.)\n\nIt been a Long time since I wrote a review, nonetheless I hope it serve it purpose.\n\nP.S) to add icing to the whole deal, because of the 2 hrS there is 磨砂 rub sand, it is like using scrub facial wash to wash your face but instead this is done to your whole body. I get to experience it for the first time too and wow.\n\nThis is why I say the hunt is over.\nKudos to the leader and the team for placing such importance to the customer like me and I gonna see you soon. :)\n\n",
        "Rayner Au\n1 review\nRated 5.0 out of 5,\nHave been to Golden Pail SPA @ Thomson on weekly basis for body massage and occasionally for reflexology since October 2018. Their massage were consistently up to my expectation i.e. correct pressure and strength at right places. The staff there are friendly and I had welcoming feeling all the times. I guess I will continue with this routine foreseeable future.\n\n",
        "Grace Chung\n3 reviews\nRated 5.0 out of 5,\nHighly recommended hot stone massage\n\n",
        "Francis Chia\n1 review\nRated 5.0 out of 5,\nGolden Pail Spa has got good ambience and the masseuses there are professional and friendly. I would recommend it to anyone looking for a nice place to relax and good massage.\n\n",
        "achal kumar\nLocal Guide·36 reviews\nRated 5.0 out of 5,\nThis place is awesome. Very professional, clean, nice ambience.\nCost is average. You dont need to book a package here. Just book an appointment and walk in.\nValue for money.\n\n",
        "Christopher Han\n1 review\nRated 5.0 out of 5,\nThis place is an absolute must come spa. Their foot and body massues were great and very professional. I gave a 5 stars rating for them\n\n",
        "Ivan Teh\n1 review·1 photo\nRated 5.0 out of 5,\nA nice place with affordable price to relax your body and mind .. the , very friend staff , cozy and clean environment.\n\n",
        "Abhijit Chavan\n3 reviews·4 photos\nRated 5.0 out of 5,\nSuperb lymphatic massage.. Eased my body after a strenuous run session...\n\n",
        "A C\nLocal Guide·257 reviews·249 photos\nRated 5.0 out of 5,\nGood professional massages at very decent prices. Highly recommended\n\n",
        "Naomi H.\nLocal Guide·143 reviews·161 photos\nRated 5.0 out of 5,\nGreat foot massage!! Reasonable price, friendly staff :-)\n\n",
        "Eddison Tan\n3 reviews\nRated 5.0 out of 5,\nVery good massage with amy\n\n",
        "Anthony Campos\nLocal Guide·47 reviews·5 photos\nRated 2.0 out of 5,\nSkills vary depending on the experience of girls\n\n",
        "Stella Zhan\n3 reviews·3 photos\nRated 5.0 out of 5,\nvery good\n\n",
        "Hai Tran\nLocal Guide·45 reviews·14 photos\nRated 5.0 out of 5,\nGood massage\n\n",
        "CORNELIUS LEE\nLocal Guide·150 reviews·322 photos\nRated 5.0 out of 5,\nClean spa\n\n",
        "Lewis Costin\n3 reviews·1 photo\nRated 5.0 out of 5,\nGood value for money!\n\n",
        "AnglersHood Familia\nLocal Guide·38 reviews·6 photos\nRated 3.0 out of 5,\nNot so good\n\n",
        "Isaac Ong\n5 reviews·2 photos\nRated 5.0 out of 5,\nExcellent body massage that effectively reduced muscle soreness and tension! The place is also really clean and the service is great!\n\n",
        "Shao pin Huang\n3 reviews\nRated 5.0 out of 5,\n(Translated by Google) kind\n\n(Original)\n親切\n\n",
        "Huyền Trang Trần Thị\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Anthony McCallum\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "张Vivi\n7 photos\nRated 5.0 out of 5,\n\n\n",
        "海纳百川丶\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "James Goodwin\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "nitha 2509\n2 reviews\nRated 3.0 out of 5,\n\n\n",
        "Jenny Ng\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Michael John Cortez\n1 review\nRated 1.0 out of 5,\n\n\n",
        "Alicia Carter\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Candy Chew\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Ngoc Leu van\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ganapathi Subramanian Rajarathanam (Ganapathi)\n14 reviews\nRated 4.0 out of 5,\n\n\n",
        "Gold Run\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Iris Wang\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Li zheng Tian\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "HONG HONG\n2 reviews·1 photo\nRated 5.0 out of 5,\n(Translated by Google) Small, small and powerful~♩\n\n(Original)\n小小，人小力不小~♩\n\n",
        "Divya L\n5 reviews\nRated 4.0 out of 5,\n\n\n",
        "DERRICK LOH\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Isaac Wong\nLocal Guide·31 reviews·12 photos\nRated 5.0 out of 5,\n\n\n",
        "Joey Lin\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Sean Loh\n3 reviews\nRated 4.0 out of 5,\n\n\n",
        "Huyen trang Tran thi\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Derrick Loh\n1 review\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6266 6218\">6266 6218</span>",
    "Website": "http://goldenpailspa.com/"
}