{
    "Name": "Grandeur Spa",
    "Products": {
        "Grandeur Traditional 皇庭古法": "$55.00",
        "Grandeur Exclusive 皇廷尚品": "$89.00",
        "Grandeur Traditional 皇廷古法": "$68.00",
        "Ear Refreshing 采耳": "$36.00"
    },
    "Address": "480 River Valley Rd, Singapore 248365",
    "Opening Hours": "Saturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nFriday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.6\n142 reviews",
    "Reviews": [
        "ZW Fatty\n1 review\nRated 5.0 out of 5,\nGrandeur Spa is my regular go to place due to the nice ambience and friendly staffs. Just had another session with my regular masseuse Fara. Fara is skillful and very experience in her massage. She is very soft spoken and knows how to make you relax and enjoy the massage session. Though petite but she applies enough strength to your body especially on those pressure points to release the muscle tension. Be sure to come back weekly for my regular massage. Also would like to compliment to Elise and Meimei the friendly receptionist, good job. What I love most about this place is they are very attentive to you and most importantly the masseuse does not play with phone and gives you 110% attention. Thanks again Fara for the amazing massage therapy, Elise and Mei Mei for the  good hospitality.\n\n",
        "Steven Loo\n1 review\nRated 5.0 out of 5,\nHave a session massage attached by Elsa.Elsa is a professional and great therapist.She is very patient and meticulous about helping to release the knots and strained muscle. Very good balance of strength and technique.Highly recommended, will visit to Grandeur Spa look for Elsa again.\n\n",
        "David Jones\n1 review\nRated 5.0 out of 5,\nI discovered this gem of a spa conveniently near my home and walked in for my first massage. The ambience was pleasantly relaxing and signing in was efficient and professional.\nI was attended to by Elsa who gave me a wonderful relaxing massage. Elsa is suprisingly strong for such a tiny girl and can provide whichever pressure you prefer. Good technique and left me feeling very satisified. Will definitely choose Elsa again for my next visit.\n\n",
        "ZW Fatty\n1 review\nRated 5.0 out of 5,\nGrandeur Spa is my regular go to place due to the nice ambience and friendly staffs. Just had another session with my regular masseuse Fara. Fara is skillful and very experience in her massage. She is very soft spoken and knows how to make you relax and enjoy the massage session. Though petite but she applies enough strength to your body especially on those pressure points to release the muscle tension. Be sure to come back weekly for my regular massage. Also would like to compliment to Elise and Meimei the friendly receptionist, good job. What I love most about this place is they are very attentive to you and most importantly the masseuse does not play with phone and gives you 110% attention. Thanks again Fara for the amazing massage therapy, Elise and Mei Mei for the  good hospitality.\n\n",
        "Steven Loo\n1 review\nRated 5.0 out of 5,\nHave a session massage attached by Elsa.Elsa is a professional and great therapist.She is very patient and meticulous about helping to release the knots and strained muscle. Very good balance of strength and technique.Highly recommended, will visit to Grandeur Spa look for Elsa again.\n\n",
        "David Jones\n1 review\nRated 5.0 out of 5,\nI discovered this gem of a spa conveniently near my home and walked in for my first massage. The ambience was pleasantly relaxing and signing in was efficient and professional.\nI was attended to by Elsa who gave me a wonderful relaxing massage. Elsa is suprisingly strong for such a tiny girl and can provide whichever pressure you prefer. Good technique and left me feeling very satisified. Will definitely choose Elsa again for my next visit.\n\n",
        "Ahui\n1 review\nRated 5.0 out of 5,\nHad return back to Grandeur Spa for 2nd time. Same masseuse with Elsa. She had a very good communication with mandarin. Her massage skill also very professional. Always asking for comfortable strength of massage. For sure will come back look for Elsa for another massage again.\n\n",
        "james haw\n1 review\nRated 5.0 out of 5,\nI have engaged Elsa for 1 hr to massage my back. She totally has the skills to tackle my backache problem. A very good therapist who is caring for her client and communicate well. After the massage, my backache is almost done. Very nice of her and her skill is superior! Thank you Elsa! Will visit again!\n\n",
        "Hien Oi\n1 review\nRated 5.0 out of 5,\nIt is my first time at grandeur and i was assigned Elsa that had great strength despite her petite figure 😊 she looks better than the photo i feel. Elsa is also very friendly and makes you feel comfortable to be with. Thumbs up! 👍\n\n",
        "BX Zhu\n1 review\nRated 4.0 out of 5,\nArranged an hour session with Vivi. Very remarkable a masseur who is able to release the heavy tension on my neck & back. A good conversationalist with a cheerful & positive character. Place has nice ambient with soothing music. Will revisit for the good experience.\n\n",
        "Koh Khai Chuan\n5 reviews·2 photos\nRated 5.0 out of 5,\nFeeling great today after a relax hot oil massage and had a good sleep. My therapist was Fara and her massage had loosen up my tight muscles for neck, shoulder and back. Great Job and will patronage Grandeur Spa again.\n\n",
        "Jason Chang\n1 review\nRated 5.0 out of 5,\nWalked-in for massage this morning after reading all the reviews. Ambience was serene and pleasant. Was attended to by Elsa. Good strength and really good with her hands. Left feeling relaxed. Will look for Elsa again when the need arises.\n\n",
        "Nick lim\n1 review\nRated 5.0 out of 5,\nElsa is the best Vietnamese therapist in my option she massage very good and very friendly will definitely will go back for her again.\n\n",
        "Min Hong Ong\n1 review\nRated 5.0 out of 5,\nHad a massage few days ago and I was greeted by a friendly receptionist Elise. She patiently explained the package and recommended the signature massage. I was attended by Rainie and I really enjoyed the massage. Raine is very skillful and the strength was perfect. Thanks both Elise and Rainie for the great experience.\n\n",
        "Jason Lee\n1 review\nRated 5.0 out of 5,\nHad a massage at Grandeur about 2 weeks back. Masseus was Elsa. Great techniques and strength. Was super relaxed after the massage. Will return again to look for Elsa when the need arises.\n\n",
        "Silvia The\n11 reviews\nRated 3.0 out of 5,\nA bit disappointment of the service after reading many good reviews. The massage did not take place 1 hour..i guess its around 45 mins as i need to wait them change the bedsheet. I was just getting massage on the back, without having massage in front of my body.. However, i give 3 star due to the good skill of massage therapist as she know the spots which my back aches..\n\n",
        "Zack Lee\n2 reviews\nRated 5.0 out of 5,\nBeing a customer, we always seek for the top notch service provider. And grandeur spa have the top notch massuer and they provide good quality massage to help u relax after a long hectic day from work.\n\n\"Elsa \" is one the best massuer they have.\n\n",
        "Edi Kay\n1 review\nRated 4.0 out of 5,\nVisited Grandeur after a couple of weeks of hard work that took a toll on the back and shoulders. Booked a slot and was assigned Fara.\n\nFara has strong hands, good fingers, elbows and feet that walked all over my back. Squeezing out all the lactic acids that have accumulated over working the past weeks.  Joints, neck and head were all relieved.\n\nAfter the 90 min session, I was refreshed. Standing taller with the accumulated aches and pains all soothed out. Will visit her again soon.\n\n",
        "EUGENE PANG\n1 review\nRated 5.0 out of 5,\nI would like to give special thanks to my regular therapist Fara. She is friendly and also skilled. Although petite in size but she her massage is strong and also knows the exact spots to ease my aching body after a long day at work. I would rate her a 10/10 for massage and also for professionalism. 60 mins isn’t enough for a session, would recommend to go for at least a 90 mins session where you can relax and feel refreshed after the massage. Definitely a go to place for a great massage as the other places which I have been too just massage terribly ending with a worst body ache after or the massage therapist would plays with their phone and sometimes end even before the 60 or 90 mins duration. Thanks for the nice ambience and also the great massage from Fara. Will definitely be back and to recommend more customers.\n\n",
        "Tony Neo\n1 review\nRated 5.0 out of 5,\nTotally enjoyed my massage today by Elsa. She’s efficient but gets all the right spots. Left feeling super relaxed. Will be back to look for Elsa again.\n\n",
        "Wong Soo Lin\n1 review\nRated 5.0 out of 5,\nGladys is a cheerful lady and provides wonderful massage. Will definitely visit and look for her servoce again!\n\n",
        "Jason Ang\n3 reviews\nRated 5.0 out of 5,\nWent to Grandeur Spa after seeing good reviews for it. Location was a little inconvenient but the ambience is quite comfortable. I took the $89 massage. The masseus who served me was Elsa. Elsa was very good with her hands and was able to converse proficiently in Chinese so I was able to tell her which areas of my body were sore. Overall, I was very satisfied with Elsa's service and will definitely return again regularly to look for Elsa. Keep up the good work!\n\n",
        "Angel Sia\n1 review\nRated 5.0 out of 5,\nToday went to Grandeur Spa the massage session was very nice and pleasure, appreciated the nice massauer Elsa who provided 5 stars services to me.\n\n",
        "Corbin Ng\n1 review\nRated 5.0 out of 5,\nWalked in to Grandeur Spa yesterday after seeing all the good reviews. Took a 1hr package and was attended to by Elsa. Elsa speaks very good Mandarin and massages very well. She constantly asks if her strength is ok and were able to soothe my sore body. I left the spa feeling very relaxed. Will return again to look for Elsa.\n\n",
        "Lim Jared\n1 review\nRated 5.0 out of 5,\nAfter friend referal to go there for massage i really didnt regret , personally i aint a person that like to go for massage as some masseur really dont have the skill instead of relaxing it will end up in pain . My masseur was niki i am impress by her skill she was gentle and all the point she hit it making me feel very relax . Definitly recommend her 👍\n\n",
        "Alfred Gonzalez\n1 review\nRated 5.0 out of 5,\nHad a session with Rainie. And i must say that she is on the best that i had. Her massage is skillful and the strength use is perfect. Elise hs been great from the moment i came in, guiding and explaining to me the different types of massage services availble. Thank you Rainie and Elise\n\n",
        "tan jia ching (Daniel921)\n1 review\nRated 5.0 out of 5,\nThis is my second time visit Grandeur SPA, nice & comfortable place to relax. I very impressive of the Masseur name of Elsa. She is very professional,skillful and friendly.\n\nMy massage was the perfect balance of therapeutic and relaxation. It was truly a massage therapy and she went above and beyond in every way to get the tension out of my neck, shoulders and back. She is a true professional. Highly recommended !! Will make appointment with her again.\n\n",
        "Martin Tan\n1 review\nRated 5.0 out of 5,\nAfter a long and tiring week, I decided to try Grandeur Spa today after seeing all the good reviews on Google. Was attended to by Elsa. Elsa was attentive during the massage and totally released all the tension built up in me. Glad to know that some reviews on Google are still trustworthy. Will return again to look for Elsa when I need a massage again.\n\n",
        "AA MZ\n2 reviews\nRated 1.0 out of 5,\nBooked a foot reflexology the day before. Came in the next morning, wasted my parking payment, and after 15 mins of check in THEY SAID WE DONT DO FOOT REFLEXOLOGY WHEN MY EMAIL BOOKING STATED THAT IT WAS FOR 90 mins foot reflexology. I left the place.\n\n",
        "Quentin Jacobson\n1 review\nRated 5.0 out of 5,\nI went back to Grandeur Spa for the second time this week. I love to get my massage after a week's worth of work and today was a perfect day as it was raining heavily. I came as a walk-in, so I wasn't expecting any therapist in particular. So when my session began, I was greeted by this super lovely and cute therapist Vicky.\n\nVicky's massage was so on point that I am booking all my future appointments with her from now on! :) Her professionalism during the session makes me so comfortable that an hour's session feels so short. She may be a small girl, but she is strong to handle my big sized body.\n\nLooking forward to the next relaxing session with Vicky, and the next time would be a longer session! 100/100!\n\n",
        "Joeson Wong\n1 review\nRated 5.0 out of 5,\nMy second visit to Grandeur Spa.The whole Spa is set up nicely and the experience was relaxing.Interesting with the hot oil therapy and meridian massage.Many thanks to masseur Elsa who was professional and was attentive to the specific needs.Massage strength and pressure suitably regulated and rejuvenated after the therapy session.Overall such a good experience, thanks to Masseur Elsa. I will definitely return again.\n\n",
        "Khalid H.\nLocal Guide·6 reviews·72 photos\nRated 1.0 out of 5,\nBooked a full body massage at their ‘promo’ price of $55. Turned up at 11am for my appointment and was immediately told that this promo is not a full body, only back and legs. Got really confused and showed the receptionist ‘Fara’ that it literally says full body massage. She pushes me to some hot oil massage instead for $89 that I really didn’t need. She said that only this is full body, not just back and legs. I said I’m fine without getting any head or neck massage so the fake ‘full body’ promo is good for me. Suddenly another lady comes into the fray and asks  Fara what’s going on etc. She then tells me the promo is only back massage, nothing else. I then tell her that it says full body, but even then Fara just said back and legs? Both of them now really become really push me and insist on the hot oil massage for $89. I keep shutting them down and we agree on a promo massage (keeping this as short as possible). They then ask me what girl I want, China, Vietnam. I was really confused - not sure why my alarms bells didn’t go off even more here. I said anyone will do. Here comes Elsa… the badgering to switch to the expensive hot oil massage doesn’t stop and she again says this promo is for back only. She was visibly frustrated but I said they just told me it’s back and legs. She says okay for legs but no thighs, which again I was really confused about and said fine. She begins what is the furthest thing from a massage I have ever experienced. She says if I don’t switch this massage really hurts, the hot oil is a lot better. She was literally causing physical pain to get me to switch, pinching the sides of my neck and then elbowing my backbone area. She then leaves and presumably tells front desk that I’m not switching. She comes back in and switches the aircon off, kind you it’s a really small and stuffy room. After about a minute I turn and say please turn the air com off it’s very hot. She screams as if I stole her handbag or something and says my mask is not perfectly on, she is actually shouting. It was obvious she was not interested in the cheaper massage and everyone was very angry that I didn’t get some hot oil massage. At this point, not sure why it took me this long, I got up and demanded a refund and left. I did a bit of google searching after this experience, and wow- so many reviews with the same experience except they were all smarter to leave a lot earlier than I did! A simple search on forums also clearly reveals that this place is really only interested in providing ‘special’ services. Visit their official Facebook page and see for yourself if this is a legit place.\n\n",
        "archive acd\n1 review\nRated 5.0 out of 5,\nThoroughly enjoyed my massage here! Elsa was very hospitable was very attentive to the pain points on my body. Quality is assured and I'll definitely be back for their other services!\n\n",
        "ANG “Dom” DOMINIC\n4 reviews\nRated 5.0 out of 5,\nClean modern affordable massage franchise. Prices are very reasonable and quality of massage is good. Bookings needed. Full body massage with private rooms, and comfortable surroundings. ELSA was friendly and assuring, with really good hands. Will definitely come back again!\n\n",
        "Puay Rui Yang\n1 review\nRated 5.0 out of 5,\nAlways enjoy my massages by Elsa. Extremely professional and knowledgeable.  The stretching and pressure was perfect to relive the tension in my body. Looking forward for my next visit!\n\n",
        "Miao Lin\n1 review\nRated 5.0 out of 5,\ni try before niki，vivi，gladys that had great strength despite her petite figure and fell so friendly make you feel comfortable to be with. Thanks will come again find them 👍\n\n",
        "Love Vy\n1 review\nRated 5.0 out of 5,\nWalked in for massage today afternoon. Took the $89 package. Masseus was Elsa. It's always enjoyable when the massage is solid and the masseus is pretty. Elsa speaks good Mandarin and is really skillful with her hands. I think Grandeur will become my regular spa of choice and Elsa will be my masseus of choice. Good job Grandeur Spa!\n\n",
        "Idham Ali\n1 review\nRated 5.0 out of 5,\nHad a session with Vicky today.\n\nBeen having a persistent lower back problem and finally after today’s session the pain is gone!\n\nVicky is also a very friendly and attentive masseuse. She asked what was ailing me before the session started and the session was not only very therapeutic and relaxing for me, but she also managed to make me feel very comfortable through her friendly small talks.\n\nCoupled with her good massage techniques I would say she is one of the best masseuse I’ve had in a while! Recommended!\n\n",
        "Edison Foo\n1 review\nRated 5.0 out of 5,\nI came back for the second time as the first massage experience was phenomenal. I would definitely recommend everyone to look for Elsa to get your massage. Overall a good service from them 10/10.\n\n",
        "Shong Ong\n1 review\nRated 5.0 out of 5,\nGrandeur Spa masseuses have great skills and it is a great place to relax especially after a busy work. I have tried both Vicky and Rainie recently and both have great skills and they are so friendly.\n\nThe receptionists June and Elise are also very friendly and always smile and explain patiently to customers about the massage packages offered.\n\nI would highly recommend for those who want to relax and enjoy a great massage to have a try at Grandeur Spa.\n\n",
        "sh o\n1 review\nRated 5.0 out of 5,\nHad a great massage session with Summer who is so friendly and we has a great communication during the massage session. Summer has great skill in massage and it was a great experience and would definitely look for Summer again.\n\nThanks for great recommendation from June and Elise for the friendly attitude as usual. Both receptionists are nice and friendly who are always greet customers with smiles.\n\n",
        "Keith Teoh\n2 reviews\nRated 5.0 out of 5,\nMasseur Elsa Is pretty good with her hands,  went in with pain and come out so relax. Comfy place and nice cosy ambience. Definitely a gem to look for moving forward.\n\n",
        "Cheelam Chow\n1 review\nRated 5.0 out of 5,\nToday first try with Gladys , she are good skill for massage even she quite a young girl ,  she was good attitude and friendly  👍\n\n",
        "SH O\n2 reviews\nRated 5.0 out of 5,\nJust had a massage session today, I would like to express great compliment for the receptionist Elise.\nShe is extremely polite and friendly who exhibits patience and professional manner. She explained patiently for all the packages available.\nI had a great session with therapist Rainie who is so skilful and easy going person. We had a great talk during the massage session. A great experience and highly recommended.\n\n",
        "qu doubletrouble\n1 review\nRated 5.0 out of 5,\nNice experience with Vicky！\n\nHer voice is nice and she did her job very well. After the session feels really comfortable and relax. She is very skillful and knows how to help people remove the pain and get more comfortable.\n\nWill come back again!\n\n",
        "Dre\n1 review\nRated 5.0 out of 5,\nJust finished a session with Rachel, I had a good relaxing session with her, she is still very friendly and professional, very glad that she is back!!\n\n",
        "Asyraf Hosni\n2 reviews\nRated 5.0 out of 5,\nI'm glad to have Boey as my therapist for the session.\nAt first, I thought the session is going to be tense or awkward.\n\nTurns out she could speak English well because I can't converse in Mandarin.\nShe is very kind and polite, made me feel at home and comfortable talking to her.\n\nHad a good conversation with her during the session.\nEnjoyed the massage very much and the professionalism that she maintained even though the working hours can be very long.\n\nWouldn't mind paying her a visit again at the spa.\nPlease send my thanks to her :)\n\n",
        "Mark Koh\n1 review\nRated 5.0 out of 5,\nVery nice ambiance spa. Had a good massage from therapist Angela. Strongly recommend for her. Good in communication and very easy going person. Had a very smooth session with her. Massage was very professional. Will come back to her again.\n\n",
        "Stephen Jiang\n1 review\nRated 5.0 out of 5,\nJust visited grandeur Spa last weekend . This my 2nd time visitation . Masseuse Karen quite good and she is quite friendly as well as will ask me if the amount of strength . She would also advise me if to extend half hour or an hour  if i need whole body relaxation . Will visit her again\n\n",
        "John T\n1 review\nRated 5.0 out of 5,\nA very clean and well managed place indeed. The cleanliness definitely put people’s mind at ease when visiting here for a good relaxation. The receptionist is professional when communicating with customer on the services, no hard sell. Nevertheless ,  the therapist Angela is also very professional in her technique and relieve my stiff neck. Angela is also very cheerful in conversing during the session, and so it makes the session feel easy going. Overall , it’s an absolute good experience.\n\n",
        "Fabian Low\n1 review\nRated 5.0 out of 5,\nHad been working and decided to have a full body massage. I often go for a massage like twice a month and had a lot of massage throughout my life but the experience at Grandeur SPA was the BEST.\n\nMy massage therapists Vicky were exceptional. All I can say is WORLD CLASS.\n\nA Meridian massage using hot oil is perfect.\n\nThe staff especially Vicky are all very kind and friendly.\n\nIf you want to be pampered and experience an amazing massage then I recommend that this is the place to go.\n\nOverall, BEST one ever!!!\n\n",
        "takumi fujiwara\n1 review\nRated 5.0 out of 5,\nBeen here twice for a massage session. Very nice ambiance and also soothing music played in the spa. My therapist Fara has been very patient with me and also recommended me their shop's signature hot oil package during my first session. Fara's massage skill was amazing and on point. She is very friendly and also made my feel comfortable throughout the session. If i could rate her, it would be a 10/10. For those who visit the spa, would recommend a minimum of 90mins or 120mins session (hot oil package), definitely no regrets. Thanks again to Fara (Therapist) and Elise (receptionist) for the awesome customer service. Would definitely be back again for my weekly massage. =)\n\n",
        "beo beo\n1 review\nRated 5.0 out of 5,\nJust ended my massage session with my therapist Fara. Shop is newly renovated with a very nice ambiance. Fara's massage was very professional and definitely relaxing. She's also very friendly. Felt rejuvenate and relax after a 90mins massage. Thanks to Fara, will definitely be back again as I had one of the massage among the other places which i have been to.\n\n",
        "vic jack\n1 review\nRated 5.0 out of 5,\nMet with Angela the first time today. She was demure and skilled. Despite her small fingers, she had sufficient skill and strength to press deep into my muscle tissues.  She has really good techniques, fun, outspoken and will make you leave with a smile, with an itching desire to return for the next massage session. Totally Awesome.\nVic- Signing off!\n\n",
        "Krishna Kumar\n2 reviews\nRated 1.0 out of 5,\nwow.. where to start..\nbooked an appointment and reached 10mins early.. i greeted the lady in reception.. but no response.  she goes \"are you first time here..?\" took my IC and keyed in the details..  then she explained the hows of 2 massages .. i chose one..  she did not even bother to listen but started selling the expensive one.. i explained that i ll try the traditional massage.. but still kept selling.. then another female came to the reception .. she directly started pushing me to take the hot oil massage.. i again explained to her, but she did the same, kept selling the hot oil massage.. i was not comfortable.. just, left the place..  so decide for yourself..\n\n",
        "Raj Kumar\n1 review\nRated 5.0 out of 5,\nHad a good session with fara will visit again. Felt relax and will recommend and be back.\n\n",
        "Reynold Lam\n1 review\nRated 5.0 out of 5,\nVicky massage is excellent. She is simply the best massage therapist I have ever used. She focus well on my trouble area!!!\n\n",
        "Que Cody\n1 review\nRated 5.0 out of 5,\nHad a great session with therapist Vicky. She is very friendly and had very good skills. Managed to have a nice chat with her too. 10/10 for Vicky. Will definitely visit again to have another session. Thumbs up!!\n\n",
        "LS K\n3 reviews\nRated 1.0 out of 5,\nphotos and real person not the same. Massage quality poor. They will push you to take the $86 session then they will massage your WHOLE body. Too many of such shops in Singapore nowadays\n\n",
        "Feng Lim\n1 review\nRated 5.0 out of 5,\nAngela is my regular therapist. Her skills and services are excellent, and she is also very attentive and friendly, which elevates the quality and professionalism of the entire experience. Highly recommended!\n\n",
        "CHIAM YI FA\n2 reviews\nRated 5.0 out of 5,\nAtmosphere & Environment here is good, clean and tidy. Masseur Angela is good massage therapist by applying with the right strength and skills to loosen up. 5 stars for her.\n\n",
        "Paige B.\n10 reviews·2 photos\nRated 3.0 out of 5,\nI would love to give this place a higher rating - but this was far too noisy to offer anything close to a relaxing experience.\n\nPros:\n- We were able to book last minute, day-of\n- Facilities were clean and had a nice aesthetic\n- Technician was good\n\nCons:\n- Absurdly loud - From a loud banging noise for 15-minutes, to the person next door conversing non-stop, and girls (assume they work there?) giggling, it was super annoying and not at all relaxing.\n- Due to noise, I was not able to relax or enjoy the session, except a brief 10-minutes at the start.\n- Minor, but no place in the room to place your clothes / belongings (e.g. basket or ledge).\n\nI guess if you brought noise cancelling headphones this place might be ok.\n\n",
        "lao husky\n1 review\nRated 5.0 out of 5,\nThis is a place worthy of our coming!The staff were very kind to us when we went in and I feel very relaxed during the massage.I had a great session with therapist Angela , I have a good conversation with her and a she also has great skills in massage.I'll be back here for her next time.\n\n",
        "Myles Kehoe\nLocal Guide·25 reviews\nRated 5.0 out of 5,\nLiving nearby so was happy to try Grandeur for the first time.  What a beautiful, spotless interior with decor and stunning wallpaper & furnishings.  Super helpful receptionist walked me through options and decided on foot massage which was reasonably priced at 48$ for one hour.  I’ve had many foot massages since emigrating to SG from Europe but this was by far the most attentive, relaxing and totally enjoyable....thank you CAT!! ❣️ Already looking forward to my next visit with you.\nLoved how all the staff said hello as I sat on my chair...attention to detail peeps!!  This is how it’s done 🥇\n\n",
        "Su Yizhong\nLocal Guide·6 reviews·73 photos\nRated 5.0 out of 5,\nVicky is very welcoming and able to meet the needs of a tired body. While you are relaxing, she never fail to hold a good conversation with a smile.\n\n",
        "shong on\n3 reviews\nRated 5.0 out of 5,\nHad a great session with Fara today. Fara is friendly and has a great skill in massage.\nElise from the counter is friendly and very professional.\nGreat place to relax with great ambience and highly recommended!\n\n",
        "Jim Janson\n1 review\nRated 5.0 out of 5,\nUr masseuse really gorgeous and sexy, i like their massage very gd, make me really happy everytime the massage end coz my whole body feel rejuvenated. Karen very sexy, i like her very2 much. will come again\n\n",
        "Ah Pro\n3 reviews\nRated 5.0 out of 5,\nLuxurious and quiet environment. Great customer service and very efficient response from the lady responding on WhatsApp. Karen was my masseuse and she was very skillful. Loved the recommendation to try out the hot oil massage, an overall great experience\n\n",
        "shanwei fu\n1 review\nRated 1.0 out of 5,\nangela's attitude is horrible! started the timing early and ended the massage 10 mins early. when i am about to leave, still fold her hands and give a black face. why? this job is difficult and if she cannot handle basic customer properly she need to go back to her home country!\n\n",
        "Lim Seng Wee\n2 reviews·2 photos\nRated 5.0 out of 5,\nMy body feel better and the bodyach had reduce this few days. I am a person that very seldom go massage. After the last session i actually decide to visit regularly and will visit again soon\n\n",
        "brandon sim\n1 review\nRated 5.0 out of 5,\nVicky has a good sense of humor and service is excellent! Her patient and skillfulness would\nRate a 5 ⭐⭐⭐⭐ .. will be back again for sure...cheer.\n\n",
        "Zaw Ye Naing\n3 reviews\nRated 3.0 out of 5,\nAds pop up so I tried . Massage was ok but masseuse kept selling me hot oil which I stated repeatedly not interested . And one hour session only last around 40-45 mins top .\n\n",
        "Lim Frank\n1 review\nRated 5.0 out of 5,\nVicky is well versed in the body connection and how the systems work together. She spent extra time to help pinpoint the cause of my pain and spent time working it out to ensure I left with some relief.\n\n",
        "sean yap\n1 review\nRated 5.0 out of 5,\nAm a regular customer of angela, she is a friendly & funny young lady. Sometime she will joke with me. She looks young but her skill set is excellent. Not too hard or soft. the pressure was just nice!\n\n",
        "Michael F\n1 review\nRated 5.0 out of 5,\nWas a good experience. The place was clean . My masseuse was Rainie. Excellent service. Good communication and very patient. Deserve 5 stars for her good massage.\n\n",
        "1994 zhuzhu\n1 review\nRated 5.0 out of 5,\nGood session with Niki and she very friendly🤗🤗\n\n",
        "Review World\n1 review\nRated 1.0 out of 5,\nThe worst massage experience ever. The charge is high, but the standard is not up to the standard at all, especially the quality and attitude of the masseurs are super poor.\n\n👎\n\n",
        "rick tang\n1 review\nRated 5.0 out of 5,\nGreat relaxing place and professional massage services. Boey is very skilled and able to target knots. The whole experience  was amazing.\n\n",
        "Jason Low\n1 review\nRated 5.0 out of 5,\nI was tired after a long day at work and Angela managed to hit the right spots with the right pressure to relieve the body aches. She was smiley and friendly throughout the session.\n\n",
        "Glen Lewis\n2 reviews\nRated 5.0 out of 5,\nChose vicky. Excellent masseuse! Good communication and very patient! She deserve 5 stars for her good massage and patient service!\n\n",
        "danny lai\n1 review\nRated 5.0 out of 5,\nThe place is clean and the ambience is good. Receptionist is friendly. Massage was superb awesome.kudos to BOEY ,will highly recommend and visit again ! Thank you and well done !\n\n",
        "David Lim\n1 review\nRated 5.0 out of 5,\nI had an enjoyable session with Christy, very nice bubbly character with great massage technique. Will revisit again.\n\n",
        "chen zhiliang\n2 reviews\nRated 5.0 out of 5,\nThe place is clean and the ambience is good. Receptionist is friendly. Massage was superb awesome. Kudos to CAT.😻 Will highly recommend and definately will visit again.\n\n",
        "Pang Choon Jie\n1 review·1 photo\nRated 5.0 out of 5,\nThe service is very good, the massage technique is very good and very comfortable,  Angela masseur's service attitude is very good and caring, it is worth coming again next time\n\n",
        "Randy Chew\n1 review\nRated 5.0 out of 5,\nVicky has done a good job both massage and ear cleaning\n\n",
        "Robert Johnson\n2 reviews\nRated 3.0 out of 5,\nAmazing massage but the masseuse was asking for an enormous tip. Be aware.\n\n",
        "Ohblah Lam\n1 review\nRated 5.0 out of 5,\nVicky was good at her massage,clearly knows what she is doing 10/10\nHelp relieved my body aches\n\n",
        "Kenneth Wong\n1 review\nRated 5.0 out of 5,\nVICKY IS VERY PROFESSIONAL, CUTE AND FRIENDLY. MASSAGE VERY GOOD, RIGHT ON POINT, GOOD STRENGTH. WILL COME AGAIN\n\n",
        "D Long\n1 review\nRated 5.0 out of 5,\nThis is my second time going, Elsa was friendly and professional at her work !!!\n\n",
        "richard lee\n1 review\nRated 4.0 out of 5,\nI have a great massages by her, Fara also friendlyand a good SKILLS THANK YOU\n\n",
        "Digimon Globemon\n1 review\nRated 5.0 out of 5,\nIt is a very nice massage experience. I recommend anyone to come try it out!\n\n",
        "Hunter x hunter\n3 reviews\nRated 5.0 out of 5,\nThe staff is friendly n polite to customer. Therapist boey is pretty good n skillful service. Would come again. Thanks\n\n",
        "Ting xuan\n1 review\nRated 5.0 out of 5,\nFriendly receptionist. Great communication, cheerful.. massage from Rainie is good too.. thank you Elise and Rainie\n\n",
        "Ng Kahhui\n2 reviews\nRated 5.0 out of 5,\nVery good massage from Rainie,and thank you Elise for great communication,friendly and happy\n\n",
        "H Kenny\n1 review\nRated 5.0 out of 5,\nClean, reasonable and skillful massage. Will definitely be coming back. Silver very good\n\n",
        "Aiman Jumari\n3 reviews·1 photo\nRated 5.0 out of 5,\nRainie.. friendly and professional. Would return again. Good place for massage.\n\n",
        "JE\n1 review\nRated 5.0 out of 5,\nVicky is the best! Will definitely come back again.\n\n",
        "Aimad Amri\n1 review\nRated 5.0 out of 5,\nGood session with vicky and she very friendly🤗🤗\n\n",
        "ayyappan ayps\n3 reviews·2 photos\nRated 5.0 out of 5,\nThe service is Excellent... Fara is very good Professional..My body fell relax now... Thank you 💐\n\n",
        "turbo lim\n1 review\nRated 5.0 out of 5,\ni would like to thank vicky for the wonderful massage\n\n",
        "soh Teng Chew\n4 reviews·3 photos\nRated 5.0 out of 5,\nAngela is a very good and skillful and professional masseuse\n\n",
        "Epit Rahim\n1 review\nRated 5.0 out of 5,\nVicky is the best... good talker and strong massage\n\n",
        "he jacky\n1 review\nRated 5.0 out of 5,\nHer hazel massage technique is very good, excellent\n\n",
        "Eric Kang\n3 reviews·1 photo\nRated 5.0 out of 5,\nVickey is very skillful, must look for her\n\n",
        "Orang Kaya Bakar\nLocal Guide·14 reviews\nRated 5.0 out of 5,\nAwesome place. Brand new. Good massage and friendly staff\n\n",
        "Taufik Jr\n1 review\nRated 5.0 out of 5,\nMia & Karen. Tip Top 5 🌟, Love these two🌹💆‍♂️.\n\n",
        "Tan Ho\n1 review\nRated 5.0 out of 5,\nSilver therapy is extremely skillful and beautiful .\n\n",
        "Lincoln Anthony Fernandez\n21 reviews·1 photo\nRated 5.0 out of 5,\nGood spa\n\n",
        "Ray Ong\n2 reviews\nRated 5.0 out of 5,\nNice Ambiance Great Massage!\n\n",
        "Tom Lee\n1 review\nRated 1.0 out of 5,\nThe receptionist terrible attitude send back to Malaysia..\n\n",
        "Vhic DYU\nLocal Guide·29 reviews\nRated 4.0 out of 5,\nClean, new place; Ms Boey was friendly\n\n",
        "Low John\n1 review\nRated 5.0 out of 5,\nGladys 666\n\n",
        "Rekha Gautam\nLocal Guide·20 reviews·4 photos\nRated 3.0 out of 5,\nToo pricey for the okayish service.\n\n",
        "Mars C\nLocal Guide·20 reviews·159 photos\nRated 5.0 out of 5,\nGreat massage!\n\n",
        "Bobby Zainal Abidin\n16 reviews·6 photos\nRated 5.0 out of 5,\nProfessional and exquisite\n\n",
        "Joseph Solomon約瑟夫 所羅門 조셉 솔로몬\nLocal Guide·17 reviews·6 photos\nRated 5.0 out of 5,\nJust had a session with Summer despite my first time there. Ambience wise was good and with friendly staff, and will consider as a regular go-to place. …More\n\n",
        "lee91 james\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The counter service is good, the masseur is very good, and the massage is good.\nThank you Rainie for the good massage. …More\n\n",
        "Leng Heaven\nLocal Guide·99 reviews·236 photos\nRated 5.0 out of 5,\n(Translated by Google) The professional masseur vicky service is very good, the people are very easy-going, will patronize …More\n\n",
        "Torsten Wolf\nLocal Guide·13 reviews·17 photos\nRated 5.0 out of 5,\n(Translated by Google) I would recommend it was very nice and clean ambience\n\n(Original) …More\n\n",
        "KJeck1991\n9 reviews·2 photos\nRated 1.0 out of 5,\n(Translated by Google) Negative Ratings\n\n(Original)\n差評\n\n",
        "Ghazali Ramlan\n3 reviews·471 photos\nRated 5.0 out of 5,\n\n\n",
        "Nigel Mark\n10 reviews·5 photos\nRated 5.0 out of 5,\n\n\n",
        "Eugene Pang\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6310 5589\">6310 5589</span>",
    "Website": "http://www.grandeurspa.sg/"
}