{
    "Name": "Green Apple Spa",
    "Products": null,
    "Address": "765 North Bridge Rd, Singapore 198733",
    "Opening Hours": "Saturday 12pm–4am\nSunday 12pm–4am\nMonday 12pm–4am\nTuesday 12pm–4am\nWednesday 12pm–4am\nThursday 12pm–4am\nFriday 12pm–4am\nSuggest new hours",
    "Rating": "4.2\n292 reviews",
    "Reviews": [
        "Amarjit Sahota\n14 reviews·1 photo\nRated 1.0 out of 5,\nI have backache and pain after a bad massage. They gave me a masseuse who could not understand English.\n\nI kept telling her I was in pain however she could not understand. It was a painful massage and I now have severe aches that I have not slept well for two days.\nTried contacting Green Apple Spa about my experience and want to advise them to only use English speaking masseuse for non-Chinese customers, however no response.\n\n",
        "J N\n12 reviews\nRated 5.0 out of 5,\nI’ve been to GAS many times before, and it is still my go-to place for massage. Called to reserve a 1.5h slot for leg & shoulder massage, and requested for a private room for couple. Upon arrival, I was welcomed warmly and was shown to the private room 😁\n\nMy masseur was Coco and she would adjust her strength according to my request.\n\n10/10 for service & massage. Would definitely visit GAS again.\n\n",
        "Connie Tan\nLocal Guide·57 reviews·263 photos\nRated 5.0 out of 5,\nFirst time to this branch, usually visit their Tanjong Pagar branch. Very nice, cozy environment. . Seats were comfortable and they had a big screen playing movies. Staff were all friendly, from reception to masseur. Very skillful and enough pressure, and will check few times with you to make sure pressure was ok. Recommended to visit here.\n\n",
        "Amarjit Sahota\n14 reviews·1 photo\nRated 1.0 out of 5,\nI have backache and pain after a bad massage. They gave me a masseuse who could not understand English.\n\nI kept telling her I was in pain however she could not understand. It was a painful massage and I now have severe aches that I have not slept well for two days.\nTried contacting Green Apple Spa about my experience and want to advise them to only use English speaking masseuse for non-Chinese customers, however no response.\n\n",
        "J N\n12 reviews\nRated 5.0 out of 5,\nI’ve been to GAS many times before, and it is still my go-to place for massage. Called to reserve a 1.5h slot for leg & shoulder massage, and requested for a private room for couple. Upon arrival, I was welcomed warmly and was shown to the private room 😁\n\nMy masseur was Coco and she would adjust her strength according to my request.\n\n10/10 for service & massage. Would definitely visit GAS again.\n\n",
        "Connie Tan\nLocal Guide·57 reviews·263 photos\nRated 5.0 out of 5,\nFirst time to this branch, usually visit their Tanjong Pagar branch. Very nice, cozy environment. . Seats were comfortable and they had a big screen playing movies. Staff were all friendly, from reception to masseur. Very skillful and enough pressure, and will check few times with you to make sure pressure was ok. Recommended to visit here.\n\n",
        "S M\n17 reviews·1 photo\nRated 5.0 out of 5,\nBooked a couples room. Massage was great and the environment allowed us to relax and enjoy.\n\n",
        "Jonathan Parry\nLocal Guide·94 reviews·146 photos\nRated 5.0 out of 5,\nAlways come here. The place is really good. I come alone so they can usually find me a spot which is great. Can get a little noisy though if you get some other loud patrons which is a bit annoying. I’d recommend all the green apple outlets.\n\n",
        "Cheang Kim Lee\n106 reviews·8 photos\nRated 5.0 out of 5,\nBeen there a few times. Very experienced masseue. Totally feel relaxed after massage.\n\n",
        "Red Barker\nLocal Guide·347 reviews·1,888 photos\nRated 5.0 out of 5,\nFantastic facilities and real value-for-money packages. Friendly, professional staff who take care of you whilst delivering very good, relaxing massages every time.\n\nBooking has been easy for me, with long advance reservations not usually required.\n\nI have recommended to friends and contacts.\n\n",
        "Aqylla J\n2 reviews\nRated 5.0 out of 5,\nMy masseur Francis knew all the correct pressure points and the perfect amount of pressure to apply. But would constantly ensure that I was comfortable which made me feel very at ease. Not one to go for massages in Singapore but this is my second time here and it’s worth all the money spent. Will definitely come back and look for Francis again. My mom and sister also really enjoyed the experience can’t wait to be back.\n\n",
        "Nurul Mimsy\nLocal Guide·72 reviews·300 photos\nRated 4.0 out of 5,\nHad one of the best massages here. Went for the 30 minutes foot + 60 minutes body massage combo. Receptionist was friendly. We came on Saturday night and got lucky, as we could walk in without an appointment. But it is advisable to make a booking beforehand.\n\nRated one star down because the foot massage was quite meh. The male masseuse didn’t put much pressure and the area we were at (Level 1) was next to their staff resting area, and there was a young male masseuse watching videos without using an earpiece. Kind of disrupting my peace and quiet.\n\nBut my body massage was freaking amazing, seriously. I didn’t manage to get my masseuse’s name but ironically, she was much stronger than the male masseuse I had earlier, and paid attention to details to get rid of my knots and muscle soreness.\n\nWill definitely come back.\n\n",
        "Xavier Wang\nLocal Guide·42 reviews·64 photos\nRated 2.0 out of 5,\nThe receptionist has a pretty poor attitude, she simply can't be bothered whether at the counter or over the phone. This puts a real damper on the overall experience. The massage quality really depends on who is the masseuse, and there's been some hits and misses.\n\n",
        "Mohammad Fadly Aziz\n5 reviews\nRated 5.0 out of 5,\nThis place is cosy, offers good massage and above all clean.\n\n",
        "Elly Suhaila\n6 reviews\nRated 5.0 out of 5,\nI am satisfied with the massage and experience. Can say this is one of the best massage i had in SG! Did combo 1hr body + 30mins foot and was attended by 2 different masseuse for each. Both was equally good and massage were super on point.\nThe only downside was the receptionist who did not share the promotion and we actually paid a higher price when we could have enjoyed the discount. Nevertheless the massage makes up for it!\nWill come back but will be smarter on the ongoing promo!!\n\n",
        "Ho Zan Wen\n9 reviews\nRated 4.0 out of 5,\nGreat massage... Chatted with masseur all the way and dont feel pressured to like having to sign a package... Just tot it would have been better if got some relaxing music at the background... Price quite reasonable too for a full massage at 90 mins...\n\n",
        "Andy Yap\nLocal Guide·13 reviews·41 photos\nRated 4.0 out of 5,\nThe leg massage exceed my expectations.. The strength on the massage is quite good... Rem to see there is promo the customer service crew at the counter did told us so we took the more worthy package for slight longer massage time\n\n",
        "Dom Perignon\n8 reviews·2 photos\nRated 5.0 out of 5,\nA regular at this spot for my food massage. My masseur is very consistent with his massages. Thumbs up\n\n",
        "Roderick X\n6 reviews\nRated 4.0 out of 5,\nGreat place to unwind and enjoy a Chinese style Zhi Ya massage. Environment is clean and quiet. Opens till late but reservation is preferred. Price is reasonable too.\n\n",
        "Gerald\n16 reviews·4 photos\nRated 2.0 out of 5,\nFoot massage was not relaxing at all. Hurt way too much\n\n",
        "Andrew Chwee\nLocal Guide·712 reviews·2,874 photos\nRated 5.0 out of 5,\nI liked this place. Generally, the masseur here is very well trained although there are some are not. Price is reasonable for Singapore and it's packed most time so do your booking (just call and reserve) early to avoid disappointment. Opens till late night so you almost can get your tired legs cared for while watching a movie on their large screen. If you are looking for a private zone out place, this is not it.\n\n",
        "Dirle Wanger\n6 reviews·2 photos\nRated 3.0 out of 5,\nMassage was ok. But don’t expect to be able to zone out. The amount of noise, talk, laughing, burping, walking in and out of shop just ruined it being a relaxing experience. Tell your staff to be quiet and respect the customer paying money to relax.\n\n",
        "Suzie A\n12 reviews\nRated 5.0 out of 5,\nAwesome food\nLove the hot & sour chicken soup\n\n",
        "Chee Soon Ng\nLocal Guide·105 reviews·53 photos\nRated 5.0 out of 5,\nThe massage are great, the masseur is quite knowledgeable in term of massage. She can tell me about which point she massage will help to relieve.\n\n",
        "Jingshun Lim\nLocal Guide·22 reviews·48 photos\nRated 5.0 out of 5,\nGreat place for ad-hoc massage, therapists have all been very skilled and professional. And, very importantly - there's no pressure to buy any packages. No up selling at all! That's a great peace of mind!\n\n",
        "Anwar Ali\n3 reviews·4 photos\nRated 1.0 out of 5,\n1st time here, made a booking for full body for 3 people,myself and my parents.  we asked if its ok for 1 hour 30 mins for 3 of us , the front counter guy said ok and went to charge the card accordingly.  A few seconds later he said sorry can only do 1 hour, he then went to void the transaction and proceed to ask us to make another payment . After which we went to our rooms, to my horror I had to share the room with my dad. I am not ok with that .I went downstairs to the counter guy and asked him if there are any other single rooms , he said all fully booked. And proceed to blame me for not informing them when he himself didn't confirm with us before payment was made for the 1st and 2nd time. I don't think its a usual practice for us to ask for single rooms , I didn't want to make a wasted trip so I cancelled my full body and opt for foot massage instead for obvious price difference he had to refund cash since we initially paid for 3 full body.  Here comes the worst part, while enjoying my foot massage the counter guy come and interrupted my massage by giving me the refund.  Why can't you give it to me later after my massage? Honestly this would have been a great review if things were better.I'm really not happy with the counter guy working on 27th December 2020 on 9pm when we came\n\n",
        "Tan Ernest\n4 reviews·3 photos\nRated 4.0 out of 5,\nlooking for a good foot massage with movies? here is the place to be.\n\n",
        "Yvonne Goh\nLocal Guide·26 reviews·93 photos\nRated 1.0 out of 5,\nInconsistent protocol. Booked a 60 minutes body massage today with my friend. She got a good masseuse who communicated with her on the pressure and areas she wanted more work on.\n\nWhereas I got a masseuse who did not ask me a thing and exerted so much pressure throughout even after I told her to be gentler twice. She focused a lot on the top parts of my back that I'm feeling more aches than when I went in. My back feels bruised that I'm having trouble lying on it to sleep now.\n\nThere was a bit of head massage which just felt like her pushing her fingers into my scalp and trying to decrease the size of my head.\n\nFor $59, the massage was definitely not what I expected, with the masseuse I got. I hope they review their masseuse's skills and ensure all ask simple questions (room temp, pressure, areas to focus more on) to their clients before and during the massage.\n\n",
        "Gerald Tan\nLocal Guide·39 reviews\nRated 4.0 out of 5,\nBeen a Long time customer of Green Apple Spa. The massage techniques are not bad and is highly dependent on which masseuse you are assigned. Chairs felt abit dated although were luxurious and the foot massage area has a large projector TV showing movies. Calming atmosphere but prices are high.\n\n",
        "Mohamed Hassan Noordin\nLocal Guide·45 reviews·109 photos\nRated 5.0 out of 5,\nFantastic place with awesome customer service. Place is good for spa. Big wide screen projector and comfortable seats\n\n",
        "B.\nLocal Guide·105 reviews·1,101 photos\nRated 5.0 out of 5,\nVery good massage at this place. First floor is mainly for foot massage. Second floor is for body massage. For those who wants to have privacy, there are two VIP rooms available on the first floor. I did body massage on first floor VIP room foot massage chair. It was very comfortable. Will visit again.\n\n",
        "josephine lim\n7 reviews·1 photo\nRated 1.0 out of 5,\nWORSE MASSAGE EVER ! masseur by the name of mia, china lady, fell asleep for more than 5 times during the massage !!!!\ngiven her chance still proceed with guasha service . it feels like she is using a sharp plate scrapping my back !!! now my whole back is full of bruises !!!!\nwaste $80 and my time there .\n\n",
        "Noordin Sagit\n14 reviews\nRated 5.0 out of 5,\nPower.. need booking to avoid disappointment especially for weekend. Should try to appreciate...\n\n",
        "千金难买一声响\nLocal Guide·67 reviews·8 photos\nRated 5.0 out of 5,\na very relaxing atmosphere they got there. very big and comfy seat. will i go back again? no actually because the masseuse skill is just average. 1 plus point is their closing hours are later. So if ur dying for a massage this is the place. Decent place. No \"special\" service.\n\n",
        "Amanda Fong\n2 reviews\nRated 2.0 out of 5,\nBooked a one hour foot massage at this evening and was assigned to the masseuse, Yoyo. I initially already found it strange that a female masseuse is serving me as most of the foot masseuse are males. Her massage was really bad. It felt as if she was playing with my foot during the hour although I can see that she was trying. Seems like a technique/ training issue. Will likely not return and if I really were to do so, I will definitely request for a male masseuse.\n\n",
        "Michelle Cronin\nLocal Guide·98 reviews·4,785 photos\nRated 4.0 out of 5,\nIt's a great spa, I went for a 60 minute foot massage. The couches in the \"cinema room\" are v comfortable and it's nice to be able recline and watch a movie if you want. The only reason it's a 4 instead of a 5 is because the toilet smells like a urinal and my feet were slipping in my shoes after, prefer the feet to be washed at the end.\n\n",
        "Celine Yen\nLocal Guide·82 reviews·6 photos\nRated 4.0 out of 5,\nLady who does the massage has good skills. Staff at counter did not let me know about 90mins promo which otherwise i will have give 5 stars.\n\n",
        "La Madame NomNom\nLocal Guide·815 reviews·8,023 photos\nRated 4.0 out of 5,\nIt's getting better over the years. No more damp towel smell. And the spa looks brighter and cleaner. Price increased too. On the expensive level.\n\n",
        "Jason Phua\nLocal Guide·23 reviews·1 photo\nRated 5.0 out of 5,\nAlmost always perfect massage experience. All I want is a strong, consistent masseuse who knows where and when to apply the right amount of pressure on pressure points. Has been same experience 8 out of 10 times...\n\n",
        "Robert\nLocal Guide·41 reviews\nRated 1.0 out of 5,\nFirstly they weren’t taking anyone’s temperature which seems highly reckless. The atmosphere is terrible and no way relaxing. They had a movie playing at a loud volume and the room smelled of mould. The massage was ok but was unable to enjoy because of how horrible the environment was.\n\n",
        "Ashley Cheang\nLocal Guide·26 reviews·7 photos\nRated 4.0 out of 5,\nService ain't too bad.\n\n",
        "Jessa L\nLocal Guide·50 reviews\nRated 3.0 out of 5,\nWent a few times as I'd encountered many very skillful and good foot masseurs. Stopped going after encountering a very lazy masseur who skived while massaging and who'd cut my timing. Gave feedback but think nothing was done.\n\n",
        "Harith Jamat\n8 reviews\nRated 5.0 out of 5,\nOne of the best massage in SG! Consistent quality from them, very friendly reception always, clean vicinity no doubt.\n\n",
        "Mann Dee Ng\n3 reviews\nRated 4.0 out of 5,\nFirst time here, reccomended by a family member. Pleasant services and my sore and stiff back felt much better in the good hands of therapist Katie. The face hole on the bed is uncomfortable for prolong duration. Likely the same at most massage parlours.\n\n60mins body massage at $56 (without aromatherapy oil). Those interested in body massages will recommend to do at least 90mins.\n\n",
        "WenD Tan\nLocal Guide·460 reviews·1,233 photos\nRated 1.0 out of 5,\nThere was no systematic way of massaging the feet.. I have been to much better place like Kohong and kenko.\n\nThe most disturbing was that there was a huge area of black mold on the wall (on the screen where they project a random movie)  near the airconditioning vent in the first floor foot massage area.\n\n",
        "Lalit Saxena\nLocal Guide·19 reviews·4 photos\nRated 5.0 out of 5,\nPeople looking to actually get good massage should definetly visit this Spa. This is a really good place. I had a 1 hour aromatic oil massage and am extremely satisfied. Will visit again whenever I am in Singapore.\n\n",
        "ruzaini rohaizat\nLocal Guide·16 reviews·19 photos\nRated 4.0 out of 5,\ni truly enjoy the foot reflexology massage here. Very good and consistent, no matter who massages you.\n\n",
        "Ivy Morrison\n7 reviews\nRated 1.0 out of 5,\nAVOID at all cost. Had a full body massage on 29/09/19 and instantly broke out in bruises. Advised the girl to stop a number of times. But she continued to rub her knuckles down my back and legs. That is not a massage\n\n",
        "Marta Beiçudo\n1 review\nRated 1.0 out of 5,\nThe staff wasn’t nice, no sympathy, no music, the room had a bad smell, the massage was very aggressive and even when I asked to be softer it wasn’t a pleasant experience. I have my back hurt and full of marks. Did less time than was expected and payed for.\n\n",
        "Suzana Salleh\n5 reviews·15 photos\nRated 5.0 out of 5,\nGOOD tuina massage by CoCo. Clean place. Good ambience + music. Recep is polite, accomodating and has initiative. Helped with door n my luggage unasked. Happy rejuvenated customer here.\n\n",
        "Jurerat Kongkiattiwong (June)\nLocal Guide·132 reviews·392 photos\nRated 5.0 out of 5,\nAffordable massage place in sg with thr therapist that is good. I always came here for the warm foot bath, foot massage and head & shoulder package. They always have movies for you to watch with free wifi.\n\n",
        "Zee Zi\nLocal Guide·7 reviews·2 photos\nRated 5.0 out of 5,\nExperienced therapists took time to ask & understand pain points. Catered the massage to individual customer. Excellent massage.\n\n",
        "Nguyen Ngo\n26 reviews\nRated 1.0 out of 5,\nBad smell and dirty uninviting rooms.\nReceptionist was blunt.\nAsked three times to be softer on the pressure\nAsked for air con to be turned off but it was left on.\nStaff kept talking\nVery hard to find someone that speaks fluent English here. Not going back.\n\n",
        "Morgan Li\n2 reviews\nRated 1.0 out of 5,\nBecause opposite Thailand is massaged decorate, come over so try, without contrast did not hurt. No. 24 called ah kai master, acupoint did not understand, disorderly by a pass, completely feel not serious attitude, do not know the new or what, this work attitude is really sad boss. Not recommended, those who say yes, you have not seen the better?\n\n",
        "Samantha See\nLocal Guide·23 reviews·23 photos\nRated 4.0 out of 5,\nReasonably-priced body and foot massages. Therapists are professional and generally consistently good. Quick and thorough service, and a clean, comfortable space.\n\n",
        "bryan Leong aka Drifterdrift\nLocal Guide·94 reviews·161 photos\nRated 5.0 out of 5,\nJust a #simple place to be at after a workout... @igymtoeatmore... More pictures on IG @drifterdrift and @igymtoeatmore\n\n",
        "Hui min Lee\n4 reviews\nRated 4.0 out of 5,\nEnjoyed my 60min foot massage here. Clean and pleasant place. My therapist was slightly chatty but friendly. Will be back.\n\n",
        "Alvin Chiao\n2 reviews\nRated 5.0 out of 5,\nI like green apple spa at both bridge road. Thumbs up for Owen! Very good\n\n",
        "Siew Hing Lam\nLocal Guide·500 reviews·1,356 photos\nRated 4.0 out of 5,\nGood service! Promo from Mon to Fri is very worth it but badly only during office hour. Hopefully it can be extended to after office hour too. Unlikely to see the promo make it to weekend, but no complaint about that.\n\n",
        "Raven Clive\nLocal Guide·65 reviews\nRated 1.0 out of 5,\nTerrible place most staff from Malaysia guys behaved and look like gangster.\nI heard the boss is doing money laundry according to the Malaysia staff working there. This spa just a cover up for his illegal business.\nThe Malaysia staff also mentioned the boss do not have any thoughts for the staff besides making money no welfare for staff... . Not surprising for a boss doing other illegal business. Well ah beng ah seng run business basically you know what to get.\n\n",
        "Ron Phipps\nLocal Guide·69 reviews·975 photos\nRated 4.0 out of 5,\nFor that deep tissue massage at any hour. Get a package for the best deal. Call ahead is recommended. Parking can be a challenge at certain times.\n\n",
        "Amos Chow\nLocal Guide·36 reviews·13 photos\nRated 5.0 out of 5,\nI love to go during weekdays cause they have promo during the afternoon! 1hour foot massage at $36! And the massage is of good quality\n\n",
        "Jodel Tan\nLocal Guide·33 reviews·100 photos\nRated 4.0 out of 5,\nDecent place for a good massage. Foot massage is good but Neck and shoulder massage can be improved. parking there can be a real challenge.\n\n",
        "jane sugar\n9 reviews\nRated 4.0 out of 5,\nAffordable massage ,  comfortable and cosy environment. Lots of rooms and this outlet had more tourists to visit. Please book inadvance.\n\n",
        "chaangru lee\n21 reviews·18 photos\nRated 5.0 out of 5,\nWas served by zhen zhen. Paid $82 for 90min and worth every cent. Thumbs up!\n\n",
        "Daniel Lee\n7 reviews\nRated 5.0 out of 5,\nExcellent foot massage with experienced masseurs. Reasonable pricing and opens late so very convenient to just drop in for a footie!\n\n",
        "Johann Pee\n7 reviews\nRated 5.0 out of 5,\nJust want to thank greenapple staff from the bottom of our heart. 28 oct was raining heavily and one of our friend fell and cut herself all over in the rain. Greenapple staff came out and were really nice to offer towels, umbrellas and even offered to help dry our clothes. Such kindness don't come by easily and we are very thankful to staff of greenapple to help us. Thank you!!!\n\n",
        "Shaun McEwan\n38 reviews\nRated 5.0 out of 5,\nAbsolutely the real deal. Incredible\n\n",
        "batman roger\n17 reviews\nRated 4.0 out of 5,\nGreat and strong massage. Can hear the cars from the road though.\n\n",
        "Lichan Cheah\nLocal Guide·347 reviews·269 photos\nRated 5.0 out of 5,\nFantastic place for a relaxing footrub and shoulder rub. Prices are decent and it's very clean. The recliner chairs are very comfortable\n\n",
        "Wilson Lim\nLocal Guide·27 reviews·25 photos\nRated 3.0 out of 5,\nMassage was more to hard rubbing and pressuring on sore muscle. Recommended if you are looking to remedy sores instead of relaxation.\n\n",
        "sharon chia\nLocal Guide·92 reviews·296 photos\nRated 5.0 out of 5,\nAffordable and the massage is really goooood. A walking distance fr Bugis mrt station. Around 10-15mins walk\n\n",
        "Malcolm Lim\nLocal Guide·90 reviews·3 photos\nRated 5.0 out of 5,\nExcellent massage..\n\n",
        "Charisse Sun Isip\nLocal Guide·93 reviews·132 photos\nRated 3.0 out of 5,\nDecent and clean place to get a quick massage. The masseurs are amateurs though.\n\n",
        "Gerald Sim\nLocal Guide·39 reviews·20 photos\nRated 5.0 out of 5,\nAmbient good, massage quality is uncompromised. Price is also reasonable.\n\n",
        "Fadzli Jay\nLocal Guide·19 reviews·6 photos\nRated 5.0 out of 5,\nConsistent great experience\n\n",
        "Edmond Ow Yew Tinn\nLocal Guide·64 reviews·72 photos\nRated 1.0 out of 5,\nNo skills. Bad massage.\n\n",
        "K F\nLocal Guide·52 reviews·2 photos\nRated 5.0 out of 5,\nGreat experience and friendly staff\n\n",
        "Ziliang Koh\n44 reviews·31 photos\nRated 4.0 out of 5,\nGood price 👍\nSome advice, do book an appointment.\nSomeday it will be quite pack.\n\n",
        "Kris Loh\n4 reviews·12 photos\nRated 5.0 out of 5,\nclean, nice environment, services standard high, pricing reasonable.\n\n",
        "Muhammad Saifuddin\n17 reviews·3 photos\nRated 4.0 out of 5,\nNot bad for vip\n\n",
        "Ee Chuan Kiew\nLocal Guide·27 reviews·52 photos\nRated 3.0 out of 5,\nHad my worst body massage ever here but the foot massages are good\n\n",
        "22 22\n1 review\nRated 5.0 out of 5,\nBeen supporting here for 3 year. Great front desk and nice massage skill from the masseur here.\n\n",
        "Dragoon MacKenzie\nLocal Guide·64 reviews·361 photos\nRated 4.0 out of 5,\nGot private room reserved for 5 of us , good service and clean environment. Opened until late hours.\n\n",
        "Fadly Aziz\n6 reviews·2 photos\nRated 5.0 out of 5,\nGood place to unwind.\n\n",
        "Shaun Teo\nLocal Guide·17 reviews·67 photos\nRated 5.0 out of 5,\nGood massages at a reasonable price\n\n",
        "Jeff Seah\nLocal Guide·131 reviews·155 photos\nRated 4.0 out of 5,\nGood foot reflex massage. Have movie screening but a little noisy as it's close to the reception counter\n\n",
        "Darren Koh\nLocal Guide·236 reviews·144 photos\nRated 3.0 out of 5,\nComfortable place for a foot reflexology session.  Not cheap but you too get a nice comfortable environment.\n\n",
        "Eddie\nLocal Guide·27 reviews·31 photos\nRated 5.0 out of 5,\nBest deep tissue or tuina massage in town.. But you need to be able to endure the pain..\n\n",
        "Desmond Teng\n42 reviews·25 photos\nRated 4.0 out of 5,\nGood foot massage. Never disappoint me.\n\n",
        "Choo Eric\nLocal Guide·83 reviews·251 photos\nRated 3.0 out of 5,\nMassage was ok. Place wasn't as clean as Emperor Spa.\n\n",
        "Vince Kerk\nLocal Guide·24 reviews·33 photos\nRated 4.0 out of 5,\nGood clean spa with foot massages and other spa services such as full body massages, ear candling etc.\n\n",
        "Amy Fang\nLocal Guide·59 reviews·34 photos\nRated 3.0 out of 5,\nParking is free after 10 pm. Massage is acceptable.\n\n",
        "Kayen Lim\n3 reviews\nRated 5.0 out of 5,\nExcellent body massage with the professional therapist\n👍will come back again👍\n\n",
        "kenneth chia\nLocal Guide·39 reviews·24 photos\nRated 5.0 out of 5,\nBeen open for many years and still a good massage place\n\n",
        "Kenneth\nLocal Guide·150 reviews·320 photos\nRated 4.0 out of 5,\nLate night spa that is open until 4am to get a decent massage\n\n",
        "Danny Wong\nLocal Guide·69 reviews\nRated 3.0 out of 5,\nPlace to relax...new shop looks good.\n\n",
        "Suet Tin Heng\n1 review\nRated 5.0 out of 5,\nTks Kelvin for the footmasssge... He's  very professional and well trained.. Tks again Kelvin 👍\n\n",
        "Nicole Cheong\nLocal Guide·29 reviews·5 photos\nRated 5.0 out of 5,\nMay gives an awesome massage! Always feel recharged afterwards.\n\n",
        "Yeo Eng Kiat\n32 reviews·6 photos\nRated 5.0 out of 5,\nGreat place for unisex massage\n\n",
        "Nicholas Thang\n43 reviews·22 photos\nRated 5.0 out of 5,\nNice and cosy place just that the road noise can be a bit disturbing\n\n",
        "HX Chew\nLocal Guide·77 reviews·28 photos\nRated 5.0 out of 5,\nDamm shiok for the leg massage u can watch movie while massaging cfm plus chop will go back\n\n",
        "김미래\n3 reviews\nRated 5.0 out of 5,\nOne of the best message place ever. (Personally prefer strong message) perfectly fit to my preference.\n\n",
        "BulbasauR BucK\nLocal Guide·46 reviews·2 photos\nRated 3.0 out of 5,\nThe standard of foot massage had dropped ...\n\n",
        "Sean Ho\nLocal Guide·90 reviews·595 photos\nRated 3.0 out of 5,\nThe girls here who massage is good\n\n",
        "Rayner Alexander\nLocal Guide·35 reviews·51 photos\nRated 4.0 out of 5,\nModerately priced good massage\n\n",
        "Hanif Hamzah\nLocal Guide·50 reviews·40 photos\nRated 4.0 out of 5,\nComfy and clean place. Good experienced masseus\n\n",
        "marvin Cheung\nLocal Guide·126 reviews·16 photos\nRated 3.0 out of 5,\na little pricey and the quality of massuer is really down to your luck!\n\n",
        "joseph chung\n3 reviews·1 photo\nRated 1.0 out of 5,\nThe staff really need more rest, working long hours under such conditions are not healthy.\n\n",
        "Teery\nLocal Guide·98 reviews·125 photos\nRated 5.0 out of 5,\nPowerful place to loosen tight muscle\n\n",
        "Aditi Das Patnaik\nLocal Guide·57 reviews·85 photos\nRated 4.0 out of 5,\nMassage services with a number of options in a clean environment\n\n",
        "charita sarda\nLocal Guide·75 reviews·14 photos\nRated 5.0 out of 5,\nHighly recommend for foot spa\n\n",
        "Nauman Shahid\nLocal Guide·48 reviews·71 photos\nRated 4.0 out of 5,\nThis spa is a relaxing place.\n\n",
        "Aht\nLocal Guide·125 reviews·119 photos\nRated 4.0 out of 5,\nGood massage\n\n",
        "Kelvin Chua\n4 reviews\nRated 5.0 out of 5,\nMassage was good\n\n",
        "lengkian\nLocal Guide·40 reviews\nRated 4.0 out of 5,\nGood services for good prices!\n\n",
        "Mohamed Suffi Sapuan\nLocal Guide·10 reviews·58 photos\nRated 4.0 out of 5,\nCozy and makes me lazy\n\n",
        "Moussa Dabo\n11 reviews·43 photos\nRated 5.0 out of 5,\nIt was perfect, clean and professional\n\n",
        "Sharon Lee\nLocal Guide·49 reviews·27 photos\nRated 4.0 out of 5,\nNice environment and good services\n\n",
        "Chiew Ha Lee\n1 review\nRated 5.0 out of 5,\nHave reached my request.\n\n",
        "Eun jang Lee\n9 reviews\nRated 5.0 out of 5,\nGreat\n\n",
        "Lian Wee Loo\nLocal Guide·64 reviews·23 photos\nRated 4.0 out of 5,\nVery good...\n\n",
        "Norhuda Jaffar\nLocal Guide·47 reviews·40 photos\nRated 4.0 out of 5,\nNice foot reflex\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6299 1555\">6299 1555</span>",
    "Website": "https://www.facebook.com/greenapplespa/"
}