{
    "Name": "HAN Dynasty @ Alexandra Village",
    "Products": null,
    "Address": "123 Bukit Merah Lane 1, #01-98, Singapore 150123",
    "Opening Hours": "Saturday 10am–10:30pm\nSunday 10am–10:30pm\nMonday 10am–10:30pm\nTuesday 10am–10:30pm\nWednesday 10am–10:30pm\nThursday 10am–10:30pm\nFriday 10am–10:30pm\nUpdated by business 1 week ago\nSuggest new hours",
    "Rating": "4.3\n102 reviews",
    "Reviews": [
        "James Swee\n1 review\nRated 5.0 out of 5,\nWent for a 90-min massage with my wife, and we got a 2-pax room to ourselves. Very professional masseuses, and reminded us of those good ones we used to frequent in China. Reasonable pricing for massages in SG so nothing to complain there.. definitely will go back there again if possible\n\n",
        "Hamizah Myra\n4 reviews\nRated 5.0 out of 5,\nWent with my boyfriend today and we were genuinely pleased! We requested for the couple room and got it easily. The area was super clean and cozy. The whole massage went smoothly and the masseuse were very nice and massaged well. Didn’t catch their names but thank you for the great service! Looking forward to come again.\n\n",
        "Anirudh Ajith\n3 reviews\nRated 2.0 out of 5,\nRecently tried to book in a new massage but no one is answering the call at 5pm in the evening. I'm surprised that there is still no online booking, and the reservations need to be via the call. The online website is unclear as it doesn't provide the clear details of the services provided. For example, coming from an Indian background, I have no idea what Ba Guan and Gua Sha therapy is. I had to look it up separately to understand the services being offered. Please add in the details of this so that people from all backgrounds can understand the services you're offering.\n\nLast time I visited was a while back. Over the phone, I had asked the receptionist of the differences in the services provided, but she didn't offer clear answers. I was also disappointed to find out that that the timing for the 4 in 1 massage couldn't be customised and had to opt for Swedish Massage instead. The room when I entered was still wet on the floor from the previous customer, which I didn't notice until I actually stepped on the water. I tried to indicate this to the masseuse but she didn't understand what I was telling her.\n\nThe massage in itself was good, but my experience was tarnished by these mistakes and I wasn't able to enjoy it as much. I came back because I had a good first time experience, but my second time wasn't as good. I'm hoping the service and the online portal improves in the future.\n\n",
        "James Swee\n1 review\nRated 5.0 out of 5,\nWent for a 90-min massage with my wife, and we got a 2-pax room to ourselves. Very professional masseuses, and reminded us of those good ones we used to frequent in China. Reasonable pricing for massages in SG so nothing to complain there.. definitely will go back there again if possible\n\n",
        "Hamizah Myra\n4 reviews\nRated 5.0 out of 5,\nWent with my boyfriend today and we were genuinely pleased! We requested for the couple room and got it easily. The area was super clean and cozy. The whole massage went smoothly and the masseuse were very nice and massaged well. Didn’t catch their names but thank you for the great service! Looking forward to come again.\n\n",
        "Anirudh Ajith\n3 reviews\nRated 2.0 out of 5,\nRecently tried to book in a new massage but no one is answering the call at 5pm in the evening. I'm surprised that there is still no online booking, and the reservations need to be via the call. The online website is unclear as it doesn't provide the clear details of the services provided. For example, coming from an Indian background, I have no idea what Ba Guan and Gua Sha therapy is. I had to look it up separately to understand the services being offered. Please add in the details of this so that people from all backgrounds can understand the services you're offering.\n\nLast time I visited was a while back. Over the phone, I had asked the receptionist of the differences in the services provided, but she didn't offer clear answers. I was also disappointed to find out that that the timing for the 4 in 1 massage couldn't be customised and had to opt for Swedish Massage instead. The room when I entered was still wet on the floor from the previous customer, which I didn't notice until I actually stepped on the water. I tried to indicate this to the masseuse but she didn't understand what I was telling her.\n\nThe massage in itself was good, but my experience was tarnished by these mistakes and I wasn't able to enjoy it as much. I came back because I had a good first time experience, but my second time wasn't as good. I'm hoping the service and the online portal improves in the future.\n\n",
        "Yuwen Chang\nLocal Guide·9 reviews\nRated 5.0 out of 5,\nMy massage place of choice. They offer consistent, good quality massages by skilled therapists at reasonable prices. An online booking platform would be great though!!\n\n",
        "Jim Faherty\nLocal Guide·305 reviews·728 photos\nRated 5.0 out of 5,\nI recommend booking in advance as it is a popular place, and for good reason: the welcome is warm, the atmosphere is tranquil and relaxing, and the massage therapists are strong, skilled and professional.\nI felt a bit cold during my massage but the therapist perceived it and offered to change the A/C temperature.\nI was served a nice hot cup of sweet ginger tea at the end. Very nice indeed!\n\n",
        "Gillian Lin\n16 reviews·23 photos\nRated 4.0 out of 5,\nGreat massage, nice and clean place.\nWas our repeat visit, first time was good, and this time we are even more lucky to have even better masseurs :) We had Dawn and Nicole this round.\n\n",
        "Anastasia Phang\nLocal Guide·11 reviews·19 photos\nRated 5.0 out of 5,\nWent for foot massage last week. It’s super comfy and clean. The masseur, Candice use the right strength.  Before they start, it has this herbal foot soak where you soak in for a while while they give a 5min shoulder massage. The chair is also comfortable which allows to be recline back. Now without JB to go to, I think I will patronise a bit more often especially after tense day wfh.\n\n",
        "Viv Lim\n2 reviews\nRated 5.0 out of 5,\nHad a great experience at Han Dynasty! Masseuse was highly skilled and hit all the right spots with right amount of pressure. Lovely ambience. Will definitely go back again.\n\n",
        "Cindy liu\nLocal Guide·9 reviews·19 photos\nRated 5.0 out of 5,\nAlthough my first experience was alright, I came here again for a second time hoping for a better experience. I must say that Annie has done a great job, and I thoroughly enjoyed the massage! Will definitely come back again :)\n\n-------------Previous review-----------\n3 stars for the service, attitude and ambience. The masseur was really nice and adjusted to my requests, however for some reason she just couldn’t hit my trigger points :/ the next morning when I woke up, the soreness in my neck got worse instead (and I know it’s not the kind of soreness that is normal after a massage)... It’s a shame because I really wanted to like this place given all the good reviews it had. I might or might not return for another try with a different masseur.\n\n",
        "Irene Loy\n1 review\nRated 5.0 out of 5,\nWent a few times with my husband, and each time our expectations were met. My hubby always visit them whenever he has tightness and aching on his calf from running, and each time, Annie manage to relief the tightness on his calf. Love the ambience and glad that linens are changed for each turnover. Always looking forward to visiting them!\n\n",
        "Joey Cxt\nLocal Guide·153 reviews·726 photos\nRated 2.0 out of 5,\nExpected great service because of the number of positive reviews online, and the printed reviews on the menu. But the masseuse was rather rude with her replies to me. Did not enjoy my massage as the masseuse was thumb-heavy making it uncomfortable. Would not return to this outlet in future.\n\n",
        "Jeanie Quek\n4 reviews\nRated 5.0 out of 5,\nBeen coming to this place for the past 4 years. Many masseuses have come n gone. At the moment my favorite is May, who’s frm Thailand. If you like massage done with hands n arms (vs elbow), she’s the one to get! She’s very polite n genuine, n motherly too! You can state your preferences or area of concentration before the massage starts, n she will surely comply very nicely. ☺️👍🏼\n\n",
        "Zhilin Chiam\nLocal Guide·61 reviews·34 photos\nRated 5.0 out of 5,\nChose the oriental body massage (90mins), it was painful but shiok. Lily was good and professional\n\n",
        "Naomi Li\nLocal Guide·20 reviews·8 photos\nRated 3.0 out of 5,\nCame here with my husband & my therapist Fiona is incredible! She uses a lot of strength & has good techniques to target your tight spots. Seems sincere & hardworking, would recommend for all to look for her.\n\nOn the other hand, the therapist for my husband was inappropriate. Kept making conversation even if it was clear we preferred to enjoy the service in silence. Also, she playfully slapped my husband’s feet when he cracked a joke which seemed highly inappropriate to me.\n\n",
        "Paul T\nLocal Guide·58 reviews·148 photos\nRated 5.0 out of 5,\nIf you like strong Thai Massage, look for masseuse May or Mindy. Really good authentic massage. Please tip her for her hard work if possible!\n\n",
        "July Pineapple\n1 review\nRated 5.0 out of 5,\nHad a persistent and nagging sore shoulder for several weeks and decided to come here a ‘ massage treatment.\n\nThe massage treatment was solid (10/10 rating) - good amount of pressure, firm stroke and laser like precision on where to focus on, not only for my shoulder but for my thighs and neck as well.\n\nDefinitely will be back again! This is one of the rare instance I think the value far exceed the price. At 55 this is a steal. Very tempted to invest in a package.\n\nAnd last but not least, my masseur name is May. Her massage was so good I just feel obligated to give her a shout-out here.\n\nThank you!\n\n",
        "IzaDora Pan\n12 reviews\nRated 5.0 out of 5,\nI left in awe, indeed over my expectation. Very nice warmth welcome at the receptionist, room given to me was huge with relaxing vibes. Massage therapist is from thailand, very professional, no sales talk, great massage with the right strength, very dedicated. What is more surprising was that after the ginger tea, i can go freely, no need to endure sales talk to sign packages. Feeling superb rejuvenated! Thank you ! 😍😍😉😉\n\n",
        "Carina Lim\n3 reviews\nRated 5.0 out of 5,\nPlace is clean. Receptionists are polite. My therapist, Alice is really good and dedicated in solving my body aches. My health has certainly improve under her care. Thanks Alice for help. 谢谢。你最棒！\n\n",
        "Arthur Bouvaist\n4 reviews\nRated 5.0 out of 5,\nI recently tried this place for the first time and will certainly come back, as it was a pleasant experience from beginning to end. I felt comfortable right from the moment I stepped in, with the nice deco and the cleanliness of the place. Then, my massage was done by a skilled therapist, who definitely knew what she was doing. The massage table was also comfortable with no discomfort on the forehead. Finally, there was a nice ginger tea served with a nice dessert. Given the competitive pricing for this, I think this is really worth it.\n\n",
        "ann huat koh\n2 reviews\nRated 5.0 out of 5,\nMassage service is good and value for money. Ambience and facilities are great as well! Highly recommended.\n\n",
        "Kimmy Xo\n6 reviews\nRated 5.0 out of 5,\nIf you want a mind blowing body massage, look no further this is the place to go! So happy I found my massage go to spot, have visited twice so far and both experiences were equally excellent. You will not find a better deal elsewhere with their Tuesday ladies promotion for the type of high quality masseurs they have. My favourite masseur is QiQi - her massage skills and technique really hits every sore and painful spot! Can’t wait to be back again!\n\n",
        "Antonia Hoetami\nLocal Guide·22 reviews·7 photos\nRated 5.0 out of 5,\nI just finished a body massage in this branch and immediately felt like I should write this review. Great massage, pressure’s just right. The therapist could speak better English than most parlors. The pace was rather slow but thorough. Nice touch after session, with the warm green bean soup and hot Chinese tea as refreshments.\n\n",
        "Phyllis Chew\n25 reviews·45 photos\nRated 5.0 out of 5,\nPaid a visit for the first time today because of the ongoing Sep promo for ladies and am really satisfied :)\n\nLady at the counter is polite. My masseuse (Fiona) constantly checked if I was in pain or wanted her to exert more strength. She also massaged only shoulders/back as per my request. Very professional and thoughtful service, will definitely return!\n\nAlso, they served ginger tea and a bowl of dessert after the massage 🍨 Location is also quite convenient, just a few steps away from “opp queensway shopping ctr” bus stop\n\n",
        "Harpal Singh\nLocal Guide·20 reviews·28 photos\nRated 4.0 out of 5,\nIt’s so nice to be here! The masseuse was so good that makes me feel really relaxed like all the pain I felt in my body was suddenly removed. Though I came here during the evening, their service is still good and their staffs are accommodating. Can’t wait to come back!\n\n",
        "Jupot Garcia\n2 reviews·2 photos\nRated 5.0 out of 5,\nRelaxing ambiance, value for money and great massage! It's out first time and we will definitely be back.\n\n",
        "Seah Seng Chye\n1 review\nRated 1.0 out of 5,\nWas told by the receptionist at the counter that I can only use the bathroom to bath  for 10 min only , and exactly 10 min the recept keep knocking on the door\n\n",
        "Kish Gonzales\n19 reviews·48 photos\nRated 2.0 out of 5,\n3 of us went to Han Dynasty (Alexandra) last night after reading all positive comments online, but our experience is not as good as what I’ve read online. During the process I always say ‘it hurts and make it softer’ but the pressure is all the same until the end of the massage. Though last night after the massage I still haven’t felt the pain, but today, I can’t even move properly as my whole body is aching as if I went to the gym and had intense exercise. My body is sore from shoulder down to my legs. Same sentiments with the other 2 who came with me last night. I went there for relaxation but didn’t receive a relaxing massage which is very disappointing.\n\n",
        "Chloe Sim\n8 reviews\nRated 5.0 out of 5,\nHad the most amazing body massage thanks to masseur Fiona! Environment is always clean and ambience is really soothing. The post-massage dessert is a nice touch :) Will definitely be back again!\n\n",
        "Lydia Lee\n3 reviews\nRated 5.0 out of 5,\nThis is my favourites place for a good strong body or foot massage. Tried a few of the massage therapists here and they are all skilful, professional and strong. S\nervice is excellent and I'm always given a bowl of dessert and the best ginger tea ever after each massage. Do remember to book in advance if you don't want to be disappointed.\n\n",
        "Anand prabhu\nLocal Guide·66 reviews\nRated 5.0 out of 5,\nBeen coming here for quite some time and I have to say that most of the therapists are really skilled. The place itself also helps you to relax as you get a body or foot massage. Worth for money as well.\nWill recommend for you were to call to make appointment before coming as it is quite a popular place.\n\n",
        "Alvis Yeo\nLocal Guide·29 reviews·64 photos\nRated 5.0 out of 5,\nI like about this place is the quietness and good service. The place is new and spacious.\n\nThe foot reflexology room that I was directed is a couple's room. You can relax and enjoy the session with your partner un-disturbed. TV & music in the room as well.\n\nThe Oriental massage is good. Masseur has the strength to get the job done professionally.\n\nTry it out if you are nearby and feedback your experience.\n\n",
        "Gil Cauthorn\n1 review\nRated 5.0 out of 5,\nBest massage of my life. Was in Singapore on business, but had headaches for days do to back pain. The masseuse was so good that I had to come back the next morning again before my flight. Expect excellent service and skilled profesional care.\n\n",
        "Ryan Ho\n4 reviews·1 photo\nRated 5.0 out of 5,\nWell renovated, modern and clean. Receptionist and massage therapist were professional and courteous. Went twice before and massage both times was excellent. Would recommend. Prices are value for money especially when there is a promo on.\n\n",
        "G T\n12 reviews·3 photos\nRated 5.0 out of 5,\nGreat massage this evening. Got all my knots due to wfh sorted out. I would say best massage place in Singapore.\n\n",
        "Nhu Nguyen\n3 reviews\nRated 1.0 out of 5,\nAbsolutely atrocious.\n\nBooked a massage well in advance via phone. Called again on the day prior to heading down and was advised that there was no booking, I had only been added to the waiting list notwithstanding they had my booking details.\n\nPathetic customer service.\n\n",
        "jeetender sindhi\nLocal Guide·299 reviews·179 photos\nRated 5.0 out of 5,\nThe place is amazing and the services rendered are out of the blue . I cannot thank Dawn the massaue enough for the excellent service provided . I just felt that I had lost half of my weight post the massage . It was a truly enriching experience . Go for it guys and each penny is worth it\n\n",
        "Sky Ain't Limit\nLocal Guide·267 reviews·415 photos\nRated 5.0 out of 5,\nVery relaxing ambience. The massuer is skillful and courteous, she really knows her stuff. The front line lady is hospitable also. I enjoyed the foot massage ($45). Would love to patron again.\n\n",
        "aradhana biradar\nLocal Guide·141 reviews·77 photos\nRated 4.0 out of 5,\nMake sure to make reservation, even if you plan to go late in the night. Good service, but not everyone speaks English so if you have problem areas for massage please Ensure you speak to the front desk and communicate to the masseuse. They offered us red bean sweet cuz we did not make reservation and had to wait for 30 mins.\n\n",
        "W.H LI\n1 review\nRated 5.0 out of 5,\nA clean and well decorated spa. Had a great session together with wifey...a much needed massage\n\n",
        "Fennie Yap\n3 reviews\nRated 5.0 out of 5,\nMy revisiting to HAN Dynasty! 👍👍👍👍👍\nI'll definately recommend to my friends.\nVery clean and cosy ambience, friendly front deks, reasonable price.\nMs Alice, thank you for skilled and professional massage and I felt relaxed and recharge!\n\nI love their homemade ginger tea and delicious desserts!\n加油! 你们很棒！↖(^ω^)↗\n\n",
        "Vincent Chong\n15 reviews·3 photos\nRated 2.0 out of 5,\nIt was my gf's first visit. On arrival, she was shocked that the shop did not bother to get her to fill in any indemnity form like other spa places would, nor bothered to ask her areas of concern. She asked to do gua sha, but the assigned masseur decided on her behalf that she was not suitable. There was no room for negotiation. To dissuade my gf from doing gua sha, the masseur proceeded to scrap my gf's back hard, without any accompanying oil nor cream applied during a gua sha.  My gf then asked about the indemnity form, and masseur got her to get dressed again (note: she has been asked to change out by now). Twice,masseur went into the room without permission, and left the door opened exposed to the corridor. A truly horrifying experience. Though the shop tried to make it up to her by sending anlyher masseur and having the countrt staff do thejr job properly, she was too scarred to contemplate a return trip.\n\n",
        "Tze Kiat Lee\n22 reviews·22 photos\nRated 5.0 out of 5,\nGreat new spa, rooms are so clean n well decorated. Massage was excellent, with nice background music that was so relaxing. Did 2hr massage with my GF, in a couple room.\n\n",
        "AT Enterprise\nLocal Guide·10 reviews·96 photos\nRated 5.0 out of 5,\nVery nice !!\nGood massage\nGood staff\nGood place\nGood price!!!!\n\n",
        "Eustacia Lin (Eus)\nLocal Guide·56 reviews·9 photos\nRated 3.0 out of 5,\nIf you need a massage in the middle of the night, you can come here. Opens till 3am daily. Prices range from $45 (discounted price after mid-night) to $65 (normal price with essential oil).\n\n",
        "Meng Jit Foo\n3 reviews\nRated 5.0 out of 5,\nVery good tuina. Masseuse had great strength and technique - will be back!\n\n",
        "April Chye\n6 reviews\nRated 5.0 out of 5,\nGreat service, masseuse adapted the pressure to my request and tailored massage well to my problem areas. Will definitely visit again!\n\n",
        "Sophie Wong (Soapyyyy)\n3 reviews·9 photos\nRated 5.0 out of 5,\nWent with my husband. The place is clean, relaxing ambiance. Massage comes with a bowl of warm dessert and tea. Would definitely come again.\n\n",
        "Konstantin Chigirev\nLocal Guide·17 reviews·8 photos\nRated 5.0 out of 5,\nNice atmosphere, cozy, professional massage. Immediately signed up for the next session a week later.\n\n",
        "Dol Chew\nLocal Guide·117 reviews·1,660 photos\nRated 5.0 out of 5,\nLove the skillfull therapists. One of my favorite massage place\n\n",
        "L2HfT\nLocal Guide·112 reviews·221 photos\nRated 5.0 out of 5,\nAbsolutely awesome!\nVery friendly staff and professional service.\nThe best massage I have ever had.\nThank you very much.\n\n",
        "Jah Sun\n14 reviews\nRated 5.0 out of 5,\nThe best massage place in the whole SG. And I've been too almost all of them\n\n",
        "Fei Fei Chiam\nLocal Guide·573 reviews·1,135 photos\nRated 5.0 out of 5,\nThis place offers Chinese style massages. I found my favourite masseurs here. Convenient to make appointment and flexible service hours.\n\n",
        "M Y\n13 reviews·2 photos\nRated 1.0 out of 5,\nVery bad. When I tried to make a reservation in English, they hung up suddenly.\n\nWe need to speak in Chinese if we want to have a conversation with them.\n\n",
        "Marc Robinson\n3 reviews\nRated 5.0 out of 5,\nExcellent- first Thai Massage. Ginger tea is amazing too.\n\n",
        "Anastasia Koltovich-Gao\nLocal Guide·38 reviews·213 photos\nRated 5.0 out of 5,\nMasseuses originally from China, Heilongjiang province. Ask for a herbal tea, what an amazing treat after hour of relaxing massage!\n\n",
        "Susan Tham\nLocal Guide·110 reviews·79 photos\nRated 5.0 out of 5,\nNice ambience. I didn't quite enjoy my massage cos I reckon I am used to the techniques at my often-go-to masseus.\n\n",
        "Janice Tang\nLocal Guide·36 reviews·34 photos\nRated 5.0 out of 5,\nDid a full massage after my full marathon and honestly it was one of the best massages\n\n",
        "Sandy Tan\n2 reviews\nRated 5.0 out of 5,\nLove their cleanliness across all their outlets, clean bed linen and towels. Other spas I shall not comment much.\n\n",
        "Deepak Ramamurthy\n5 reviews\nRated 5.0 out of 5,\nThe oriental massage was really great.. would definitely visit the place again.\n\n",
        "PY Yee\n3 reviews\nRated 4.0 out of 5,\nDesserts were great but foot massage was just so so.\n\n",
        "Amanda\nLocal Guide·18 reviews·10 photos\nRated 5.0 out of 5,\nNicole was professional and provided an awesome massage!\n\n",
        "Kok Hean Phua\n3 reviews\nRated 5.0 out of 5,\nVery nice ambience and skillful masseuses. Worth the visit.\n\n",
        "Sindy J\n2 reviews\nRated 1.0 out of 5,\nNo Visa card or any debit, credit allowed!  What a place !\n\n",
        "Arpit Agrawal\nLocal Guide·11 reviews·28 photos\nRated 3.0 out of 5,\nGood, but nor that relaxing. Language would be a huge issue if you don't know mandarin!\n\n",
        "Santhi Chigurupati\nLocal Guide·86 reviews\nRated 4.0 out of 5,\nLovely place.  Had a good foot massage here\n\n",
        "hyoungjun kim\nLocal Guide·135 reviews·55 photos\nRated 3.0 out of 5,\nquite calm but too strong massage service\n\n",
        "ankit singh\n1 review\nRated 1.0 out of 5,\nThe timing mentioned is till 3 AM...visited just now it was closed already....\n\n",
        "Venus Chan\nLocal Guide·98 reviews·742 photos\nRated 1.0 out of 5,\nI've provided a 5 stars review 3 months ago and it's still stand for the masseurs service. However, the service of your receptionists is getting worst these days.\n\nWhen I called between 10:30am - 10:50am to make appointments, it's hardly anyone pick up the phone and I have to Whatsapp masseurs to check availability.\n\nWhat really triggered me to write this was, I've made an appointment with Zii (finally someone picked up the phone), the receptionist said she would call me if Zii cannot come to work; Guess what? I only knew Zii was not able to make it till I physically walked in your shop as the receptionist cannot bother to call me. I cannot change to another masseur as she is the expert for prenatal massage\n\nYou really need to pick up your game in terms of customers communication, maybe investing in a digital solution for making appointment to reduce unnecessary human errors.\n\n*************************************************************************\nPrevious Review:\n\nSuper lucky to have the best masseur in walking distance. I have been with Alice for nearly two years, she is so magical and can always fix my back and neck tension precisely.\n\nThe hot brown sugar ginger tea is also authentic and effective, I feel all the humidity was sweated out from my body after drinking it with a good massage.\n\n",
        "andrew sim\n2 reviews\nRated 5.0 out of 5,\nnice ambience professional massues\n\n",
        "Tan Jacob\n5 reviews\nRated 4.0 out of 5,\nNice and clean environment.\n\n",
        "Abuja Munafik\nLocal Guide·35 reviews\nRated 5.0 out of 5,\nSuperb privacy and comfort\n\n",
        "Jeevan Kumar G\nLocal Guide·67 reviews·1 photo\nRated 5.0 out of 5,\nVery professional and relaxing\n\n",
        "HENRY TAN\nLocal Guide·541 reviews·3 photos\nRated 5.0 out of 5,\nNice\n\n",
        "Subash Krishnan\nLocal Guide·257 reviews·79 photos\nRated 5.0 out of 5,\nOkay\n\n",
        "jk jk\nLocal Guide·60 reviews·214 photos\nRated 2.0 out of 5,\nCommon\n\n",
        "Hr Mirja2030\n1 review\nRated 5.0 out of 5,\nIt's good place\n\n",
        "Brian Lum\n12 reviews\nRated 4.0 out of 5,\nFriendly staff\n\n",
        "lixiang quai\n5 reviews·2 photos\nRated 5.0 out of 5,\n(Translated by Google) Very comfortable environment ~ Very powerful masseur The technique is very good ~ I will take care\n\n(Original)\n非常舒服的环境~非常厉害的按摩师 手法很好~我会关顾\n\n",
        "Min Hua Thong\nLocal Guide·60 reviews\nRated 5.0 out of 5,\n(Translated by Google) Very jealous\n\n(Original)\n很👌\n\n",
        "川合敬子\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Juliana Ho\nLocal Guide·5 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Lawrence Tan\nLocal Guide·448 reviews·1,319 photos\nRated 5.0 out of 5,\n\n\n",
        "Zennen Ybanez\n2 reviews·4 photos\nRated 5.0 out of 5,\n\n\n",
        "Kah Heng Poh\n4 reviews·38 photos\nRated 5.0 out of 5,\n\n\n",
        "Lik Hwee Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jason Koh\n4 photos\nRated 5.0 out of 5,\n\n\n",
        "Gaeul Ok\n1 review\nRated 1.0 out of 5,\n\n\n",
        "Swarna Rekha\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jenn Chong\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Iskandar Hassim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Cynthia Choong\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "John\n7 reviews·1,206 photos\nRated 4.0 out of 5,\n\n\n",
        "Ke-Wei Huang\nLocal Guide·5 reviews·598 photos\nRated 5.0 out of 5,\n\n\n",
        "Sanghyun Noh\n6 photos\nRated 5.0 out of 5,\n\n\n",
        "Alex Chan\nLocal Guide·209 reviews·489 photos\nRated 4.0 out of 5,\n\n\n",
        "madam blueeyez\n12 reviews·27 photos\nRated 5.0 out of 5,\n\n\n",
        "WILBUR\nLocal Guide·12 reviews·85 photos\nRated 4.0 out of 5,\n\n\n",
        "D S\nLocal Guide·183 reviews·488 photos\nRated 5.0 out of 5,\n\n\n",
        "C.F. Wei\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Chern Wei Mah\nLocal Guide·23 reviews·7 photos\nRated 5.0 out of 5,\n\n\n",
        "Sunand Razu\nLocal Guide·65 reviews·11 photos\nRated 3.0 out of 5,\n\n\n",
        "Susan Goh\n11 reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6264 6366\">6264 6366</span>",
    "Website": "http://www.handynastyspa.com/"
}