{
    "Name": "HAN Dynasty @ Balestier",
    "Products": null,
    "Address": "221, #04-01 Balestier Rd, 329928",
    "Opening Hours": "Saturday 10am–12am\nSunday 10am–12am\nMonday 10am–12am\nTuesday 10am–12am\nWednesday 10am–12am\nThursday 10am–12am\nFriday 10am–12am\nUpdated by business 1 week ago\nSuggest new hours",
    "Rating": "4.1\n46 reviews",
    "Reviews": [
        "Kelvin Lee Thomas\nLocal Guide·35 reviews·25 photos\nRated 5.0 out of 5,\n$80 for 1.5 hours massage. Highly recommend Sandy for people who like pressure. She incorporates a bit of Thai style massage into her moves which leaves me extremely refreshed\n\n",
        "Ed Chua\nLocal Guide·18 reviews·20 photos\nRated 5.0 out of 5,\nVery good massage. A little bruised the day after though. My own fault that I tried to “take the pain”.   They did ask if it was too hard. I’ll definitely be back\n\n",
        "Lee Jeffrey\n5 reviews\nRated 5.0 out of 5,\nGot a 1.5hour oriental massage done by a massue name Fei Fei. She is skillful and systematic. Can try if you need someone with strength and skill. Imagine i am 90 plus kilograms and i can feel the pressure when she press on my stiff back.\n\n",
        "Kelvin Lee Thomas\nLocal Guide·35 reviews·25 photos\nRated 5.0 out of 5,\n$80 for 1.5 hours massage. Highly recommend Sandy for people who like pressure. She incorporates a bit of Thai style massage into her moves which leaves me extremely refreshed\n\n",
        "Ed Chua\nLocal Guide·18 reviews·20 photos\nRated 5.0 out of 5,\nVery good massage. A little bruised the day after though. My own fault that I tried to “take the pain”.   They did ask if it was too hard. I’ll definitely be back\n\n",
        "Lee Jeffrey\n5 reviews\nRated 5.0 out of 5,\nGot a 1.5hour oriental massage done by a massue name Fei Fei. She is skillful and systematic. Can try if you need someone with strength and skill. Imagine i am 90 plus kilograms and i can feel the pressure when she press on my stiff back.\n\n",
        "sati ravi shenkaran\n1 review\nRated 4.0 out of 5,\nthe masseuse really put in a lot of effort. went with my wife and the massage was really good, only that the front desk receptionist did not even care to pass/or tell us about the tea that was kept by the masseuse, maybe she was overwhelmed with tasks. Even then the receptionist when we went in did not seem to be cordial. so one star removed for that otherwise the masseuses' put in a lot of effort an its really worth the money\n\n",
        "Liyana Soh\nLocal Guide·63 reviews·61 photos\nRated 5.0 out of 5,\nMy husband and I visited this place for a one hour body massage, and it was heavenly. The session was painful but so effective that we had such a good deep sleep upon returning home. Even though the session was painful, I woke up the next day with no aches, which I usually experience if the masseuse doesn't know what they're doing.\n\n",
        "Polina\nLocal Guide·181 reviews·538 photos\nRated 5.0 out of 5,\nMy 1st visit to this salon and I loved it. Easy to make an appointment, staff speak English, clean, good price and quality. Ladies deal on Tuesdays is definitely worth it!\n\n",
        "V O\nLocal Guide·47 reviews·125 photos\nRated 2.0 out of 5,\nFirst time, massage was very light but cos its near our place, we decided to buy the package anyway.\nSecond time here, we requested for stronger masseuse and the massage is good this time.\nBut both times we find it unacceptable that the staff outside the room all speak very loudly, I am here to have a nap and rest but I was woken up several times because of their chatter. First time it was a local staff kept chattering in hokkein/teochew, this time is all the Chinese staff shouting back & forth like a market.\nThis is a massage place packaged to be spa like, customers are coming here to rest and relax not listen to all these market chatter about urine. If this doesnt improve we will not continue the package again.\n\n",
        "CX\n1 review\nRated 5.0 out of 5,\nClean and comfortable environment.\nGood session with Mindy and highly recommend. She's able to detect and apply strength on my pain spots / knots on my shoulders and back.\nThere's yummy dessert after the session too.\nP.s. session was done in Dec-2019.\n\n",
        "Emily Lie\n3 reviews·2 photos\nRated 2.0 out of 5,\nThe massage was great, but I cannot believe my eyes when the massues did not flush their toilet after use, and it's not just once but twice and in a few cubicles! I even saw 1 massue ran out of the toilet after use, without flushing the toilet and do not even wash hands! What if she's rushing to attend to a customer with dirty hands? This is totally disgusting, unhygienic and shocking! Especially in this times when Covid-19 is still spreading! I'm not sure if I wanna go back ever again even the poor hygiene level. (Ps. I gave 2 stars because the massue massage skill is good).\n\n",
        "ShaunL\nLocal Guide·36 reviews\nRated 4.0 out of 5,\nThis place looks even better after its renovations. The service here is good and lots of care is provided by the masseurs. The rooms have private showering facilities for customers and the environment is relaxing. In my opinion, the masseurs' skills are good and I would visit again.\n\n",
        "Terence Tan Mg\n2 reviews\nRated 5.0 out of 5,\nGreat place to have a good relaxing Massage the ambiance is fantastic. Brought my parents for 90min massage , Great Price Promo for Seniors 👍👍👍👍\n\n",
        "John Mahathir\n6 reviews\nRated 1.0 out of 5,\nWorst service i have paid for an $80 massage. Came here as a regular but to only realise masseurs always cut time 10 minutes before end of session. Measured time only from my last three visits to realise their clock in the massage room is 10 minutes faster. Felt so deprived wasting my $80 here. They think customers are rich and print money to come here. Please do not do not do not visit the balestier outlet.\n\nAfter the owner responded to me in this threat, they informed me to call their hotline because they wanted to investigate. After calling on 30th August, counter person informed me to call another number instead. Then why put your hotline number in the first place? Why not just give me the direct manager’s number? They also did not call me back. As spoken, I have went on 3 occasions before putting this one star review so please don’t bother “investigating”.\n\n",
        "Yuqing Zhao\n11 reviews\nRated 5.0 out of 5,\nthe therapists are really skillful and i really love their body massage. Xiao Min is very good! highly recommend\n\n",
        "PoTAto&Rice\n5 reviews\nRated 5.0 out of 5,\nExcellent Massage skill by Massuer Ting Ting . Friendly supervisor Apple . Good service ! Thumbs up !\n\n",
        "Ong Poh Lin\nLocal Guide·79 reviews·62 photos\nRated 4.0 out of 5,\nWas there for a 2hr massage when back fm climbing trip at Mt Huangsan in China.\nHad 经络 massage by Anna. Good techniques used by masseuse to ease those tired muscles.\n\n",
        "Alvin Ong\n1 review\nRated 1.0 out of 5,\nEven 1 star is too high for them. Bad experience, first & last time. TOLD doing massge for 2 or 3 of us, while waiting for another friend to reply, they gave away the two vacancies to walk in. Should have at least check with me again(I am just 5 m away from counter.\nWhen asked for someone, one of the staff look at me and just turn away......26/11/18 1 PM.\n\n",
        "Shine SSE\n5 reviews\nRated 5.0 out of 5,\nThis is an awesome place with good service from the moment you step into the premises. Value for money massage services.\n\n",
        "Jan\nLocal Guide·252 reviews·1,108 photos\nRated 4.0 out of 5,\nBeen here several times for both foot massages and body massages. Therapists are professional and skillful. Love the fact that they are open till wee hours of the night.\n\n",
        "Pae Yilin\n6 reviews·5 photos\nRated 4.0 out of 5,\nFriendly and polite staff. Massage was very comfortable and done in a very clean room with the right temperature!\n\n",
        "Colin lim\nLocal Guide·84 reviews·390 photos\nRated 5.0 out of 5,\nGood.\nMassage room and washroom are clean.\nTherapist very professional.\n\n",
        "Andy Teo\nLocal Guide·25 reviews·35 photos\nRated 5.0 out of 5,\nGreat decor, value for money massages. Definitely worth it.\n\n",
        "John Lek\n7 reviews·6 photos\nRated 4.0 out of 5,\nI went for their foot massage. The place is clean and service was goods. Price is reasonable.\n\n",
        "Benny Yuen\nLocal Guide·41 reviews·58 photos\nRated 5.0 out of 5,\nBest decent massage joint around and great for ppl with Long shifts\n\n",
        "Jinsang Jung\n1 review\nRated 5.0 out of 5,\nVery nice massage after golf.\n\n",
        "Kev Ow\nLocal Guide·12 reviews·3 photos\nRated 5.0 out of 5,\nStandard so much better after reno and change of management\n\n",
        "Lee Cheehooi\n5 reviews·1 photo\nRated 4.0 out of 5,\nGood body massage\n\n",
        "Raymond Karam (SJI)\n2 reviews\nRated 5.0 out of 5,\nSuper atmosphere with authentic decor.\n\n",
        "Bob Beashel\n1 review\nRated 1.0 out of 5,\nSOOOOOO BAD A COMPLETE RIP OFF NEVER VISIT THEY STOLE MY WALLET AND MY PHONE\n\n",
        "Mark\nLocal Guide·193 reviews·348 photos\nRated 1.0 out of 5,\nMassage like piano....\n\n",
        "poh chengji\nLocal Guide·17 reviews\nRated 5.0 out of 5,\nProfessional masseur and Receptionist\n\n",
        "Neeta R\n130 reviews·902 photos\nRated 5.0 out of 5,\nSuperb!! Very relaxing\n\n",
        "Julia J\n5 reviews·3 photos\nRated 4.0 out of 5,\n(Translated by Google) This is a great spa. I've been to a great spa twice. The second time I made an appointment with Julie who gave me a massage for the first time. She was great, the service was very good, and very caring! The second time I took the scrub, she suggested changing to a walking can, worrying that I would experience it\nInto the wind! She has 10 years of experience and the massage is in place! I really like it! Relieved my fatigue! Super relaxing the next day! I will look for her in the future! Highly recommend her!\n\n(Original)\n这是一个很棒的spa去过两次了，第二次是预约第一次帮我按摩的朱丽，她超级棒，服务很好，很贴心！第二次我拿了磨砂，她建议换成走罐，担心我身体会\n进风！她有10年的经验，按摩很到位！我超级喜欢的！缓解了我的疲劳！第二天超放松的！以后就固定找她了！强烈推荐她！\n\n",
        "Muhammad Azim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Galvin Shergill\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Zhang Yingying\nLocal Guide·15 reviews·55 photos\nRated 5.0 out of 5,\n\n\n",
        "Joseph Loy\n3 reviews·5 photos\nRated 5.0 out of 5,\n\n\n",
        "Paul Lee\nLocal Guide·4 reviews·49 photos\nRated 1.0 out of 5,\n\n\n",
        "lee johnny\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "jin han er\nLocal Guide·6 reviews\nRated 4.0 out of 5,\n\n\n",
        "Chong Tommy\n1 review\nRated 5.0 out of 5,\n\n\n",
        "bhadrinath ramachandran\n1 review·7 photos\nRated 5.0 out of 5,\n\n\n",
        "JIA WANG\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "feroze Anver\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "CHARLES CHUNG (Charles8107)\nLocal Guide·40 reviews·934 photos\nRated 5.0 out of 5,\n\n\n",
        "kim ah poh\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Steven Fong\nLocal Guide·54 reviews·2,072 photos\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6254 6466\">6254 6466</span>",
    "Website": "http://handynastyspa.com/"
}