{
    "Name": "HAN Dynasty @ Thomson",
    "Products": null,
    "Address": "3 Jasmine Rd, Singapore 576579",
    "Opening Hours": "Saturday 10am–10:30pm\nSunday 10am–10:30pm\nMonday 10am–10:30pm\nTuesday 10am–10:30pm\nWednesday 10am–10:30pm\nThursday 10am–10:30pm\nFriday 10am–10:30pm\nSuggest new hours",
    "Rating": "4.5\n72 reviews",
    "Reviews": [
        "Red Barker\nLocal Guide·347 reviews·1,888 photos\nRated 4.0 out of 5,\nVisited today with my partner to try their Couples Massage Promo currently running - Your choice of 90min massage, 2 pax. for $140++.\n\nThe Signature massages we both opted for were very good, firm but hit all of the spots perfectly. The two chinese ladies (Linda & Wei Wei iirc.) who took care of us were a bit chatty but remained professional throughout and were great.\n\nWe'll definitely be back in the future.\n\n",
        "Shawn Chew\nLocal Guide·46 reviews·47 photos\nRated 4.0 out of 5,\nThis is our first time visiting.\nLocation:\nQuite accessible by public transport (Upper Thomson Mrt) 6-8 mins walk once u alight from the MRT. Does have parking spaces for those who drives, but limited slots.\n\nAmbience:\nNot bad, gives you the feeling is a real place (clean) for massage and not those Hanky panky type.\nWe gotten a couple room, and there's attached standing shower along.\n\nMasseuses:\nProfessional, friendly, doesn't waste your time and the pressure point areas were spot on. 5 star from us. It's really worth the amount you spent.\nTotal damage: $80 per pax for 1 & 1/2 hr body massage (We opted for Oriental massage)\n\nLastly for customer service:\nWe will only give a 3 star, both ladies at the front counter not professional enough. Attitude wise is so so only, and their knowledge of their own services / products have more rooms for improvement.\n\nFor customers do take note that you will have to provide your NRIC when you fill up their forms. We wanted to put only the last 4 digit of our NRIC, but were told to state in the full. As their answers were, sometimes the police conduct checks.\n\n",
        "Jeff Jun\n1 review\nRated 1.0 out of 5,\nOn the 21st of August, my mum and I came down for a Swedish massage at 8.45pm. I was really looking forward to the massage as I have always had a really enjoyable experience here. However this particular time I was really really disappointed. The masseuse that was appointed to me was overly chatty and she had to ask if I was okay almost every 30 seconds. And it would be fine if the massage she had given was pleasant but that couldn’t be further from the truth. Not only was I not able to relax, I was also tempted to ask her to stop the entire session. This is by far one of the worst massages , if not the worst massage I have ever experienced. I was not able to get the name of my masseuse but she was a local woman aged probably around 50s to 60s. Really really disappointing.\n\n",
        "Red Barker\nLocal Guide·347 reviews·1,888 photos\nRated 4.0 out of 5,\nVisited today with my partner to try their Couples Massage Promo currently running - Your choice of 90min massage, 2 pax. for $140++.\n\nThe Signature massages we both opted for were very good, firm but hit all of the spots perfectly. The two chinese ladies (Linda & Wei Wei iirc.) who took care of us were a bit chatty but remained professional throughout and were great.\n\nWe'll definitely be back in the future.\n\n",
        "Shawn Chew\nLocal Guide·46 reviews·47 photos\nRated 4.0 out of 5,\nThis is our first time visiting.\nLocation:\nQuite accessible by public transport (Upper Thomson Mrt) 6-8 mins walk once u alight from the MRT. Does have parking spaces for those who drives, but limited slots.\n\nAmbience:\nNot bad, gives you the feeling is a real place (clean) for massage and not those Hanky panky type.\nWe gotten a couple room, and there's attached standing shower along.\n\nMasseuses:\nProfessional, friendly, doesn't waste your time and the pressure point areas were spot on. 5 star from us. It's really worth the amount you spent.\nTotal damage: $80 per pax for 1 & 1/2 hr body massage (We opted for Oriental massage)\n\nLastly for customer service:\nWe will only give a 3 star, both ladies at the front counter not professional enough. Attitude wise is so so only, and their knowledge of their own services / products have more rooms for improvement.\n\nFor customers do take note that you will have to provide your NRIC when you fill up their forms. We wanted to put only the last 4 digit of our NRIC, but were told to state in the full. As their answers were, sometimes the police conduct checks.\n\n",
        "Jeff Jun\n1 review\nRated 1.0 out of 5,\nOn the 21st of August, my mum and I came down for a Swedish massage at 8.45pm. I was really looking forward to the massage as I have always had a really enjoyable experience here. However this particular time I was really really disappointed. The masseuse that was appointed to me was overly chatty and she had to ask if I was okay almost every 30 seconds. And it would be fine if the massage she had given was pleasant but that couldn’t be further from the truth. Not only was I not able to relax, I was also tempted to ask her to stop the entire session. This is by far one of the worst massages , if not the worst massage I have ever experienced. I was not able to get the name of my masseuse but she was a local woman aged probably around 50s to 60s. Really really disappointing.\n\n",
        "Toh Tracey\n11 reviews·5 photos\nRated 5.0 out of 5,\nMy husband and I enjoyed our massage at Han Dynasty Thomson! Our masseuses (Wendy and Sheila) were receptive of our requests/comments rather than insisting on applying a lot of strength to \"loosen\" the tension which usually HURTS like hell afterwards. They applied adequate pressure especially on those parts which we highlighted have been aching. Overall good experience at affordable prices and the ladies at the counter were friendly and professional - No hard selling at all. This is very rare as most massage places I had visited in the past will always try to sell you their packages. The ambience was really relaxing too. Will visit again for sure!\n\n",
        "Vivian Jee\nLocal Guide·17 reviews·32 photos\nRated 5.0 out of 5,\nWas referred by a friend who visited the Balestier outlet twice. Decide to drop by walking in to the Thomson outlet last minute today. Receptionists were friendly and prompt in following the safety measures. They were knowledgable in their product/services since i was asking several questions on my first visit.\n\nDecided to try 60mins of their Oriental Massage with Add-on: Lavender Essential Oil @ $10 (Another alternative was the Lemongrass scent!) Paid a total of $65 NETT, which is quite decent and affordable as compared to other places. The new Thomson outlet was pretty much easy to locate. Its just a small walk from the mall exit near the starbucks. Straight down and you'll find the wall of the outlet with \"han\" flags on it. Kudos to my masseuse - Lili / Lily, a Vietnamese lady, was very friendly and receptive to my requests, making sure that I'm feeling comfortable and not in pain. She managed to loosen quite a few stiff knots on my neck, shoulders, and back. Will definitely patronise again, probably with my friend/fam!\n\n",
        "Kelvin Lam\n3 reviews·3 photos\nRated 2.0 out of 5,\nDecided to try HAN dynasty after reading their google reviews were generally positive. It was my friend’s birthday last friday so decided to treat her to a one hour massage.\n\nI did Swedish massage while she tried Meridian. I was attended by Gena and Melissa attended to my friend.\n\nGena was very very skillful and good. I could rest properly as the strength was right and she could tell i was tired after a long day of work and hence did not initiate chat with me. I appreciated that.\n\nHowever, my friend had a bad experience. My friend had a few bruises on her hand after the massage. Apparently, she told me melissa used her nails instead of fingers for the acupressure. She experienced sharp pain a few times during the massage but did not voice out as Melissa was very aggresive. She was blabbering non stop throughout the massage that my friend could not rest. My room was beside my friend’s, hence i could heard Melissa’s voice as well. She  was aggressively cross selling to my friend and even after the massage when we were at the counter. We didn’t expect that she would cross sell throughout the massage and even before we were about to leave the shop at the cashier.\n\nAnd i think one other thing that can be improved is drinks should be served to the guests after massage. We did not receive any drinks right after the massage - all we did received was cross selling by Melissa. I mean, come on, do you think we will sign up package with you after you used your nails to massage and caused my friend to have bruise, and talked + cross selling throughout the one hour massage? Hmmm…we were rather disappointed by han dynasty.\n\nThat being said, Gena is a good masseur. For those who is planning your visit to thomson outlet, please book Gena and avoid Melissa at all cost.\n\n",
        "c day\n7 reviews\nRated 3.0 out of 5,\nSaw dessert served under your review but didn't even have a cup of water served after a 90mins massage. Disappointed with the service and massage was just average.\n\n",
        "jia hui fong\n1 review·1 photo\nRated 5.0 out of 5,\nImpressive. Love their oriental massage as i love strong and hard massage. Will definitely return.\n\n",
        "Chan Wei De, Victor\n7 reviews\nRated 2.0 out of 5,\nMy fianceé and I visited Han Dynasty for the first time on 28 September 2020 as we’ve read many positive google reviews. We requested for 1.5 hours of Oriental/ Swedish massage which cost $160 for 2 pax.\n\nUpon arrival, we were greeted by the friendly reception staff. We were supposed to make payment prior to the session. However, reception staff was understanding and allowed us to make payment after the  session instead when we explained that we might consider signing a package. We were then ushered to our room. Room was clean and comfortable.\n\nMy fiancé and I did not enjoy our massage session as our therapists seemed to be inadequately trained. We have to agree with google reviews that the therapists were massaging very fast and we were unable to relax. Both our therapists were unable to accurately locate pressure points. We felt that the massage was very substandard. The company should re-look into the training of their masseuse.\n\nAt the end of the massage, we were served ginger tea and Chinese tea.\n\nThe friendly service of the reception staff and ambience were the saving grace.\n\nWe are avid lovers of massage but we felt the massage session was a complete waste of time & money. Overall, we left the place feeling disappointed. :(\n\n",
        "Steven Lin\n1 review\nRated 5.0 out of 5,\nVisited this shop on a weekday afternoon. Very nice ambience for its price tag. Massage is good. The best point of this shop is the cleanliness. The towels and bed do not stink of massage oil like many other shops. Will re-visit when the muscles ache again.\n\n",
        "M W\n17 reviews·8 photos\nRated 5.0 out of 5,\nHan Dynasty is my all time favourite place to go for a massage. The place is clean, the masseuse is good and the service is impeccable. Visited before and after covid and I must say it was already super clean before but they have even taken additional measures to ensure that the place is safe for patrons and masseuses. I've always had oil massage done and my hubby sports massage. We always leave the place feeling rejuvenated and a lot less tension. Thank you Han Dynasty!!!\n\n",
        "Heryadi Ngajeri\n4 reviews·18 photos\nRated 3.0 out of 5,\nAmbiance is good but masseuse not so friendly. Paid for an hour body massage with scrubs n essential oil but was told she has no time to scrub and can only use oil for massage. Can’t even speak English to explain to me.\n\n",
        "Eng Hwee Kang\n11 reviews\nRated 5.0 out of 5,\nSecond time here. Coincidentally got Milan again as my masseur. She's very skilled and not the kind who will force their opinions on you. The past few I went they kept saying I find it painful because my body is in a bad shape but for her she'll find other as to relieve the knots. Will definitely go back again!\n\n",
        "Ng CINDY\n8 reviews\nRated 5.0 out of 5,\nThis is my first time visit to Han Dynasty & it was beyond perfect. Did a foot reflexology and oil massage with them. Linda was really friendly and skilled. Would definitely recommend engaging her to do your massage! The centre is nicely designed & clean. 15/10!\n\n",
        "Vanessa\n5 reviews\nRated 4.0 out of 5,\nUPDATE: They apologised and invited me over. The masseuses they recommended this time were  most professional in their massage.\nMilan- Swedish and Angel- Oriental. I honestly would recommend you to look for them as i def feel good after the massage from them. They are also good with their service recovery as they showed that they are willing to listen to your feedback and act on it. Will be back to look for them again soon!\n\nPreviously: Front staff was nice and welcoming. All was good until my 2 masseuse came in to start the session for us. Upon hearing I prefer a gentle massage both of them were fighting over to massage me instead of my boyfriend.\n\nThe massage was not relaxing at all, the massage was very fast and I wasn’t able to relax  because she was doing it very fast.\n\nDespite both masseuse starting at the same time together, masseuse told the other lady to go off cause time is up. But the other lady replied “no, still got another 5 mins” after that she finish off w another 3-5 quick rubs and she left quickly while the one complete the massage.\n\nFeedback to their IG account but no follow up at all. Super service!\n\n",
        "Ahmad Hafiz\n3 reviews\nRated 5.0 out of 5,\nMy wife went for a 2 hour body massage and Amber was assigned to her as her masseuse. She commended on Amber's initiatives throughout the massage and she said it was the best massage of her life!\nShe felt rejuvenated after the massage and the pain at her neck and legs were gone.\nHighly recommend this place for their good service and awesome touch.\nShe will definitely be back for Amber's great service.\n\n",
        "Perry Mok\n4 reviews\nRated 4.0 out of 5,\nGood and value for money massage. Ivy was really good - strong but not over the top in terms of pressure. Highly recommended even though there are many other spas in the area.\n\n",
        "Mei Yun\nLocal Guide·23 reviews·46 photos\nRated 5.0 out of 5,\nMy favourite place to go for an foot massage and foot scrub. Massage was always great from different therapist , i always just sit back and relax because of the amazing massage each time\n\n",
        "Melissa Cookson\n14 reviews·9 photos\nRated 3.0 out of 5,\nHalf decent foot massage, it was just a shame that the masseuse was looking at the clock literally every 30 seconds during a 90 minute foot massage like she really didn't want to be there. Made the whole situation a bit uncomfortable.\n\n",
        "James Crs\n1 review\nRated 5.0 out of 5,\nI liked the surround atmosphere inside and enjoyed the massage done by masseur Ivy, who provided moderate strength and experienced skills when massaging, it really helps to relief my back and muscle pain, recommended to others!\n\n",
        "Cindy Sum\n3 reviews·1 photo\nRated 4.0 out of 5,\nThe assigned masseur could have been more deliberate in her strokes and thoughtful where she placed the bottle of massage oil during the massage. There were times where I would touch or hit the bottle as the masseur stretched me.\nI would have appreciated it more if there was a hair tie for Long hair and a mirror in the room for freshening up purposes. The water in the shower is not warm no matter how Long you wait for it. The ginger tea is good though. Overall, I left the place slightly disappointed.\n\n",
        "pjm5728\n12 reviews\nRated 5.0 out of 5,\nLoved the massage! They really welcome people of different races :) my masseuse was really skilled and since I couldn’t speak Chinese she asked the admin for help to check if the pressure was ok. Will definitely go back again.\n\n",
        "Zheng Hao Choo\nLocal Guide·11 reviews·132 photos\nRated 5.0 out of 5,\nVery efficient place with good service! We made appointments about 30 minutes before arriving and they were able to give us a slot without issue. Reception staff are quick and suggested add-ons without being pushy, which is much appreciated. Payment is made before the session which actually makes the flow much better when we finish.\n\nThe massage itself is pretty decent and the masseuse know what their doing. Ends off with a complimentary Ginger tea, Chinese tea, or honey drink. This is my second time, and will be returning to try the foot massage!\n\n",
        "Rachel Low\n1 review\nRated 1.0 out of 5,\nWorst massage I have ever gone for. My masseuse was rubbing so quickly that I could feel myself getting an abrasion. Asked to reduce the speed but after a short while returned to the same pace. This is the first time I actually sweat in a massage. Horrible experience, never returning.\n\n",
        "Amanda Fong\n2 reviews\nRated 3.0 out of 5,\nMassage was pretty good, perhaps 4 stars. Went for a 1.5hours massage. Receptionist showed me to the room and said masseuse will come in 2mins but she took 10mins to come, which is fine with me. But she came in at 4:15pm and massage ended at 5:35pm. Don’t think me it’s fair to me that she came in late but ended on time so I give it 3 stars.\n\n",
        "Lydia Lee\n3 reviews\nRated 5.0 out of 5,\nVery professional and they have strong massage therapists. Tried both the foot and body massages and they were all equally good. Place is clean and they make the best ginger tea! I like it that the place is not crawling with tourists and conveniently located next to Thomson Plaza with free parking!\n\n",
        "Fennie Yap\n3 reviews\nRated 5.0 out of 5,\nVery clean, nice ambience, resonable price, friendly staff. Masseur Ms Amy is good. There is noting can beat a good ginger tea and yummy dessert after a good massage :) will recommend friends and I am coming back again.\n\n",
        "Shin Wee\n6 reviews·5 photos\nRated 1.0 out of 5,\nThe place is new and hence it’s still clean. However, I would strongly suggest the owner to provide proper training and practice to all the massage therapist before allowing them to massage on any client.\nMy friend and I went to massage together and the massage strokes of both therapist were all not in the same order.\nmy friend had specifically asked to have a stronger pressure while massaging, the therapist did not practice her professionalism and cause blue black at her back the next day.\nThat’s not it, the most terrifying part is when the therapist used her FOOT to step on my friends’ NECK (Which is such a vital part of our body). Having tried many types of different massages, this is the first time we encounter therapist using foot to literally step on the neck.... I’m not sure if it’s something unique to this shop.\nWe later found out from the therapist that they have not undergone any training before hand.\nTo think back, the whole incident is terrifying....\n\n",
        "Shine SSE\n5 reviews\nRated 5.0 out of 5,\nExcellent service quality provided by the staff of Han Dynasty once again.\n\nLove their Swedish Massage. Will definitely visit again (:\n\n",
        "Luppy Productions\n3 reviews\nRated 5.0 out of 5,\nSuprising good. Skillful Masseur cured my sore backache. And the ambient of the place really nice. Unexpected. Rooms pretty big. Its because of the relax mood of the decor tats why i give it a 5 star.\n\n",
        "Jacqueline Chan\n9 reviews·1 photo\nRated 5.0 out of 5,\nNice and comfortable place. Massage was good. Used the ladies promo, value for money. Recommend to make an appointment instead of walk in.\n\n",
        "Miko Wong\n1 review\nRated 5.0 out of 5,\nClean friendly ambience. Therapist is strong！\n\n",
        "Micheal Goh\n3 reviews\nRated 5.0 out of 5,\nThe Ambient of the shop is fantastic and cosy.\nStaffs are friendly and helpful.\nTherapists are very professional and skilful.\nA place to recommend to relax.\n\n",
        "Alvin Thiam\n2 reviews\nRated 5.0 out of 5,\nEverything is Awesome!\nInterior and Ambience are tastefully decorated\nThe therapist are attentive and well trained in the art of delivering an energizing massage!\n\n",
        "Dave Low\nLocal Guide·28 reviews·18 photos\nRated 5.0 out of 5,\nNice massage environment with easy parking. Amber has very good massage skill and with good strength . Overall good experience.\n\n",
        "Kitty Lu\n2 reviews\nRated 5.0 out of 5,\nGlad to have found this gem of a place where i can relax in lovely ambience while getting a good massage for a reasonable price. Love the complimentary bowl of dessert after.\n\n",
        "Tiun Haou Ming\n2 reviews·2 photos\nRated 5.0 out of 5,\nTheir quiet surrounding is a great place for massage. Free carpark is another plus point. Need to try their dessert.,so good 😉\n\n",
        "kluey blue\n39 reviews·8 photos\nRated 5.0 out of 5,\nLove that the masseuse emphasize on massage strokes.Neck tension got rubbed away.I lurve their Swedish massage\n\n",
        "poh chengji\nLocal Guide·17 reviews\nRated 5.0 out of 5,\nWorth while value for money with incredibly clean big outlet. The atmosphere is relaxing with soft music in the background\n\n",
        "Morvan Tiun\n1 review\nRated 5.0 out of 5,\nApart from the decent massage, their rooms are spacious and I love the ambience!\n\n",
        "Anderlin Chung\n2 reviews\nRated 5.0 out of 5,\nGreat ambience and great service too! Had a relaxing massage there and will definitely go back again.\n\n",
        "Chenxi\n4 reviews\nRated 4.0 out of 5,\nHad a 1hr massage wit amber, was quite ok. Nice ambience.\n\n",
        "Andrew Wu\nLocal Guide·17 reviews·30 photos\nRated 5.0 out of 5,\nRelaxing and luxurious atmosphere. Masseuse had good technique.\n\n",
        "Joseph Loy\n3 reviews·5 photos\nRated 5.0 out of 5,\nNew place. Nice ambience. So clean. Good service. Tasty dessert. I am coming back again .\n\n",
        "Sandy Tan\n2 reviews\nRated 5.0 out of 5,\nNice location apart from their good acupressure massage. Free parking too, :)\n\n",
        "Leon Chua\nLocal Guide·48 reviews·4 photos\nRated 5.0 out of 5,\nGood service. Good massage. No problem with parking.\n\n",
        "Teery\nLocal Guide·98 reviews·125 photos\nRated 5.0 out of 5,\nIf a massage is what you require this is the place to be\n\n",
        "Timothy Tan\n1 review\nRated 5.0 out of 5,\nHad a great experience with HAN Dynasty @ Thomson! Will definitely return!\n\n",
        "Carl Pillay\nLocal Guide·144 reviews·13 photos\nRated 5.0 out of 5,\nNice! Clean! Great staff and reasonably priced.\n\n",
        "macky chong\n1 review·1 photo\nRated 5.0 out of 5,\nnice！\n\n",
        "Glen Low\n1 review\nRated 5.0 out of 5,\nGood environment with clean facilities and skilled professionals\n\n",
        "Tan Siew Ling\nLocal Guide·215 reviews·357 photos\nRated 3.0 out of 5,\nNice place and ambience\n\n",
        "Will Lee\n2 reviews\nRated 5.0 out of 5,\nW\n\n",
        "Pixie Koh\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) Thank you Linda for her advanced massage skills and attitude; I will ask you to serve me again next week.\n\n(Original)\n感恩Linda的高级按摩手艺和态度；下周再请您为我服务。\n\n",
        "Kah Heng Poh\n4 reviews·38 photos\nRated 5.0 out of 5,\n\n\n",
        "Jian En Ng\nLocal Guide·22 reviews\nRated 4.0 out of 5,\n\n\n",
        "Zhen Wei Ow\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Lidia Lim\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Jacqueline Chen\nLocal Guide·1 review\nRated 4.0 out of 5,\n\n\n",
        "Lester See\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Yap Yang\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Edmund Tan\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Mitchell Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Tan Henry\nLocal Guide·2 reviews·349 photos\nRated 5.0 out of 5,\n\n\n",
        "AGNES LO\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Vanessa Joseph\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Ronald Suwandi\n4 reviews·11 photos\nRated 5.0 out of 5,\n\n\n",
        "Patryk Starzecki\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "차지현\n5 reviews·8 photos\nRated 5.0 out of 5,\n\n\n",
        "Jia Qi\n1 review\nRated 5.0 out of 5,\n\n\n",
        "kevin portscher\nLocal Guide·7 reviews\nRated 5.0 out of 5,\n\n\n",
        "S S\n2 photos\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6265 6366\">6265 6366</span>",
    "Website": "http://www.handynastyspa.com/"
}