{
    "Name": "Healthland Pte Ltd ( Traditional Thai Massage  Oil Massage  Foot Massage )",
    "Products": {},
    "Address": "252A South Bridge Rd, 02-01, Singapore 058801",
    "Opening Hours": "Saturday 10:30am–10pm\nSunday 10:30am–10pm\nMonday 10:30am–10pm\nTuesday 10:30am–10pm\nWednesday 10:30am–10pm\nThursday 10:30am–10pm\nFriday 10:30am–10pm\nSuggest new hours",
    "Rating": "4.4\n79 reviews",
    "Reviews": [
        "Cheong Tien woi\n2 reviews\nRated 5.0 out of 5,\nTheir authentic thai massage fully relaxes the whole body and provides calmness and peace of mind to tackle the routine challenges of the next day. I have tried all of the young service providers and there was never a dull moment in each and every unique and pleasurable experience they make you feel. No doubt about it's fit for a king!\n\n",
        "Deborah Chan\n2 reviews\nRated 5.0 out of 5,\nCame here for 1.5hours thai massage, masseur was Tina. She's very professional and will check if I'm OK or if the strength is ok. She is very skillful and have equal strength for both hands. Great Thai massage in Sg!\n\n",
        "Victor Ma\nLocal Guide·82 reviews·1,703 photos\nRated 5.0 out of 5,\nDropped in here in the evening for a 60 min neck and back massage. It was excellent! I guess it was Thai style massage as I'm not used to being moved around a bit more, but I felt quite relaxed afterwards. Will definitely be back!\n\n",
        "Cheong Tien woi\n2 reviews\nRated 5.0 out of 5,\nTheir authentic thai massage fully relaxes the whole body and provides calmness and peace of mind to tackle the routine challenges of the next day. I have tried all of the young service providers and there was never a dull moment in each and every unique and pleasurable experience they make you feel. No doubt about it's fit for a king!\n\n",
        "Deborah Chan\n2 reviews\nRated 5.0 out of 5,\nCame here for 1.5hours thai massage, masseur was Tina. She's very professional and will check if I'm OK or if the strength is ok. She is very skillful and have equal strength for both hands. Great Thai massage in Sg!\n\n",
        "Victor Ma\nLocal Guide·82 reviews·1,703 photos\nRated 5.0 out of 5,\nDropped in here in the evening for a 60 min neck and back massage. It was excellent! I guess it was Thai style massage as I'm not used to being moved around a bit more, but I felt quite relaxed afterwards. Will definitely be back!\n\n",
        "Danny Lee\nLocal Guide·95 reviews·319 photos\nRated 5.0 out of 5,\nWonderful massage session with the masseuses very skilful. The 2 hours passed quickly and all the knots were soothed :)\n\n",
        "zvl joe\n8 reviews·2 photos\nRated 5.0 out of 5,\nThe therapist Esther. Great masseuse, great pressure and very polite. - Aroma Oil Massage\n\nJust did another session, this time with Tina. Amazing and dedicated masseuse. Amazing. - Thai Massage\n\n",
        "Elain Zheng\n2 reviews\nRated 5.0 out of 5,\nI love it! If you are craving for an authentic traditional Thai massage, this is your go to place. They have unique techniques that Is similar to what you would experienced in Thailand. Sarah did a great job and I will definitely return back for her. I was given a private room for full body massage. The room amenities and toilet was also very clean.\n\n",
        "QQ LN\n1 review\nRated 5.0 out of 5,\nThorough and high quality massage. Thanks Tina for being so accommodating, applying stronger pressure when I asked for it. My back and legs are thanking me very much rn!!!\n\n",
        "Richard Bradshaw\nLocal Guide·17 reviews\nRated 5.0 out of 5,\nAs a veritable massage connoisseur - my GF and I go once per week on the whole and we’ve been here ten years!! - I can say this is pound-for-pound best massage for us both. Super comfy and relaxed floor level beds, well air conditioned, airy, clean massage rooms to wind down in (they’ve avoided those grimey huge chairs or massage tables + face hole that most others opt for that makes the rooms feeL stagnant and overused). Importantly TALENTED masseuse that have obviously had good training and not just going through motions, really take care to make you feel relaxed. Super friendly service always seem to manage to fit us in to our preferred timings.\n\n",
        "Shilpa Varade\n3 reviews·2 photos\nRated 5.0 out of 5,\nI went for Traditional Thai massage today at Healthland Pte Ltd. This is by far the best Thai massage place I've experienced in Singapore. Good clean place, strong hands massage & very polite girls. Overall value for money. Reasonable price. Must visit\n\n",
        "Deming\nLocal Guide·387 reviews·1,000 photos\nRated 4.0 out of 5,\nNot sure whether it's related to the healthland in Thailand but the Masseur  I got is good! She used a number of techniques and really loosen up my muscles.\n\nOnly drawback is that while it is  more expensive than usual, you still have to share the room with 2 other customers. I couldn't really rest well due to a snoring customer next to me.\n\n",
        "Gerald Khoo\nLocal Guide·67 reviews·8 photos\nRated 5.0 out of 5,\nNice little place in the heart of Chinatown. Went with my 3 friends on Sunday, 16/8/2020 - 5 PM. Do remember to give them a call for an appointment prior to arrival. Otherwise, you may have to wait for a time slot.\nMasseurs were very well-versed in their massage, slightly different variation of your regular Thai massage which I really really appreciate. They target core areas like your legs and especially your back. They are also able to converse in both English and Mandarin. Room is basic but extremely clean with frequent sanitization. Bang for your buck. I will definitely return again if I need to release the knots in my body.\n\n",
        "Lingxiao Sun\n31 reviews·2 photos\nRated 5.0 out of 5,\nHaven’t visited this place for quite a while and dropped by this afternoon. Its service is getting even better! Feeling so relaxed now.\nIf you are in for a Thai massage in Singapore, look no further than this one.\n\n",
        "Jason Low\nLocal Guide·28 reviews·54 photos\nRated 5.0 out of 5,\nProfessional good massage which is on par or even better than the ones in Bangkok. Look no further, this is the place to book for a body massage.\n\n",
        "Alisha Bhowmik\n4 reviews\nRated 5.0 out of 5,\nBest Thai massage I've ever had. Better than any I've had in Thailand, even a place I was brought to by a local friend in Bangkok. They really know what they're doing. Absolutely amazing. Couldn't recommend it more. They also have a really soft bed to lay on. The price is good and the facilities are really nice too.\n\n",
        "Harvin Gill\nLocal Guide·57 reviews·17 photos\nRated 4.0 out of 5,\nVery unique way of massaging. Loved it. Although I wish they included hands massage in the full body massage. I felt like that was missing for a complete session. Also please be careful sometimes lower back area too much pressure is added. Otherwise I loved it!\n\n",
        "Solvere ATnT\nLocal Guide·45 reviews·359 photos\nRated 5.0 out of 5,\nThey are very clean, very tidy. Give you new quality mask at arrival and departure. Cleanse your hands, spray the room, stairs, guide rail at your departure. Malaysian did Thai massage better, more expert than all thai i met in Singapore, Thai main cities.\n\n",
        "jamie goulding\n17 reviews·1 photo\nRated 5.0 out of 5,\nI read the reviews beforehand. But wow! So happy to have picked this place. It’s calming and relaxing as soon as you walk in. Staff are very professional. The massages are incredible (cheapest option is 60 min Thai for $60). It was so worth it!\n\nThink I’ll be back every week for a treat. Thanks again! 10/10\n\n",
        "Dominik\nLocal Guide·131 reviews·5 photos\nRated 5.0 out of 5,\nGood routine and very relaxing. My favorite of the 5 places I tried for traditional Thai massage. I recommend the 90 min session.\n\n",
        "Larvin TAN 陈添彬\n1 review\nRated 5.0 out of 5,\nThis is my 1st time to have Thai massage in Singapore even I am local. Perfect! Very clean and professional! Don't worry, no dirty service. I love it very much. Highly recommendation. You can look for Adeline, she is quite professional.\n\n",
        "Bryan Lee\nLocal Guide·16 reviews·13 photos\nRated 4.0 out of 5,\nDid leg massage, the masseur was really distracted with the other customers and colleague, therefore ended up the same technique used was really repetitive and overused.\n\nOther than that, the atmosphere and coziness was not bad. I would recommend the body massage instead of their leg massage.\n\n",
        "Jacqueline Lam\n3 reviews\nRated 5.0 out of 5,\nOne of the best no-frills Thai massages I have ever had in Singapore. The masseurs are well trained. Highly recommended, will definitely visit again!\n\n",
        "I G\n11 reviews\nRated 2.0 out of 5,\nThere is nothing wrong with the place but massage was the worst I have ever had. I do a lot of messages but here I had to walk out. I allowed 40 min but then could not handle any more. Sweaty hands, no technique, no energy, no effort. I had zero affect on sore muscles. Clearly here they don’t train staff, don’t hire people who love and understand their profession and basically get away with customers who just like any massage.\nI was fully refunded so was treated fairly and with respect. It is possible that I was unlucky with a particular therapist but I doubt.\n\n",
        "Rosalie Andit\n1 review\nRated 1.0 out of 5,\nThey are not accepting with skin disease like PSORIASIS.They will turn you down and decline your appointment. They have no experience handling people with NON CONTAGIOUS SKIN PROBLEMS.They have atleast several good  massage therapist but not highly educated of who shall not to massage or massage. So, watch out if you have rashes, etc. They will let you feel discriminated.\n\n",
        "Benjamin Eigner\n20 reviews·8 photos\nRated 1.0 out of 5,\nI always go to thai massage when I have pain from doing intense sports. This time I went for knee pain. Any injury needs specific treatment and a good professional knows how to treat it. This time I got a regular massage, the exact same one as my wife next to me (she went fior relaxing massage). When I mentioned after a while that she nees to work on the trigger points that cause my pain she just said „everything fine with your knee“.\n\n",
        "Xinjia Li\n8 reviews\nRated 1.0 out of 5,\nReceptionist with poor integrity and no concern for female customer's privacy.\n\nWent in at 5pm on 7 Dec for a Thai massage and was asked to change in a store room. I was then led to a room with about 3-4 beds with no curtain partitions. I had been to heathland regularly over the last 2 years and always get a private room to myself. This was the usual practice for female customers and the common rooms were used mainly for male customers. Obviously I was shocked and I asked if they would expect more customers and if there may be male customers sharing the room. Yes was the answer to both qns. Obviously this was not what I am comfortable with (the top was just tied with a string and often come loose during massages). Then I asked why there was no mention of it when I was paying. They just said oh we are full if you want a private room you have to wait.\n\nWhat really gets me is that there is no mention of all this at the counter, before payment so that I could make an informed decision.\nSo I asked for an refund and also a manager's email so that I could let them know about this incident. I was passed a card by the receptionist which after I walked out realised had no email on it at all. I called the numbers on the card and also no one picked up.\n\nReally? Is this a coincidence or just an attempt to shut me up.\n\n",
        "前田 Maeda健策 Kensaku\nLocal Guide·29 reviews·42 photos\nRated 4.0 out of 5,\nMassage was excellent. Therapist was young but well trained.  I would like improvement in facility. No segregation, you are exposed to other guests even for okl massage and ventilation was too noisy.\n\n",
        "Christine Chou\nLocal Guide·63 reviews·148 photos\nRated 5.0 out of 5,\nMy masseuse was excellent! Lots of power coming from a small lady - id definitely return, esp for the price. It was 60 SGD for 60 min Thai.\n\n",
        "Sang Min Park\n1 review\nRated 1.0 out of 5,\nI used to take a massage in this shop and I loved this place. Because the quality of the massage and attitude of a staff was good in the average. But now they seem to expand the shop in another area such as bukitimah, which causes deterioration in the quality. The staff gave poor massage and chating with her collegue for the full time. I want her concentrated in the massage. I will not go there any more.\n\n",
        "georg bauer\n2 reviews\nRated 5.0 out of 5,\ngreat experience, thanks a lot. you helped me relax on a very busy trip, finding calm & peace on a hot & humid day\n\n",
        "Poon Wai Keong Leonard\nLocal Guide·18 reviews\nRated 5.0 out of 5,\nExcellent thai massage. Used an assortment of techniques to loosen the muscles and joints which I had never experienced before (even in thailand). Skilled and professional. Thumbs up!\n\n",
        "wing hong lam\nLocal Guide·24 reviews·163 photos\nRated 5.0 out of 5,\nDon't know about Thai massage but it was really good. Can't imagine how these girls have that much strength\n\n",
        "Namdev Sachathep\nLocal Guide·727 reviews·1,144 photos\nRated 5.0 out of 5,\nLittle bit more expensive then the typical massage in Singapore but worth it! Highly reminiscent of Bangkok and the original Healthland.\n\n",
        "Adrien Sulpice\nLocal Guide·47 reviews·26 photos\nRated 5.0 out of 5,\nVery nice massage, never pushing too much and asking if it's ok. Strongly recommend.\n\n",
        "Neo Qing Hao\n2 reviews·1 photo\nRated 5.0 out of 5,\nProbably the best Thai massage you can get in Singapore.\n\n",
        "Mohit Vatsa\nLocal Guide·159 reviews·355 photos\nRated 4.0 out of 5,\nGood Thai massage. Tried first time in Singapore. Will be back again.\n\n",
        "Chitrang Johari\n5 reviews\nRated 5.0 out of 5,\nOne of the better foot and shoulder massage you can get\n\n",
        "Yeji Choi\n2 reviews\nRated 1.0 out of 5,\nThe worst massage places I’ve been in Singapore.\n\n",
        "Ong Stephen\nLocal Guide·120 reviews·115 photos\nRated 5.0 out of 5,\nGreat experience. They’ve experienced masseur and I highly recommend\n\n",
        "Khai Hori\n1 review\nRated 5.0 out of 5,\nThe best 2 hours Thai massage out of Thailand!\n\n",
        "ヤマウチヒロタカ\n1 review\nRated 5.0 out of 5,\nVery good massage quality!\n\n",
        "W He\n2 reviews\nRated 1.0 out of 5,\nexpensive and like piano\n\n",
        "Bart C\n16 reviews·7 photos\nRated 5.0 out of 5,\nAmazing masage very professional\n\n",
        "sam tan\n3 reviews\nRated 5.0 out of 5,\ni went to bangkok and this is on par with it.\n\n",
        "henry bui\n5 reviews\nRated 5.0 out of 5,\nLike special Thai massage\n\n",
        "Alice Na\nLocal Guide·15 reviews·21 photos\nRated 5.0 out of 5,\nGood Good~\n\n",
        "Super Supeeres\nLocal Guide·246 reviews·3,518 photos\nRated 5.0 out of 5,\n(Translated by Google) Do you accept an appointment? Thank you.\n\n(Original)\nรับสมัคงานไหมครับ ขอบคุณครับ\n\n",
        "영만쌀\nLocal Guide·12 reviews·1 photo\nRated 1.0 out of 5,\n(Translated by Google) Rubbish massage\n\n(Original)\n쓰레기마사지 설렁설렁\n\n",
        "Shunya Kaneko\nLocal Guide·4 reviews·233 photos\nRated 3.0 out of 5,\n\n\n",
        "SeokJin Lee\n2 reviews\nRated 4.0 out of 5,\n\n\n",
        "simon fl\n25 reviews\nRated 5.0 out of 5,\n\n\n",
        "Lim HanLi\n1 review\nRated 5.0 out of 5,\n\n\n",
        "K Kotaki\nLocal Guide·37 reviews·209 photos\nRated 4.0 out of 5,\n\n\n",
        "Kristin Annexstad\nLocal Guide·104 reviews·181 photos\nRated 5.0 out of 5,\n\n\n",
        "Aurkarn V.\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Srikanth Sharma\nLocal Guide·34 reviews·15 photos\nRated 5.0 out of 5,\n\n\n",
        "Arjun Sarwal\nLocal Guide·44 reviews·11 photos\nRated 5.0 out of 5,\n\n\n",
        "Marzuk International Pte Ltd\n3 reviews\nRated 4.0 out of 5,\n\n\n",
        "Moritz Estermann\n17 reviews·27 photos\nRated 5.0 out of 5,\n\n\n",
        "유병호\n8 photos\nRated 5.0 out of 5,\n\n\n",
        "Joelle\nLocal Guide·20 reviews·106 photos\nRated 5.0 out of 5,\n\n\n",
        "Rabea Tegeler\n6 reviews\nRated 5.0 out of 5,\n\n\n",
        "hisarte sim\n2 photos\nRated 5.0 out of 5,\n\n\n",
        "간지남\n5 reviews\nRated 5.0 out of 5,\n\n\n",
        "Fabien DEBRAY\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Xiu Wen -\n2 reviews\nRated 4.0 out of 5,\n\n\n",
        "Wang Michelle\n1 review\nRated 4.0 out of 5,\n\n\n",
        "Robbie Green\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Angel tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Panuwat Jirapatsakul\nLocal Guide·20 reviews·89 photos\nRated 5.0 out of 5,\n\n\n",
        "Tan Sarah\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Maria Malin\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Kuan Pern Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Samuel Fang\nLocal Guide·15 reviews·23 photos\nRated 5.0 out of 5,\n\n\n",
        "Jason Chiang\n1 review\nRated 1.0 out of 5,\n\n\n",
        "Mizuki\n1 review\nRated 5.0 out of 5,\n\n\n",
        "jesse almond nono\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ramindu Senarath\nLocal Guide·4 reviews·32 photos\nRated 5.0 out of 5,\n\n\n",
        "yusk _\n1 review·4 photos\nRated 5.0 out of 5,\n\n\n",
        "Maciej Obremski\n10 reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "6221 3376",
    "Website": "https://www.healthlandspa.com.sg/"
}