{
    "Name": "Healing Thai Massage",
    "Products": null,
    "Address": "39 Jln Besar, Singapore 208802",
    "Opening Hours": "Saturday 10am–10:30pm\nSunday 10am–10:30pm\nMonday 10am–10:30pm\nTuesday 10am–10:30pm\nWednesday 10am–10:30pm\nThursday 10am–10:30pm\nFriday 10am–10:30pm\nSuggest new hours",
    "Rating": "4.4\n247 reviews",
    "Reviews": [
        "Gabrielle Chua\nLocal Guide·23 reviews·1 photo\nRated 5.0 out of 5,\nI've been visiting this massage place for about 4 years now, would go once a month, and I really love their services. I've always asked for M to do my massage as she's really good at it, the strength is just right and she's always able to help me relieve my aches. Would really recommend her if you're looking for authentic and good Thai massage!\n\n",
        "Riz Perreras\n10 reviews\nRated 1.0 out of 5,\nThe massage seems to be random massaging here and there. I said softer but the lady did not understand and continue giving really hard massage. I went with a friend and she feels the same way. Not worth the money and i came out the spa with more pain than when i came in. Not even worth a star.\n\n",
        "Doris Leung\n1 review\nRated 5.0 out of 5,\nTotally 5 stars. I usually go to chinatown for thai massage but they were fully booked so I decided to give this place a chance and no regrets at all!\nTheir style of thai massage is a combination of traditional thai and deep tissue - less twisting of your body but more pressing of your muscle. My masseuse is a thai lady and she gave a very strong massage which totally untied all my knots. I will for sure be back.\n\n",
        "Gabrielle Chua\nLocal Guide·23 reviews·1 photo\nRated 5.0 out of 5,\nI've been visiting this massage place for about 4 years now, would go once a month, and I really love their services. I've always asked for M to do my massage as she's really good at it, the strength is just right and she's always able to help me relieve my aches. Would really recommend her if you're looking for authentic and good Thai massage!\n\n",
        "Riz Perreras\n10 reviews\nRated 1.0 out of 5,\nThe massage seems to be random massaging here and there. I said softer but the lady did not understand and continue giving really hard massage. I went with a friend and she feels the same way. Not worth the money and i came out the spa with more pain than when i came in. Not even worth a star.\n\n",
        "Doris Leung\n1 review\nRated 5.0 out of 5,\nTotally 5 stars. I usually go to chinatown for thai massage but they were fully booked so I decided to give this place a chance and no regrets at all!\nTheir style of thai massage is a combination of traditional thai and deep tissue - less twisting of your body but more pressing of your muscle. My masseuse is a thai lady and she gave a very strong massage which totally untied all my knots. I will for sure be back.\n\n",
        "Pramod Nair\nLocal Guide·160 reviews·687 photos\nRated 4.0 out of 5,\nVisit here for no frills authentic massage. $60 for 60 mins is higher than average for the curtain partitioned massage beds.\nApparently the price hike by $5:is recent as I see a 4 month old review at older rates.\n\nOn the plus side it appears comparatively easier to just walk in or book appointments at short notice on most days as the have many therapists.\n\n",
        "Jaron Chua\nLocal Guide·381 reviews·2,437 photos\nRated 4.0 out of 5,\nSlightly pricey but they are professional masseurs. They have two choices; Thai/oil massage, or the aroma hot oil massage. Prices are as listed in the attached image.\n\nIt was painful during the massage but I felt relaxed afterwards. You may let the masseur know how much pressure to you prefer. However I gave only 4 stars as the masseur tend to press very hard on my bones. There was also a time when she was pressing hard on my spine that my legs felt numb.\n\nOtherwise, all was good. Will return if I am in need of a massage\n\n",
        "Mehar Dadhich\nLocal Guide·89 reviews·125 photos\nRated 3.0 out of 5,\nFor me personally this place was good as the massage was good. However, my wife had a bitter experience as her body started to ache as soon as the massage got over. Therefore, 3 starts!\n\n",
        "Scott HH\n1 review\nRated 4.0 out of 5,\nI paid 80 dollars for a 90mins oil massage therapy. The Thai masseur speaks English and get down to business. No time wasting and not rushing. She finished the massage at 90mins. The session is very good i must say compare to many other spa. she knows exactly what is required for the pressure points. The rooms are clean but a bit dated. That is what you will get. No frills. The receptionist at the desk is strict. Perhaps she can be more polite and friendly instead of only instructing customers i.e. hand sanitizer for cleaning your hands ; take off your shoes .etc. she should have said thank to  a few walk in customers including myself  which she didn't. I was observing when i was at the front desk waiting area. I could have rated them 5 stars. On a whole, it was a pleasant experience to me as the massage is good. No pushing of selling massage package or snake oil.\n\n",
        "Fiona Chin\nLocal Guide·15 reviews·24 photos\nRated 5.0 out of 5,\nSuper good massage, we had the traditional oil massage for 90 mins, the masseuse hit every pain spots and cracked my back. It’s really just exactly what I wanted and needed, thank you May! You are really great.\n\n",
        "HanJie Cheng\nLocal Guide·31 reviews·83 photos\nRated 1.0 out of 5,\ncounter staff was alright and that's it. I don't feel any lighter anywhere in the body. in fact I had to go for another round of massage the next day...\n\n",
        "Christian Branzuela\n3 reviews·1 photo\nRated 1.0 out of 5,\nWorst massage experience ever. The lady didn’t understand I needed a softer massage. I ended up feeling stressed instead of relaxed. I also need to take painkillers after due to pain. Not recommended for people who just want a relaxing chill massage.\n\n",
        "Ben\n15 reviews·1 photo\nRated 5.0 out of 5,\nNeed a professional massage? This is the place to go to! Decent pricing and the masseuse always does a great job! Clean place too!\n\n",
        "Jun\n4 reviews\nRated 1.0 out of 5,\nMostly painful when the masseuse press even after asking her to press softly. Not sure why the reviews give 4 stars.\n\n",
        "Krishnakumar Selvaraj\nLocal Guide·12 reviews·18 photos\nRated 5.0 out of 5,\nI feel good for their massage. I spend 60 dollar for one hour massage. No stressful. Feel better\n\n",
        "Upender Rao\nLocal Guide·45 reviews·17 photos\nRated 5.0 out of 5,\nMy fav massage spot. Good for family as well. Been going there for 10 years now.\n\n",
        "Jack Le\n3 reviews\nRated 5.0 out of 5,\nThis is always my go-to massage place. I've been visiting this place monthly to relieve my my muscle pain in shoulder, back and neck. I would recommend Jasmine as my favorite but other masseurs are also very nice. Thank you!\n\n",
        "Yashwant Aditya\n4 reviews·2 photos\nRated 4.0 out of 5,\nStaff are good and well trained. Frankly, my first experience was awesome but last one was definitely not..\n\n",
        "Jane 서현 Park\nLocal Guide·113 reviews·83 photos\nRated 2.0 out of 5,\nI had jasmine as my masseuse and she was so kind and strong. She tailors it according to where you feel more need for. It was so good i initially paid for 60 min and extended it to 90. Strongly recommend!\n\nEdit: went a second time, had a different lady and it felt like she was just going thru the motions instead of truly massaging. Didnt feel that great after paying a steep 75 dollars for 90 min. Waste of money and time\n\n",
        "Woo Cher Chong Joe\nLocal Guide·61 reviews·696 photos\nRated 5.0 out of 5,\n2nd time over period of 6 days to relief my super tensed muscle, from shoulder to calves. It's definitely a place to recommend.\nWill be returning for few more sessions to lessen especially tight calves which is affecting my walking normally.\n\n",
        "Catherine Chien\n17 reviews·1 photo\nRated 4.0 out of 5,\nNo frills thai massage - quality of the massage was high and the price was reasonable. The masseuse put her knees on my super stiff back and that helped loosen up the knots. Deco could be improved.\n\n",
        "Darryl Tok\n1 review\nRated 5.0 out of 5,\nHad a back pain this morning. So decided to try to this Thai massage after seeing many good review. Massage by a thai lady who knows how to speak chinese. Really good skill and my back pain all gone after 90 mins. Recommended to go. Will go back there  when having back pain again. Overall a very good experience. The price is reasonable as well. Can look for “M” if you wants to have a good massage to release your back pain.\n\n",
        "SYP Tan\n12 reviews·6 photos\nRated 4.0 out of 5,\nFirst visit was pleasant and Thai lady did a good job. To be honest this is one of the best Thai Massage in Singapore and price is reasonable SGD110 for 120 mins or SGD 75 for 90 mins. Will definitely come back again.\n\n",
        "Kevin\n15 reviews·3 photos\nRated 5.0 out of 5,\nLegit clean and good massage place.\nDoes a good job to ease my muscles aches and \"cracking\" / loosening my joints.\n\n",
        "Drew Goh\nLocal Guide·283 reviews·2,891 photos\nRated 5.0 out of 5,\nWas a little concerned that it's sleazy, but it's not (coz of the area)! The Thai auntie who did my massage cracked bones with her feet, and massaged away a lot of my soreness.\n\nShe would ask if a certain area needed more to relieve the soreness, though one minor downside was her trying to get me to do 90 mins instead of the 60. That said, the massage is superb. Waiting room is a little small and dingy, but the massage bed that I was assigned was clean.\n\n",
        "Shi Min Ng\nLocal Guide·113 reviews·612 photos\nRated 5.0 out of 5,\nProfessional and felt so much better after the massage! The back crack felt sooo good\n\n",
        "Kin Jun Lee (Iunius)\nLocal Guide·34 reviews·6 photos\nRated 5.0 out of 5,\nVery Confortable massage service. Highly recomended to visit\n\n",
        "* “‪Cho‬” *\nLocal Guide·241 reviews·35 photos\nRated 4.0 out of 5,\nAuthentic Thai doing massage. Generally good, just the environment abit rundown and no much privacy - can hear other pple talking and small space. Only shorts are provided.\n\n",
        "mel lee\n8 reviews\nRated 2.0 out of 5,\nCame for 60 min Thai traditional (no oil) massage on a public holiday. From reception to interior the place smells very strongly like moth balls. Was led to a table and expected to disrobe— I had to remind them I wanted no-oil massage, then after giving me clothes to change into they left me alone waiting for more than 5 minutes.\n\nSAFETY & COMMUNICATION: Masseuse spoke Mandarin and did not understand English, so when I had to inform to please not place body pressure on the metal plate I have in my forearm, we struggled to communicate. Later, she seemed to have weak understanding of technique or her own body form, as when she bent my leg to the side she went right for my spine not my hips— I thought alright, maybe it’s a style. Then switching to the left she seemed to have a different approach, and when pressing onto the joints to the side of my spine, laid her support hand directly on top of the center of my spine. I yelped in pain and seemed to surprise her. She couldn’t understand what I was reacting to. Her touch was intended well perhaps but was fierce and imprecise. At the end, when I took a few mins to recover myself (it was not yet a full hour), she came back after setting my tea outside again surprised, saying they needed to clear the room for the next customer. There are no customers waiting and there are other rooms available. Perhaps she’s only been trained to churn and burn?\n\nWill not return. According to other reviews there might be better experiences — my masseuse was Ying, who might work for people who aren’t that aware of their body and like this approach.\n\n",
        "Mei Yin W.\n4 reviews\nRated 4.0 out of 5,\nWent on 12 Jul afternoon, paid for oil massage. Wasn't informed by the receptionist that oil massage is unavailable. Until I was in the massage room, the lady covered me few layers of towel and press above the towel which I thought it was a warm up. Aft about 20 mins, I asked the massage lady whether there is oil massage, the lady told me oil massage is unavailable as per government's guidelines during covid period.\n\nAfter massage is done, my hubby in the next room came out and told me he had oil massage. So I was fooled by the receptionist or the massage lady...?\n\n4 star because the massage is still done well & hubby enjoyed it too.\n\n",
        "Kieran Hearley\nLocal Guide·41 reviews·8 photos\nRated 4.0 out of 5,\nPretty decent massage. Therapist was very skilled and when I said my shoulders needed work she 100% nailed it. Only reason I'm not giving 5 stars is due to the staff constantly talking throughout the rooms. It's quite off-putting when trying to relax. Otherwise really reasonably priced massage!\n\n",
        "Anika\n12 reviews\nRated 1.0 out of 5,\nWorst massage I've ever been to. The masseuse had incredibly long nails and dry callous hands which made it incredibly uncomfortable - basically scratching my entire body raw. Would not recommend or come back. Also very rough in style and rushed. I've been to hundreds of Thai massage places and this was the worst. Whenever you ask for softer hands, she would just laugh at you with the other ladies and wouldn't change her method. My body is sore and bruised. Terrible service. When I mentioned this at the end of the massage to the main lady running the business - she was too busy counting her cash at the til to even care. Poor service!\n\n",
        "Anand Subramanian\nLocal Guide·74 reviews·17 photos\nRated 4.0 out of 5,\nGreat place. Consistency changes with the masseuse but great nevertheless\n\n",
        "Harsh Vardhan\nLocal Guide·79 reviews\nRated 4.0 out of 5,\nLoved the ambience. Prices are OK. The masseuse Judy had strong hands and all the pressure points were taken care off. I no longer feel the stiffness in my lower back and shoulders. I tried catching a quick power nap as well :) but occasionally masseuse were talking within themselves hence that kept me awake. But overall a very good experience. The massage service is very professional and my masseuse seemed very experienced. Thumbs Up!\n\n",
        "mervin oh\nLocal Guide·21 reviews·37 photos\nRated 4.0 out of 5,\nMassage is solid but too pushy to extend time. Spoils the experience. Otherwise it's fine.\n\n",
        "Kelly Hall\nLocal Guide·73 reviews·141 photos\nRated 5.0 out of 5,\nMy mother and I experienced very relaxing massage is here. We were both treated respectfully and had our individual needs and requests met. The facility was clean, quiet, and provided for our privacy. I would highly recommend healing Thai massage.\n\n",
        "Bakhtiar Iskandar\nLocal Guide·2 reviews\nRated 5.0 out of 5,\nAll the masseuses are well trained and cater to your preference..will definitely recommend anyone looking for pure Thai massage...\n\n",
        "Karen Kupfer\n6 reviews\nRated 5.0 out of 5,\nExceptional thai massage with an exceptional masseuse. These women work hard everyday and yet they provide a high quality massage at each and every time. I gave her a tip, the price (90 mins = 75$ and available right away) is more than fair and the massage was really great. I would encourage tourists to always leave a tip, there is a lot of hard work and not always recognized. Thank you to the lady that made my day with this massage! Loved it\n\n",
        "Jambay D\nLocal Guide·95 reviews·35 photos\nRated 5.0 out of 5,\nSuperb massage. I was blown away by the quality and the authenticity of the thai massage. Reasonable price considering you are in Singapore.\n\nI was attended to by Ivy who was not only skillful but professional and always concerned if I was doing fine.\n\nWill be coming back again.\n\n",
        "Leimoon Manaw\n1 review\nRated 5.0 out of 5,\nRecommended by a friend to Healing Thai. Great experience. Felt really relaxed after the session, masseuse (Bella) applied the right strengths to where i felt tense. And i felt she really put in effort to her job making sure i feel relaxed through out the whole session. Will definitely come back again.. good job!!\n\n",
        "Singh Singh\nLocal Guide·193 reviews·105 photos\nRated 5.0 out of 5,\nIf u want a massage that will hit all the right spots and loose all ur knots and leave u feeling totally stress free. This is the place. I am visiting Singapore and I went there before our check in and fell in love the place and their services and customer care and they way they simply make u feel at home.\n\nTotal professionals with very experienced staff. Complete value for the money spent.\n\n",
        "Lauren Kate\nLocal Guide·44 reviews·24 photos\nRated 5.0 out of 5,\nHad a great Thai massage with Evon then stayed for a foot massage with Peter. Walked in and was able to get both appointments with minimal wait. Clean, comfortable place. Ginger tea complimentary! Highly recommend and would return if I were to have longer in Singapore!\n\nFriendly, efficient reception!\n\n",
        "James Bong\n10 reviews\nRated 4.0 out of 5,\nGreat place to enjoy Thai Massage without going to Thailand . Masseurs here very professional and the skill level is great. Now I miss the massage so much hope CB will end soon.\n\n",
        "Jennifer Lee\n19 reviews·6 photos\nRated 5.0 out of 5,\nI have never try thai massage in Singapore but this as good as it can get, comparing to Thailand. Very good pressure massage. I love it!\n\n",
        "Andy Low\nLocal Guide·121 reviews·11 photos\nRated 5.0 out of 5,\nThis is the other reasonably cheap and professional Thai massage parlours in Singapore, right before Loy Krathong Thai massage in Aljunied. The authentic Thai masseuses here are very skillful and mindful if you mention about existing injuries. The place is well-kept, clean and has a nice ambience. As someone who does sports regularly and is prone to soreness and muscular injuries, I find that the massages here really helped me in recovering. Highly recommended place!\n\n",
        "Nalaka Warnakula\n14 reviews\nRated 5.0 out of 5,\nWent to get a massage as I was having a stiff neck and sore upper and lower back. Price was reasonable, service was good and professional.\n\n",
        "Tom Drake\nLocal Guide·79 reviews·28 photos\nRated 5.0 out of 5,\nI have had 100s of Thai massages before (no exaggeration) and that was hands down the best one! Payed for 1hr 30m with Rse. She was from Thailand like the rest of the masseuses and was definitely very experienced. She applied hard/firm force and knew exactly what needed work. I feel like the 90 mins was the correct time needed to cover everything properly. I think what makes a good masseuse is that they can find your troubled spots without you telling them, and she did exactly that. 10/10\n\n",
        "Adil Moosajee\nLocal Guide·24 reviews·17 photos\nRated 1.0 out of 5,\nThis is one of the worst foot massage experiences.\nThe lady didn’t know her pressure points and was too old (no disrespect intended) to put right amount of pressure. She kept rubbing and hitting bone instead of muscle.\nExtremely saddened by this experience\n\n",
        "Thomas Sander\n6 reviews\nRated 5.0 out of 5,\nVery nice massage as always. Happy they finally open during CB phase 2. Safety measures in place for Covid-19 to ensure great and healthy experience\n\n",
        "Brijesh Bolar\nLocal Guide·128 reviews·294 photos\nRated 5.0 out of 5,\nI must say I am really impressed by their massage service. Good for family with professional masseuse service. I felt so good after the body massage that I actually gave a tip to my masseuse.\n\n",
        "David LIM\nLocal Guide·50 reviews·8 photos\nRated 5.0 out of 5,\nSecond visit. Massueur is Ivy. Right from the start, she got all the points of knot correct. The feeling of blocked lactic acid can't be described by my vocabulary but for those with tight aching muscles will know what I mean. Highly recommended!\n\n",
        "Martin Dietze\nLocal Guide·21 reviews\nRated 5.0 out of 5,\nExcellent. I came there with constant headache due to problems in shoulders and neck. After having seen the good ratings I made an appointment. Pleasant people and excellent work, also good value for money. Will sure go there again when in Singapore next time.\n\n",
        "Karin Feldkamp\nLocal Guide·85 reviews·110 photos\nRated 5.0 out of 5,\nAfter a 26 hour traveling across the ocean my back was twisted and hurting. A 90 Minute Thai massage for $75 Singapore dollars fixed it all. Very deep and healing. Fantastic\n\n",
        "Hans tu\nLocal Guide·151 reviews·322 photos\nRated 3.0 out of 5,\nEnjoy my massage there.\n\n",
        "Paul T\nLocal Guide·58 reviews·148 photos\nRated 1.0 out of 5,\nTo be fair the first time i went the massuese was pretty good. Subsequent massuese is bad, have had thai massages for years and this is not thai. Just random pressing here and there. Feels like no proper training. Asked counter for a refund after 10 minutes but was rudely rejected, saying that masseuse have 20 years experience. My first bad review on google, couldnt let this slide\n\n",
        "Zsoka Scurtescu\nLocal Guide·71 reviews·64 photos\nRated 3.0 out of 5,\nIt was ok, but I expected a bit more based on the reviews. It's clean enough, but could be cleaner. The ladies were nice. Mine was quite gentle, which I didn't mind, but my husband's was more strong/painful (in a good way), so it really depends on who you get.\n\n",
        "Eddy Ng\n4 reviews\nRated 5.0 out of 5,\nThis place gave me the best thai massage ever. My masseur applied sufficient force and awesome massage, my stiff muscles are gone. I will definitely revisit this place again and again. Totally awesome place.\n\n",
        "Francis Xavier\n5 reviews\nRated 4.0 out of 5,\nAuthentic Thai massage by real Thai.\n\n",
        "Olya olichka\n22 reviews·79 photos\nRated 5.0 out of 5,\nReally needed a good massage and this lady did such a good job!!!\n\n",
        "Joy Dsouza\nLocal Guide·48 reviews·127 photos\nRated 5.0 out of 5,\nVery nice and professional massage done here.  You heard it right only professional massage.  No extra. Please keep this in mind.\n\n",
        "Ris Thevan\n2 reviews\nRated 1.0 out of 5,\nI would not come here ever. The masseuse was a much older lady who was so rough and I kept telling her that she is massaging my bones. Not my muscle. Then she goes on to use her knees to place pressure on my back. I told her its too much and she started complaining in mandarin on how I was being difficult becoz I didnt want my bones massaged. Only for her to realize that I understood mandarin and she was stumped. Im left with a kink in my back now thanks to her.\nDefinitely going back to Sabaai.\n\n",
        "John Cheng\n11 reviews·6 photos\nRated 3.0 out of 5,\nThe room smelled slightly musty. The oil massage was quite gentle and relaxing, but I prefer it harder.\n\n",
        "Cindy Ow\n2 reviews·1 photo\nRated 5.0 out of 5,\nGood and decent place for massage. Parking can be a hassle though.\n\n",
        "Eva Kucich (MindFit)\n11 reviews·3 photos\nRated 5.0 out of 5,\nTrue Thai Massage\nIm, a big fan of Thai massage and, have been looking for an experience as i can find in Thailand. This place is that place. Simple arrangement, but effective and very skilful.\n\n",
        "C.Mahesh Reddy\nLocal Guide·53 reviews·118 photos\nRated 3.0 out of 5,\nI feel the last experience was best this time it was too bad the masseuse was in a hurry to finish I took 90 minutes see said completed at 75 minutes\n\n",
        "Larry Lam\nLocal Guide·40 reviews·75 photos\nRated 4.0 out of 5,\nGood traditional Thai and Oil Massage in Singapore. Very healthy and professional services! Open until 3 am every day!\n\n",
        "Yan Xiazak\n11 reviews\nRated 5.0 out of 5,\nFabolous experience- one of the best massages that I had. Very detailed oriented and very professional.Really amazing technique reachnes.\n\n",
        "Ivan Wong\nLocal Guide·37 reviews·14 photos\nRated 1.0 out of 5,\nCame with girl friend. Place is outdated and smells Indian. So much Indian and very dirty people, overheard them asking about unnecessary services. The shop should really put a sign to put off these people. Will never want to come back again.\n\n",
        "Keira Cheong\n13 reviews·6 photos\nRated 5.0 out of 5,\nThai operated massage parlour with great Thai masseuse. Great place if you are looking to loosen your stiff shoulders.\n\n",
        "Avijit Chowdhury\n16 reviews·3 photos\nRated 4.0 out of 5,\nSkillful. Thai massage should be done on floor, not elevated bed\n\n",
        "kristoffer batu\nLocal Guide·30 reviews·56 photos\nRated 5.0 out of 5,\nGreat massage place they know how to do the authentic thai massage without.. you know what i mean\n\n",
        "IOB Group\nLocal Guide·68 reviews·139 photos\nRated 5.0 out of 5,\nWhat a great massage and the lady was very gentle and accommodating she was also very friendly too... highly recommended\n\n",
        "TEO CALVIN\n76 reviews·16 photos\nRated 5.0 out of 5,\nVery Relaxing, environment is great and comfortable. Their massage are great and comfortable too.\n\n",
        "Sreekanth Reloaded\nLocal Guide·149 reviews·122 photos\nRated 5.0 out of 5,\nVery good massage. Affordable too.\n\n",
        "Caeren Loh\n1 review\nRated 5.0 out of 5,\nTheir massage is really professional. Worth to try!\n\n",
        "francis ng\n2 reviews\nRated 5.0 out of 5,\nVery good\n\n",
        "Denise Jaschke\nLocal Guide·106 reviews·127 photos\nRated 5.0 out of 5,\nGreat therapists. Super value for money. Very simple but clean ambience. Nothing fancy.\nI'll be back for more....\n\n",
        "nandeesh v\n5 reviews·2 photos\nRated 5.0 out of 5,\nRefreshing. The masseuse Mint has amazing skills to take your pain off.\n\n",
        "Nirmal Agarwal\nLocal Guide·128 reviews·26 photos\nRated 5.0 out of 5,\nThe place was OK.  But massage was good value for money. The place is for pure massage intrested people only.\n\n",
        "Axl Loon\nLocal Guide·34 reviews·25 photos\nRated 5.0 out of 5,\nDecent massage place\n\n",
        "meimeiong sh (siang hui)\n1 review·1 photo\nRated 5.0 out of 5,\nGood massage skills! Affordable price.\n\n",
        "Unmukt Yatree\n14 reviews\nRated 5.0 out of 5,\nTherapist working here are generally Gems, value for money place to go to.\n\n",
        "Karthik Mani\nLocal Guide·140 reviews·31 photos\nRated 5.0 out of 5,\nThe massages are really good.  Would recommend Ivy and June.\n\n",
        "Daniel Hutchinson\nLocal Guide·68 reviews\nRated 4.0 out of 5,\nA little too rough for my liking. If you want a vigorous massage this is the place to beat you into shape.\n\n",
        "Mahamad Ali\n9 reviews\nRated 5.0 out of 5,\nGood massage for both Men and Women .. Traditional Thai massage os vefy nice\n\n",
        "SirJuan\nLocal Guide·251 reviews·142 photos\nRated 4.0 out of 5,\nReally nice massage very well. needed\n\n",
        "Joan Tam\n2 reviews\nRated 4.0 out of 5,\nHave a great massage with Lena today\nGreat service I luv it when my knuckles being cracked\n\n",
        "Azhar Ismardhi Ismail\nLocal Guide·16 reviews·22 photos\nRated 5.0 out of 5,\nExcellent massage. Always coming back to ease my pain or tiredness\n\n",
        "Kevin Lim\n3 reviews\nRated 5.0 out of 5,\nSo far the best skilled Thai masseuse I have in Singapore.\n\n",
        "yee\n6 reviews\nRated 5.0 out of 5,\nBest Thai massage in Singapore.. Look for lena\n\n",
        "Arshan Hussain\nLocal Guide·25 reviews\nRated 5.0 out of 5,\nBeen going there for 9 years ...amazing massage. Try lina  and eng eng\n\n",
        "Dave C\nLocal Guide·77 reviews·17 photos\nRated 4.0 out of 5,\nRelax and enjoy a authentic body massage no cheap tricks or services 🤣🤣\n\n",
        "Mirul\nLocal Guide·45 reviews·28 photos\nRated 5.0 out of 5,\nBeen here plenty of times. Great massage, friendly people in there..\n\n",
        "Prasanna Ravindran\n7 reviews·5 photos\nRated 5.0 out of 5,\nIt was excellent and the atmosphere was Greta . The perosnnel were very experienced and great at their work .\n\n",
        "Subramaniam Nuresh\n1 review\nRated 4.0 out of 5,\nQuite pricey but worth it. Will definitely come back and recommend to others.\n\n",
        "Amber Gomaa\n2 reviews·2 photos\nRated 5.0 out of 5,\nClean place, kind people and amazing massage!\n\n",
        "Mr Keat\n3 reviews\nRated 5.0 out of 5,\nGood !\n\n",
        "Joe Goghan\nLocal Guide·9 reviews\nRated 5.0 out of 5,\nPerfect Thai massage.  Very clean and professional\n\n",
        "Kalaiarasu Ramesh\n3 reviews\nRated 5.0 out of 5,\nAmazing massage.. nice ambience..\n\n",
        "Hit U\nLocal Guide·283 reviews·1,813 photos\nRated 5.0 out of 5,\nEnjoyed nice Thai massage with reasonable price.\n\n",
        "Sunny Mohawk\nLocal Guide·361 reviews·88 photos\nRated 5.0 out of 5,\nBest massage place offering truly healing massages\n\n",
        "Kate Hedman\nLocal Guide·39 reviews·6 photos\nRated 5.0 out of 5,\nProfessional, laid back, and excellent. Feels like you're in Thailand. Sabai dee!\n\n",
        "Enis Anas\nLocal Guide·17 reviews·70 photos\nRated 5.0 out of 5,\nGreat massage. Must try the hot oil.\n\n",
        "POSITIVE PERUMAL K\nLocal Guide·123 reviews·478 photos\nRated 5.0 out of 5,\nClean, Hygenic, Good Pressure Massage - non sexual ...\n\n",
        "sabari A\n25 reviews\nRated 5.0 out of 5,\nVery good place, good care, experienced staff. Value for every dollar spent.\n\n",
        "Mohd Azreen\n1 review\nRated 5.0 out of 5,\nBest massage by Thai ppl itself\n\n",
        "Mohammad AlHaris\nLocal Guide·79 reviews·127 photos\nRated 4.0 out of 5,\nThis is an Authentic Thai Massage with no stupid things done here.\n\n",
        "JOE SHEEN CHEN\n1 review\nRated 5.0 out of 5,\nThere was a confirmed case on June 23. Take care～\n\n",
        "Francis Djubo\nLocal Guide·85 reviews·9 photos\nRated 1.0 out of 5,\nPolite people but the therapy is not that good it gave me muscle cramps & hurt me on my shoulders\n\n",
        "Min Jin\nLocal Guide·193 reviews·166 photos\nRated 5.0 out of 5,\nAffordable pricing while incredible massages\n\n",
        "Rebecca Chang\n14 reviews\nRated 5.0 out of 5,\nGreat service and enough force to loosen up my shoulders.\n\n",
        "Olivier Puyraud\nLocal Guide·144 reviews·115 photos\nRated 4.0 out of 5,\nNice place for a traditional Thai massage\n\n",
        "Som Shekar\n6 reviews\nRated 5.0 out of 5,\nGood Genuine Thai Massage\n\n",
        "Pavan Kumar\nLocal Guide·230 reviews·297 photos\nRated 4.0 out of 5,\nVery professional and decently priced.\n\nQuite relaxing.\n\n",
        "Dominik\nLocal Guide·132 reviews·5 photos\nRated 5.0 out of 5,\nVery solid and low price.\n\n",
        "Anne Kang\n3 reviews\nRated 5.0 out of 5,\nVery effective\n\n",
        "Sohail Inayatullah\nLocal Guide·153 reviews·42 photos\nRated 5.0 out of 5,\nSometimes ok. Sometimes outstanding. Clean place.\n\n",
        "Kala Lurve\n6 reviews\nRated 5.0 out of 5,\nBest massage in Singapore!\n\n",
        "Charon Rai\n5 reviews\nRated 4.0 out of 5,\nVery good\n\n",
        "Ravi Shankar\n1 review\nRated 5.0 out of 5,\nVery pleasant and authentic.\n\n",
        "Leefang Chong\n2 reviews\nRated 1.0 out of 5,\nGood\n\n",
        "서헌덕\nLocal Guide·92 reviews·28 photos\nRated 4.0 out of 5,\nWorth for its price\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6294 0139\">6294 0139</span>",
    "Website": "http://www.healingthaimassage.com.sg/contact-us"
}