{
    "Name": "Jia Kang Foot Reflexology",
    "Products": null,
    "Address": "2 Havelock Rd, #01-29, Singapore 059763",
    "Opening Hours": "Friday 11am–8pm\nSaturday 11am–8pm\nSunday 11am–8pm\nMonday 11am–8pm\nTuesday 11am–8pm\nWednesday 11am–8pm\nThursday 11am–8pm\nSuggest new hours",
    "Rating": "4.9\n36 reviews",
    "Reviews": [
        "Lay Ling Koh\n1 review·4 photos\nRated 5.0 out of 5,\nJohn is extremely professional and approachable. In fact I personally believe he's the best foot masseur in Singapore. I've been diligently patronising his foot massage services and found him to be extremely spot on with problem areas. He always apply the right pressure and manages my pain point very well over intelligent and humorous conversations. Foot reflexology is a discipline which can be reflective of the level of health, wellness and lifestyle. He displays depth of knowledge when encountering any problem areas and I found his advice to be very useful. 10-Star treatment at affordable prices!!\n\n",
        "YouTube Addict\n5 reviews·1 photo\nRated 5.0 out of 5,\nIt's always a great experience at Jiakang! Frankie and John are very seasoned and always manage to ease all our knots and tension. Prices are very reasonable as well :)\n\n",
        "Linzer Yeo\n1 review\nRated 5.0 out of 5,\nJohn is sincere and straightforward in his service to the customers. He was present at the moment when he’s doing the massage and was so on point pressing all the acupressure points with the right pressure. The place is clean too!  Recommend to give it a try. Will come back again def!:)\n\n",
        "Lay Ling Koh\n1 review·4 photos\nRated 5.0 out of 5,\nJohn is extremely professional and approachable. In fact I personally believe he's the best foot masseur in Singapore. I've been diligently patronising his foot massage services and found him to be extremely spot on with problem areas. He always apply the right pressure and manages my pain point very well over intelligent and humorous conversations. Foot reflexology is a discipline which can be reflective of the level of health, wellness and lifestyle. He displays depth of knowledge when encountering any problem areas and I found his advice to be very useful. 10-Star treatment at affordable prices!!\n\n",
        "YouTube Addict\n5 reviews·1 photo\nRated 5.0 out of 5,\nIt's always a great experience at Jiakang! Frankie and John are very seasoned and always manage to ease all our knots and tension. Prices are very reasonable as well :)\n\n",
        "Linzer Yeo\n1 review\nRated 5.0 out of 5,\nJohn is sincere and straightforward in his service to the customers. He was present at the moment when he’s doing the massage and was so on point pressing all the acupressure points with the right pressure. The place is clean too!  Recommend to give it a try. Will come back again def!:)\n\n",
        "CN\n1 review\nRated 4.0 out of 5,\nI found this place through recommendation and decided to try out their foot massage.\n\nMy heart warms when I step in this place.\n\nFoot reflex service was great. Not too strong, just nice and not out-to-kill-you ouch.\n\nYan enjoyed the foot bath and hope to try out head, neck and shoulder massage on my next visit.\n\nKeep up the good service and don't forget requirements for Safe Management Measures at the workplace.\n\nYou have yan continual support.\n\n",
        "Yoomia Sim\n6 reviews\nRated 5.0 out of 5,\nIt's my second time returning to see John. I receive sports massages regularly to maintain / relax my muscles from all the travelling and performing I do. I am very picky with who I go and see. I must say John is one of the best massage therapist I have had so far, true professional, he uses acupressure points and he is very knowledgeable. I am returning back in five days to receive another treatement from John when I am back in Singapore. Highly recommend this place.\n\n",
        "Kim Welter\n1 review\nRated 5.0 out of 5,\nMy husband and I are from Luxembourg and we go annually to Singapore for family visits.  One of the \"must\" for both of us is to go to John Woo for body/ foot massages.  During our visit to Singapore, we shall try to go as often as possible to benefit from the massages.  John Woo is really very professional in his massages, he knows which reflex points to massage to get the best results.  He also know the level of strength to use during the massages : to bring out the best satisfaction without causing too much pain.  Itis highly recommendable for everyone, whether as locals or as tourist visitors, to get his massages, as a form of relaxation for the whole body or foot.  Wished we have someone like him here in our country!\n\n",
        "Areti Alexandrou\nLocal Guide·212 reviews·300 photos\nRated 5.0 out of 5,\nAmazingly effective and relaxing massage. Excellent service and feel like brand new again after the session. They understand injury, pain management and gave excellent advice. Don’t go anywhere else, just come here and enjoy Singaporean massage!\n\n",
        "Penny Green\n4 reviews\nRated 5.0 out of 5,\nWhilst on holiday we found this gem of a place and returned three days in a row to have foot massages.  It was fantastic, lovely atmosphere, great foot bath followed by amazing massage.  John is professional and very knowledgeable about what he does, we highly recommend anyone to visit.  The only disappointment is that we didn't find this place at the beginning of our holiday, so we could enjoy everyday after lots of walking.  Thank you John.  See you next time we are in Singapore.\n\n",
        "Ng Siew Seng Peter\n1 review\nRated 5.0 out of 5,\nJia Kang was introduce by a friend due to my suffering of nerve pains on my left leg. Met John there, he was helpful and kind to attend to my problem. After a few weeks felt much better and strongly recommend to others like me with this problem!! Soothing and great environment!!! Price was reasonable too!! Will continue to support John at Jia Kang.\n\n",
        "Rachel Toh\nLocal Guide·7 reviews·37 photos\nRated 5.0 out of 5,\nThank you for the great massage!! I could feel that the masseuse knew what he was doing as he really pressed the right acupunctural spots so relieve the tension I was holding in my body. Cheers, will definitely go back :) price also not too bad!\n\n",
        "Shin Miya\n1 review\nRated 5.0 out of 5,\nJust walked-in and a foot massage here.\nThe place is relaxing and nice but moreover the foot massage was really good - comfortably strong pressure and smooth. Will surely come back again\n\n",
        "David Yeo\n3 reviews\nRated 5.0 out of 5,\nGreat foot massage, good pressure targeted at the right points!\n\n",
        "Nur Muhammad\n2 reviews\nRated 5.0 out of 5,\nBeen a regular of Jia Kang for over a year.\n\nFoot reflexology is great, with the right amount of pressure aiming at the tired muscles and tight knots.\n\nDo give Jia Kang a try!\n\n",
        "Minette Norman\n1 review\nRated 5.0 out of 5,\nAfter a 16-hour flight from San Francisco to Singapore, I had the pleasure of an hour foot reflexology massage by John Woo. He has an amazing ability to know every spot that needs attention and asked several times if it was too much pressure. I left feeling both energized and relaxed and slept like a baby that night. I wish he worked in SF so I could have a weekly treatment!\n\n",
        "Alex Ho\nLocal Guide·72 reviews·70 photos\nRated 5.0 out of 5,\nDecided to do foot reflex since I have some spare time before my dinner appointment at Clarke Quay. The place is really nice, and I started my session with a nice aromatic foot bath, then foot reflex and back massage! Will definitely come back for massage in future! Thanks!\n\n",
        "Florence Leung\nLocal Guide·37 reviews·11 photos\nRated 5.0 out of 5,\nGreat massage! Release my back knots and neck sprain. Thanks John!\n\n",
        "beatrice baciu\n17 reviews·3 photos\nRated 5.0 out of 5,\nThis place was great for me! They do real Taiwanese foot massage, one of the few places on my Asia trip that know how to do this. John was great!\n\n",
        "Alessia Loreley Ombrella (alessialoreley)\nLocal Guide·57 reviews·61 photos\nRated 5.0 out of 5,\nVery welcoming people and the massages are very relaxing. Also the mall is very quiet and it makes the session more enjoyable. I recommend this place to anyone who needs to have a massage!\n\n",
        "Xiao Xiao\nLocal Guide·41 reviews·34 photos\nRated 5.0 out of 5,\nThe place is clean and homey. Staff are friendly. The massage was great. I would definitely go there regularly if I live here.\n\n",
        "kee kok goh\n2 reviews\nRated 5.0 out of 5,\nJohn Woo has been my regular foot reflexologist for many years!!! He is great at getting the foot acupoints!!!\n\n",
        "Toh WZ\nLocal Guide·43 reviews·6 photos\nRated 5.0 out of 5,\nVery good massage provided for a reasonable price\n\n",
        "Ben Fly Tan\nLocal Guide·342 reviews·295 photos\nRated 5.0 out of 5,\nOk. No nonsense.  Clean . Small. By appointment.\n\n",
        "Jai Musunuri\n1 review\nRated 5.0 out of 5,\nJohn is very skilled, I highly recommend!\n\n",
        "Yvonne Gee\nLocal Guide·183 reviews·38 photos\nRated 5.0 out of 5,\nAmazing really hit the mark. Friendly and knowlageble. So relaxed right now.\n\n",
        "Owen Bolton\n1 review\nRated 5.0 out of 5,\nBest Reflexology in Singapore\n\n",
        "Mark David\n38 reviews\nRated 5.0 out of 5,\nGreat\n\n",
        "Karen Kan\n1 review\nRated 5.0 out of 5,\nFriendly staffs and great service!\n\n",
        "Ada Hung\n4 reviews·1 photo\nRated 5.0 out of 5,\n(Translated by Google) I have clicked on so many rooms in Singapore. I really recommend this one. The master is not sloppy and clicks every place carefully. The pressing is in place. It is comfortable and easy to press. It is really worth recommending👍👍👍👍\n\n(Original)\n在新加坡按過這麼多間，這間我真的很推薦，師傅不馬虎每個地方都仔細按，按的很到位，按完舒服又輕鬆，真的很值得推薦👍👍👍👍\n\n",
        "Nur Nazirah\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Mengyu Sun\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Dennis Lim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Shivani Retnam\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Hiroki Sano\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "박상원\nLocal Guide·6 reviews·5 photos\nRated 5.0 out of 5,\n\n\n",
        "Yuki Liu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Skyhawk J\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "9476 9723",
    "Website": "Info is not retrievable"
}