{
    "Name": "Kyoto Spa Foot & Body Massage",
    "Products": {
        "Foot Massage": "$50.00",
        "Hot stone Massage": "$88.00",
        "Body Massage": "$60.00"
    },
    "Address": "5 Binjai Park, Singapore 589820",
    "Opening Hours": "Saturday 10am–10:30pm\nSunday 10am–10:30pm\nMonday 10am–10:30pm\nTuesday 10am–10:30pm\nWednesday 10am–10:30pm\nThursday 10am–10:30pm\nFriday 10am–10:30pm\nSuggest new hours",
    "Rating": "4.7\n41 reviews",
    "Reviews": [
        "Kennerve Ong\n6 reviews·3 photos\nRated 5.0 out of 5,\nEase of making appointment via WhatsApp.\nWeekdays Early Bird Promo! - Sure enough, I visited on a Monday morning for Oil Body Massage.\nEnvironment’s cleanliness is beyond my expectation.\nDisposable shorts were used – hygienic.\nInitiative to give more attention to pain points and relieve my stiff lower back – customer centric.\nWould like to try Hot Stone Massage the next time :)\n\n",
        "Jorgen Law\n3 reviews\nRated 5.0 out of 5,\nGreat and comfy atmosphere which elevated the experience, making it even more relaxing.  The massage was good, the masseur having good technique and control over the amount of strength put into the massage.  Overall an excellent experience and I would definitely be back again.\n\n",
        "Soong Su-Lin\n4 reviews\nRated 2.0 out of 5,\nHad to wait for 15 minutes past my scheduled slot even though I was on time. Massage was not symmetrical - masseuse massaged the left and the right side of my back and right and left leg differently. No technique at all.\n\n",
        "Kennerve Ong\n6 reviews·3 photos\nRated 5.0 out of 5,\nEase of making appointment via WhatsApp.\nWeekdays Early Bird Promo! - Sure enough, I visited on a Monday morning for Oil Body Massage.\nEnvironment’s cleanliness is beyond my expectation.\nDisposable shorts were used – hygienic.\nInitiative to give more attention to pain points and relieve my stiff lower back – customer centric.\nWould like to try Hot Stone Massage the next time :)\n\n",
        "Jorgen Law\n3 reviews\nRated 5.0 out of 5,\nGreat and comfy atmosphere which elevated the experience, making it even more relaxing.  The massage was good, the masseur having good technique and control over the amount of strength put into the massage.  Overall an excellent experience and I would definitely be back again.\n\n",
        "Soong Su-Lin\n4 reviews\nRated 2.0 out of 5,\nHad to wait for 15 minutes past my scheduled slot even though I was on time. Massage was not symmetrical - masseuse massaged the left and the right side of my back and right and left leg differently. No technique at all.\n\n",
        "Sophia Yip\n2 reviews·1 photo\nRated 5.0 out of 5,\nClean room with soft ambience. The massage is good and service is professional. Reasonably priced too!\n\n",
        "Jeff Lee\n2 reviews\nRated 5.0 out of 5,\nVery cosy atmosphere which elevated the whole experience,  The massage was good, the masseur was well trained,  good technique and strength throughout the massage.  an excellent experience and I would definitely be back again.\n\n",
        "Francesca Lau\n1 review\nRated 5.0 out of 5,\nWent to this spa after reading the reviews, great experience, excellent massage and good ambience too. Value for money. Love the soothing music and almost sleep throughout the massage.\n\n",
        "Stephanie Mong\n3 reviews\nRated 5.0 out of 5,\nBest experience ever! Had back pain before came in. After massage my back was recovered and whole process is relaxing. Very good ambience and professional therapist! Thank u for ur great service. Will definitely recommend my friends over to try your services. Highly recommend !\n\n",
        "Gary Tan\n1 review\nRated 5.0 out of 5,\nVery cosy spa to relax for a day. Excellent massage by linda, impressed by her strength and friendly, reasonable price and nice ambience. Strongly recommend.\n\n",
        "Jack Lam\n1 review\nRated 5.0 out of 5,\nVisited yesterday. Professional massage skills. Highly recommended if you need a good massage to relax your mind and body!\n\n",
        "Marcus Kee\n2 reviews\nRated 5.0 out of 5,\nExcellent massages at this neighborhood  spa . Clean n spacious room. Strongly recommended for ppl who seriously looking for a good massage .\n\n",
        "Linda Ng\n1 review\nRated 5.0 out of 5,\nVery cosy spa to relax for a day. Excellent massage , reasonable price and nice ambience. Strongly recommend.\n\n",
        "Clara\n2 reviews\nRated 1.0 out of 5,\nWorst experience ever! No massage points at all. It is not even a massage. It is just someone spreading oil on your back and that’s it! Counter staff keep hard selling! Please do not ever go here.\n\n",
        "Cindy Lim\n5 reviews\nRated 5.0 out of 5,\nWonderful massage by this therapist, Linda . Attentive and skilful . Nice ambience and inexpensive menu . Strongly recommended.\n\n",
        "Myra Chung\n11 reviews\nRated 5.0 out of 5,\nThe service staff went all out to help us execute the most memorable surprise for our friends’ birthday.  They were most obliging, very service oriented and the massage was also excellently relaxing. Well worth every penny we spent ! Thank you Celeste and the masseurs. 👍👍👍\n\n",
        "Bishmar Shan\n8 reviews\nRated 5.0 out of 5,\nBest Massage I have had so far since I came here. My Masseuse was Jolin and she did an amazing job with her techniques. Unlike other spas/massage place, they bundle everything together and not try to sell separately. Worth the time and money.\n\nWill definitely come again!\n\n",
        "Abigail Foo\nLocal Guide·25 reviews·17 photos\nRated 5.0 out of 5,\nOMG!!! Amazing massage by my masseuse Linda, highly recommend their body massage. One of the best, I’ve tried in Singapore. Please do call and book in advance. I was lucky they have slots for two.\n\n",
        "Godefroy Rodriguez\n2 reviews\nRated 5.0 out of 5,\nHad a 1 hour massage yesterday. Massage was strong but soothing. Very relax after the session. Didn't manage to get the masseuse name though. She is quite slim and young looking but strength is there. Kudos to her.\n\n",
        "Yvonne Zhao\n4 reviews\nRated 5.0 out of 5,\nInexpensive & good massage in this area. Definitely will come again .\n\n",
        "Sarah Ng\n9 reviews\nRated 5.0 out of 5,\nBest massage I’ve had so far in Singapore. Cosy, not pushy with overselling services and had soothing music. My massage therapist, Nana was great and had really good massage techniques! Would definitely return.\n\n",
        "Gitika Singh\nLocal Guide·70 reviews·441 photos\nRated 5.0 out of 5,\nHad a great experience. My husband and I both enjoyed the massage. Cathy was my masseuse and she did a good job. Will certainly come back.\n\n",
        "Takehiro Miyai\n6 reviews·3 photos\nRated 4.0 out of 5,\nRoom is clean and staff are friendly. Only wish that massage itself was great. It was not too bad but not great either. Just rubbing gently with oil is not a kind of massage I was looking for. Maybe I should have asked for firmer massage. Good luck\n\n",
        "Mike Alessi\nLocal Guide·76 reviews·203 photos\nRated 2.0 out of 5,\nDefinitely NOT one of the better massages I’ve had in Singapore. The masseuse spent the first 45 minutes of my 90-min session forcibly jabbing her elbows into my upper back. Far from relaxing and quite painful. Note to Kyoto staff, massaging via elbows is not comfortable for the  receiver. After that she then lightly massages my legs for 45 minutes without any real care or effort whatsoever. Left quite disappointed. Gave 2 stars for quality of facility.\n\n",
        "TAM HUI CHING\n1 review\nRated 5.0 out of 5,\nThe environment is comfortable and clean.\nMy procedure was done by CASS. Very Satisfied!!!\nShe is obviously exceptionally knowledgeable about the human body and very professional. She made me feel completely comfortable despite the pain and tenderness.\nStrongly recommended and I will come back again!!!\n\n",
        "Scarless\n9 reviews·7 photos\nRated 5.0 out of 5,\nHappen to see this nice cosy spa while having lunch at the coffeshop beside it . Took the 1 hour massage at 60 dollar . The ambience of the spa is really good , tranquil n cosy .\nA big clean n nicely done up room was assigned to me. I slept throughout the 1 hour massage . Due to the smoothing spa music and skill of the therapist was excellent .  I definitely going back again real soon. Thumb up!\n\n",
        "wilson tong\n1 review\nRated 5.0 out of 5,\nCome across this spa when I went to Lino for my dinner . Tried their hot stone therapy massage & it was conducted by Linda . A very good n interesting experience with hot stone massage . Enjoyable n will return again .\n\n",
        "jane tay\n8 reviews\nRated 5.0 out of 5,\nVery impressive by this therapist, linda, excellent service n massage knowledge.This spa has a relaxing atmosphere with friendly staffs. Definitely one to visit when i need a good massage.\n\n",
        "Andrew V\n1 review\nRated 5.0 out of 5,\nBest massage I have had in Singapore! Staff very pleasant, experienced and professional.\n\n",
        "Cheryl Chen\n3 reviews\nRated 5.0 out of 5,\nLoved the ambience there and the professionalism of the masseurs there. Highly recommended for anyone who want quality service!!!\n\n",
        "Natalia Kovaleva\nLocal Guide·118 reviews·487 photos\nRated 5.0 out of 5,\nThere is good massage and relaxing, staff is friendly. And nice surprise was massage head and massage with hot towel\n\n",
        "Joyce Mong\n1 review\nRated 5.0 out of 5,\nNice little spa that i tried out together with my sis . Definitely will come back again.\n\n",
        "Olivia Teh\n1 review\nRated 5.0 out of 5,\nPlace was clean and cosy. Masseuse was experienced and professional. Money well spent. Highly recommended to all.\n\n",
        "mikie des\n7 reviews\nRated 5.0 out of 5,\nClean and cozy place! Tried hot stone massage and is really good! Will visit again! 😄\n\n",
        "jimmy tan\n5 reviews·5 photos\nRated 5.0 out of 5,\nVery cosy ambience and good massage , definitely will come back again.\n\n",
        "Ben Kang\n3 reviews\nRated 5.0 out of 5,\nMassage is good....place is clean...good and solid massage\n\n",
        "Eddie Lim\nLocal Guide·28 reviews·213 photos\nRated 5.0 out of 5,\nTook 90 mins of body massage! Was good and nice ambient\n\n",
        "Titus Kenrick Kou\n1 review·22 photos\nRated 5.0 out of 5,\nPleasant experience. Professional and skilful masseurs. Relax and chilling ambience\n\n",
        "Daniel Seah\n2 reviews\nRated 5.0 out of 5,\nClean and cosy enviroment for a relaxing massage\n\n",
        "Yoko Koike\n2 reviews\nRated 5.0 out of 5,\nNice ambience and relaxing!\n\n",
        "안우현\n4 reviews·19 photos\nRated 5.0 out of 5,\nAlways thank you :)\n\n",
        "Yang Yixuan\n12 reviews·2 photos\nRated 5.0 out of 5,\n\n\n",
        "Kat T\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6235 5562\">6235 5562</span>",
    "Website": "https://www.facebook.com/kyotospasg"
}