{
    "Name": "Le Mandarin Spa",
    "Products": {
        "Foot Reflexology 脚底按摩": "$45.00",
        "Oriental Massage 中式按摩": "$58.00",
        "Couple Massage 情侣按摩": "$138.00",
        "Le Mandarin Hot Oil Therapy 乐华热油理疗": "$89.00",
        "Ear Refreshing 采耳": "$35.00"
    },
    "Address": "22 Havelock Rd, 01-711, Singapore 160022",
    "Opening Hours": "Saturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nFriday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.4\n163 reviews",
    "Reviews": [
        "Jeff T\n38 reviews·24 photos\nRated 4.0 out of 5,\nWent to Le Mandarin for Oriental massage.\nOver all a good experience.\nHazel was an excellent masseuse, strong and professional.\nParis was a little weak and would probably be better with the hot oil massage.\nMy friend had Karen and said she was excellent too.  Strong and professional like Hazel.\nPlace was clean and air conditioned.\nWould go back for another massage from Hazel or Karen.\n\n",
        "Conan Edogawa\n1 review\nRated 5.0 out of 5,\nMy first time visiting Le Mandarin Spa, Chloe is easy to communicate and very skillful in massage, her hands and fingers did every important spot, it made me feel comfortable and relaxing after the session, I may come again.\n\n",
        "Dean Lim\n7 reviews·16 photos\nRated 5.0 out of 5,\nBest massage with Yuna in  Le Mandarin Spa.  They are totally legit, no funny business or shady dealing. Yuna is amazing, friendly and understanding. I feel great after every session! I feel more energetic; more relaxed physically, emotionally and mentally; any aches and pains I may have had going in (headaches, muscle aches, pinched nerves) are all relieved when my session is complete. Far superior to any chain or private masseuse I’ve tried.\n\n",
        "Jeff T\n38 reviews·24 photos\nRated 4.0 out of 5,\nWent to Le Mandarin for Oriental massage.\nOver all a good experience.\nHazel was an excellent masseuse, strong and professional.\nParis was a little weak and would probably be better with the hot oil massage.\nMy friend had Karen and said she was excellent too.  Strong and professional like Hazel.\nPlace was clean and air conditioned.\nWould go back for another massage from Hazel or Karen.\n\n",
        "Conan Edogawa\n1 review\nRated 5.0 out of 5,\nMy first time visiting Le Mandarin Spa, Chloe is easy to communicate and very skillful in massage, her hands and fingers did every important spot, it made me feel comfortable and relaxing after the session, I may come again.\n\n",
        "Dean Lim\n7 reviews·16 photos\nRated 5.0 out of 5,\nBest massage with Yuna in  Le Mandarin Spa.  They are totally legit, no funny business or shady dealing. Yuna is amazing, friendly and understanding. I feel great after every session! I feel more energetic; more relaxed physically, emotionally and mentally; any aches and pains I may have had going in (headaches, muscle aches, pinched nerves) are all relieved when my session is complete. Far superior to any chain or private masseuse I’ve tried.\n\n",
        "Crystal Artemis\n3 reviews\nRated 1.0 out of 5,\nI have been trying massage in different shop nearly every week if my regular ship is full.\n\nFirst time I try this Le Mandarin Spa now.\nThe receptionist lady said must take 90 mins to massage the abdomen area. Yes I agreed that and I usually take 60 mins/90 mins.\n\nEveryone knows that every minutes are important on massage.\n\nEnd up, the girl who massage me finish in 10 mins earlier and I was like how comes they left without doing  all the frontal areas of the body (the palm of hand, arms, abdomen areas, toes)\n\nMoreover, she doesn’t know how to massage the head properly. I have short hair around the ear length but she is stuck with my hair. Finally, she knows how to end the head massage. 😅😅 when other people hit 5 times, she hits me 15 times until I headache again.\n\nFurthermore , they come in when I haven’t finished changing. Not only these, she denied that she gave full 90 mins. Lucky, I was remembered what time she started and what time she ended. When I said nicely that she left 10 mins earlier then , she started to yell me\nThis is the point makes me angry and push me to share this review.\nWe paid full amount according to what they asked for. I didn’t take any promotions at all. I am sure the service is needed to be done fully.\n\nThe receptionist lady said next time they will give discounts. OH NO pls…\n\nDefinitely NO NEED TO STEP IN this kind of shop again.\n\nIf you guys wants to try this kind of horrible shop due to any promotions, remember to see the watch before you start and once you end.\n\n",
        "Happy!\n1 review\nRated 5.0 out of 5,\nI have engaged Soda for 1 hr to massage my back. She totally has the skills to tackle my backache problem. A very good therapist who is caring for her client and communicate well. After the massage, my backache is almost done. Very nice of her and her skill is superior! Thank you Soda! Will visit again!\n\n",
        "Kah Mun Lai\n1 review\nRated 5.0 out of 5,\nFaye is my go to therapist, she is very skillful in her massage, her strength is very comfortable. She is very polite and friendly, able to hold good conversation to ensure that you will not be bored throughout the session. Overall a very enjoyable session, highly recommended!!\n\n",
        "John Tan\n1 review\nRated 5.0 out of 5,\nJust had a 1hr full body massage with Snow. Remarkable therapist. Despite her petite frame, her massage techniques are strong and precise. Her skills are also very seasoned as she released all the tension in my back and neck. Friendly and cheerful, a plus point for me.\n\nVery nice atmosphere as well, clean room and comforting music. Definetly would return, and would pick Snow again!!\n\n",
        "Cao Nguyên Lê\n3 reviews·1 photo\nRated 3.0 out of 5,\nBeen here twice and got mixed result with Vietnamese therapist:\n- First time I tried hot oil therapy with Snow. She was not very friendly, and her massage skill was bad. She applied more pressure than necessary and not at correct point. My body & neck felt ache for the following week. The cost was $89.\n- Today I tried hot oil therapy & foot reflexology with Timi, she is nice and her body massage skill is very good. Her foot massage skill is just average. Total cost for the combo was $112.\nOverall I think this place is a bit overpriced, and you have to select the therapist carefully. A minus point for today is that Snow was at the reception, and her attitude didn't improve at all.\nUnless Snow improved her skill & serving attitude, don't choose her.\n\n",
        "Sein Reamon\n4 reviews\nRated 5.0 out of 5,\nStar is your go-to-masseuse if in need of great massage . She will check for your tolerance level. Good hands, strong pressure, and relaxing strokes. Best part? She will not rush! Chill and comfy. Overall an awesome experience with her. Will come back for Star for sure and be a patron customer.\n\nPlease send my nice review to her! Thank you!\n\n",
        "Arai Santos\n1 review\nRated 5.0 out of 5,\nTimi is your go-to masseuse if in need of great massage. She will check for your tolerance level. Good hands!!! Best part? She did not rush! Relaxing and comfy. Overall a great exp with her. Will come back for timi for sure! Keep it up girl!!!\n\n",
        "Jacker Lim\n1 review\nRated 5.0 out of 5,\nFeeling relax with a 1hr massage .Overall Vina is good and professionalism.will be coming back for more .\n\n",
        "Wind Teo\n1 review\nRated 5.0 out of 5,\nTimi is great as a therapist. She is friendly, approachable and able to tend to my need in relaxation of muscle. Always feel refresh after a massage session with her.\n\nThanks for the great massage\n\n",
        "ravin vasandani\n2 reviews\nRated 5.0 out of 5,\nTimi has got great hands and does her job really well.\n\nShe is never in a rush to finish her job. Also very polite and courteous. She is receptive to feedback and gets to the areas which most work is needed- ie the back or the thighs.\n\nThank you Timi for the wonderful massage :)\n\n",
        "Peter Phyo\n1 review\nRated 5.0 out of 5,\nI had the best body massage last weekend, among many visited Spa. Vina is the therapist who attended to me with great smile with superb massage skill. She fixed my upper back pain and frozen shoulder with proper great massage. Vina is friendly , sweet and very good with her massage service. Well done and thank you. Surely will go back again.\n\n",
        "Michel Ang\n6 reviews\nRated 4.0 out of 5,\nI think this place really deserves a good review. Clean and exceptional body massage that  I had visited today. I have gotten the body massage by the therapist name Vina. She is well trained with great personality. It was amazing that I was served with good massage skill, fixed my muscle pain. One little improvement needed is no music during secession. However, overall was excellent. Thank you Vina.\n\n",
        "Felicia Prasetya\nLocal Guide·16 reviews·3 photos\nRated 2.0 out of 5,\nThe masseuse that I got tried to sell me additional services costing extra $31 which I politely refused but she subsequently started complaining about other places services which I think it’s not professional. I think she also ended my session a bit earlier but it’s ok because it’s very uncomfortable as everything is so painful and what I find a bit unpleasant is when you just want a quiet massage and the masseuse keep complaining? My husband went for the foot massage and he also has a similar experience whereby the masseuse keep complaining. His is worse because she also complains about how hard his skin was? Really not a very professional and customer centric place....\n\n",
        "Ken Ong\n1 review\nRated 4.0 out of 5,\nI always visit Le Mandarin whenever I need to loosen my stiff and aching muscles.\n\nChristina at the reception is very friendly and helpful whenever I have to make a last minute appointment.\n\nClara and Jolin are 2 awesome therapists who are very professional and skillful. Highly recommended to people who need a good massage.\n\n",
        "Sharad Goyal\nLocal Guide·42 reviews\nRated 1.0 out of 5,\nDon’t bother.\n90 mins hot oil massage was actually just 75 mins and the oil was cold/ luke warm. The massage therapist was very disinterested and applied little pressure despite asking many times. Went to address a shoulder blade pain, finished with it being same/ worse :(\n\n",
        "Asacc Testo\n1 review\nRated 5.0 out of 5,\nThe receptionst is very friendly and helpful . And the place is very clean and welcoming. My therapist Timi ia very skillful with great personality. Able to resolved my persisten neck and shoulder stiffness.Definitely will come back again\n\n",
        "Wind El\n2 reviews\nRated 5.0 out of 5,\nWent to Le Mandarin Spa yesterday and was served by Landy. She was easy to talk to and customer oriented，massage  my stiff neck and backache was to the point. She was able to apply appropriate pressure to those areas and relieve my pain. Will look for her again in my next visit. The only complaint about the place is that there is no attached bathroom in the room, otherwise the place is very clean and spacious.\"\n\n",
        "Z P\nLocal Guide·103 reviews·289 photos\nRated 4.0 out of 5,\nLove that the massage wasn't too painful. The masseuse also check where she needed to focus which was very thoughtful. It would be cosy if the bedwarmer is provided as the centralised aircon was too cold and to turn down the music to have a more zen calming experience. I recommend the couple massage as it is value for money.\n\n",
        "Sebastian Ng\n1 review\nRated 5.0 out of 5,\nWill always look for Miki. She applies the right pressure to loosen my knots. She also makes sure that the hot oil is of the right temperature. Her pleasant and cheery disposition also drives the blues away after a hard day's work. Will definitely recommend Miki to my friends.\n\n",
        "Chinyong Soh\n1 review\nRated 5.0 out of 5,\nCrystal is my therapist. She is skilful, professional and friendly. Her massage is wonderful. i would highly recommend her and look for her again.\n\n",
        "Testo Lee\n1 review\nRated 5.0 out of 5,\nHad a good massage with Timi eases my backache especially after a weeks of work and a good stretching on areas to relieve aches. She is friendly and  skillful massage\n\n",
        "Rahman A\n2 reviews\nRated 5.0 out of 5,\nFirst time trying this spa and the place was clean and nice. My therapist was Vina and she was a excellent therapist and also a friendly person. Was amazed by her massage. Will definitely come back for more session.\n\n",
        "Avinash Tiwari\n8 reviews\nRated 4.0 out of 5,\nI had a 1 hour hot oil massage done by therapist Vina. After the session all my aches and pains had disappeared. Vina is a lovely girl who has a pair of magical hands with awesome skills. Highly recommended.\n\n",
        "Ariel Chong\n1 review\nRated 5.0 out of 5,\nDespite my first time joining this place. I would like to compliment Lina for her therapy it was relaxing.\n\n",
        "Luke Wong\n1 review\nRated 5.0 out of 5,\nCrystal massage technique is really good. My leg is sore, she helped me heal it, thanks her very much, I will go again next time.\n\n",
        "Eugene Lim\n3 reviews·7 photos\nRated 1.0 out of 5,\nCounter girl and masseuse kept trying to upswell the more expensive oil massage, when I told them I didn’t want oil massage. Despite choosing the chinese full body massage, I was told during the massage that the chinese massage is only for the back. Again masseuse hard sell the oil massage. when rejected she tried to push the essential oil for extra fees.  Definitely not coming back.\n\n",
        "FABIAN t\n1 review\nRated 5.0 out of 5,\nThis spa is relaxing and comfortable. The foot and body massage is affordable and  excellent! The interior of the spa is clean, cozy and comfortable. Masseuse Yuna is friendly and skillful. One of the best masseuse around. Will definitely  visit again n again\n\n",
        "Ren Zheng\n2 reviews\nRated 5.0 out of 5,\nMiki is a professional therapist. Always felt refreshed after the session. Will highly recommend her should anyone goes to the spa.\n\n",
        "Instagood78 PS4\n1 review\nRated 5.0 out of 5,\nLina is a very professional masseuse. Always give customers a pleasant experience with her excellent massage skills. Enjoy her therapy session every time.\n\n",
        "Niels Marston\nLocal Guide·112 reviews·49 photos\nRated 5.0 out of 5,\nGreat experience; massage therapist was highly skilled and very strong hands! Poor person had their work cut out as I carry a lot of tension in my shoulders; a suggestion for hot rocks genuinely wasn't an up sell in case, my knotted muscles needed it.\n\n24 hours later and I'm still recovering from a hard working through but oh the better for it.\n\nThanks 😀\n\n",
        "anurag tripathi\n1 review\nRated 5.0 out of 5,\nA SPA is as good as its masseuse. A good Masseuse should exhibit both Knowledge and Technique, in addition to the right temperament. I have a perennial back problem and have been visiting CASEY for the past few months. I find that she has all the above qualities. I would gladly recommend her. The fact that she is able to make small conversations in English is an added advantage.\n\n",
        "Goh Huang thung\n1 review\nRated 5.0 out of 5,\nMiki is very passionate to customer, also her attitude is very good. In term of massage skill I can said she is fantastic\n\n",
        "SH O\n2 reviews\nRated 5.0 out of 5,\nHad a great session today, both Christina and June at the reception were very friendly and professional.\n\nSoda was very good and had great skill in massage. Definitely a great place to relax after busy work\n\n",
        "jason yeo\n6 reviews\nRated 5.0 out of 5,\nFaye is very patient and meticulous about helping to release the knots and strained muscle. Very good balance of strength and technique.\n\n",
        "Zk B\n3 reviews\nRated 5.0 out of 5,\nLina is a great masseuse and she has great streghth. She works very hard and relieves all my joints. I felt really relaxed after my massage session.\n\n",
        "Alan Ng\n3 reviews\nRated 5.0 out of 5,\nVery nice and comfortable place. Convenient location as well. My therapist Lina is professional, skillful with good personality. Manage my stiff neck pain very well. Well recommended.\n\n",
        "Des Soh\n1 review\nRated 5.0 out of 5,\nWent to Le Mandarin Spa a few days ago and was served by Mango.  She was very customer-oriented, where she listened to my chief complaint which was my stiff neck and backache, before she started to massage me.  She was able to apply appropriate pressure to those areas and relieve my pain.  Will look for her again in my next visit.   The only complaint about the place is that there is no attached bathroom in the room, otherwise the place is very clean and spacious.\n\n",
        "aster ong\n1 review\nRated 5.0 out of 5,\nThanks for your service, excellent service all the pain and strain has been reliefed due to your excellent massage skills have never been to any spa with this awesome and spectacular skills. I will definately introduce to more of my friends to come back and massage.\n\n",
        "Muneer Shah Mohammad Shah\n2 reviews\nRated 5.0 out of 5,\nGood service. It’s the first time I’ve been here and right away counter lady informed her staff that I’m Malay. Other places that I go don’t have the initiative to inform their staff that I don’t speak Chinese and yet this place took notice. Yuna was good in massage and rarely would we see any masseur using their legs to massage our back. Very well done.\n\n",
        "Sai Prasaad\n3 reviews\nRated 5.0 out of 5,\nVery professional and relaxing massage. The masseuse, Vina, was very helpful and accommodating and managed to clear my neck pains. Will definitely be coming back.\n\n",
        "Muhammad Haiqal\n2 reviews\nRated 5.0 out of 5,\nIf you need a good massage, this is one of the places you should go to. As a regular here, i would often come here for to ease my backpain and shoulder problems. Vina is the one to look out for as she delivers the quality of the massage that i’ve been looking for all these while. I do not have to go elsewhere as i’ve found my hidden gem here. 5 stars for Vina.\n\n",
        "Suhaimi Remy\n1 review\nRated 5.0 out of 5,\nHad my stiff neck&frozen shoulder massage. Staff namely, Yuna. Good massage,friendly. Nice environment. Clean&spacious. Very friendly counter staff. Warm greeting too.\nOffice Workers, march in. Get your muscle relax...\n\n",
        "james ng\n1 review\nRated 5.0 out of 5,\nWent to find crystal a few days back, decided to write her a review for her because she deserve it.. After massage I saw her forehead full of sweat, her massage was on point with strength because I told her I have a very aching back.. The day after I found out that my backache no so painful as before.. Thumbs up for crystal keep up the good work..\n\n",
        "Jacques Ng\n1 review\nRated 5.0 out of 5,\nCrystal massage on point with strength that’s what I’m looking for a long time, didn’t feel bored throughout the whole session she breaks the ice easily. looking forward to another visit there :)\n\n",
        "Martin Lee\n1 review\nRated 3.0 out of 5,\nFriend said good. So walk-in. Assigned Angeline (shop busy, 10 min.wait). off to the rm. Usual small talk - she asked where u usual go - I said B. Timah. Then I asked where u train, SG? She quite emotional said all PRC therapist trained 1by1 in China, only their is 正宗(pls lah, this place is not TCM hall)。i asked how about your Vn colleague,  their not genuine mah (i.e.正宗）？Now she quite upset, said whatever u want to believe, Then I further asked, I go BKK they also said their is 正宗, how? She off the boil now. Sending this is not going to be a happy episode, asked for a change of therapist. Lucky shop obliged (another 5-10 min.wait). Eventually left a happy human being. Lesson learnt - do your homework before you go. Ps. web photo PS. Peace.\n\n",
        "Yongquan\n14 reviews·2 photos\nRated 1.0 out of 5,\nOverall, a really bad place do not waste your money here. Firstly, the service at the counter is bad; bad attitude and the lady looks like she hates her job; pushy and will attempt push you to pay a higher amount; do not fall for it. Then the place is dirty and the aircon is too cold. The experience will be really uncomfortable for you... And the massage was horrible. Do any of the girl even know how to give a massage? Anyone who watches a Youtube video tutorial would do the job 10 times better. Finally, this is not a clean place at all despite mall the signs within the spa of it being clean, even though you make it clear you only want a massage they will insist, be pushy and unhappy about it!!! Do not come here!\n\nAnd i'm pretty sure the reply below is \"just for show\" just like all the signs inside. Do not go. You will regret it - it's a really smelly and gross place\n\n",
        "Jack Le\n3 reviews\nRated 5.0 out of 5,\nI will recommend Timi,she massage is very good and professional skills for massage,she very friendly and nice person, Timi always is my first choice massage therapist.\n\n",
        "thomas lao\n1 review\nRated 5.0 out of 5,\nThe massage experience with Vina was simply amazing. Friendly and calm ambience made the experience an unforgettable one. I highly recommend Vina to those who wants a good relaxing massage.\n\n",
        "Al ex\n2 reviews\nRated 5.0 out of 5,\nOverall the massage is good and the therapist Vina is skillful. Had a good night sleep after the massage. Well done and keep up the good work!\n\n",
        "Ian Robertson\n4 reviews\nRated 5.0 out of 5,\nVery good massage,well worth the money.The chinese masseur was very caring and professional,will go back again.\n\n",
        "SUPERGOLFNUT\n1 review\nRated 5.0 out of 5,\nMiki is my goto therapist because she is professional and awesome at working out the issues with my muscles after workouts! Highly recommended.\n\n",
        "Ewa Andrejczuk\nLocal Guide·83 reviews·21 photos\nRated 1.0 out of 5,\nVery bad experience. The place is really cold, I couldn't relax during the massage cause it was freezing inside! Even though it's more expensive than the massage places around, the quality of service is bad (the receptionist grumpy, the towels look dirty, bed smells and the massage itself was not great).\n\n",
        "fong meng Teo\n1 review\nRated 5.0 out of 5,\nCrystal is my therapist. She is skilful, professional and friendly. Her massage is wonderful.\n\n",
        "Faris\n1 review\nRated 5.0 out of 5,\nI think this place is the best spa in central! Clean cozy . The massage girl yuna is very good . Know her massages skills .\n\n",
        "Alvin Tan\n1 review\nRated 5.0 out of 5,\nAnna is a professional and responsible therapist. I have back pain and neck discomfort for almost 30 years, with her skill she have helped me to relieve the pain and discomfort that I have gone through. Deeply appreciate for her help.\n\n",
        "S.R Karthik\n1 review\nRated 5.0 out of 5,\nZoey is the best of the best.. She's approachable and is the best therapist of the lot. I will completely vouch for her in terms of message standard.\n\n",
        "ling Teo\n1 review\nRated 5.0 out of 5,\nCrystal She is kind and chatty, especially I like her smile and know how to release the tension of muscle, such skill is worthly for additional visiting.\n\n",
        "Sulaiman Safiee\n2 reviews\nRated 5.0 out of 5,\nLove the experience of it and will come back for more. looking forward with Hazel👍 Good job on keeping the business running during this pandemic.\n\n",
        "Ivan Yeo\n1 review\nRated 4.0 out of 5,\nJust came back after a nice and relaxing massage by Mango. Been her regular for a long time, but will still be back to her when I need massage because she knows exactly where I need more strength on.\n\n",
        "GOH TS\n1 review\nRated 5.0 out of 5,\nThe place is clean and my therapist Lina was very professional. The massage was very good that I sleep through. The place also very convenient and those who drive have ample car park. 👍👍👍👍👍\n\n",
        "陈冲\n1 review\nRated 5.0 out of 5,\nI accidentally discovered a hidden gem when I randomly walked into this shop. It has a great surrounding and very friendly staffs.\nYoyo is 1 of the best masseuse I have ever came across and that is saying alot as I move around alot and does it twice a week. She is very good in getting the right spots and great strength.\nThanks Yoyo! You got yourself a regular!\n\n",
        "Edward Lee\n3 reviews\nRated 5.0 out of 5,\nI usually look for Crystal for massage. She is skilful and hardworking. Highly recommended!! Will look for her again.\n\n",
        "Young sinatra\n1 review\nRated 5.0 out of 5,\nVina is a really awesome therapist. She’s very friendly and knows how to massage very well. 10/10 highly recommended.\n\n",
        "Gowri Reghuvaran\nLocal Guide·56 reviews·5 photos\nRated 1.0 out of 5,\nWaste of time and money. The 60 minute oriental massage wasn't 60 minutes and was very sloppy. Too much unnecessary attention in few areas and completely ignoring other areas. Tried to guide her but the therapist didn't speak English. Also did an ear candling that was extremely ineffective. Not going back.\n\n",
        "Edmund Lee\n1 review\nRated 5.0 out of 5,\nMiki was skillful and know what strength to apply during the whole message session. She is friendly. Worth the session with her.\n\n",
        "Kuan Boon Chua\n2 reviews\nRated 5.0 out of 5,\nMIKI is a professional therapist, my frozen shoulder has improved a lot and I can lift my arm up now, and she is friendly too\n\n",
        "Teo Guang\n1 review\nRated 5.0 out of 5,\nStar is the massage therapist to find, she awesomely friendly and her massage was relaxing and remarkable which solved my backache. 👍\n\n",
        "mohdnuradha mohd\n1 review\nRated 5.0 out of 5,\nVery good masseur. Landy. She is a very profesional masseur.. Very nice.. Nice place to go for massage.. Will repeat again for next session..\n\n",
        "shyam krishna\n3 reviews\nRated 1.0 out of 5,\nI had taken landy, I had taken oriental massage they forced me to take up hot oil massage which was 31$ more, 30 min of first 1hr she spoke about convincing me and I have been to many places for massage and it is much professional but here landy the masseuse said she is very soft and lazy, despite of me telling her that I have pain and press harder, it seem like she was just doing it to push the time & at end she didn't let me take shower instead gave hot towel tp wipe myself... never seen such unprofessional service anywhere in singapore or overseas...\n\n",
        "TEO CALVIN\n76 reviews·16 photos\nRated 5.0 out of 5,\nLina, she is very skillful in her works, helping me to remove my stress and relieve my injuries. She is friendly, smile alots.\nI feel comfort under her care.\n\n",
        "mark lim\n1 review\nRated 5.0 out of 5,\nThe place is cozy and the massage is good which miki has done a good job to relaxes my muscles\n\n",
        "Ah Pro\n3 reviews\nRated 5.0 out of 5,\nVery spacious and quiet massage place. Good massage skills and strength by the Chinese masseuse. Will definitely be back soon again!\n\n",
        "Joan Phua\n1 review\nRated 1.0 out of 5,\nSupposedly an hour massage but it was over in 50 minutes. Masseuse went to replenish massage oil and took about 5 mins but never replace my time.\n\n",
        "Michelle Neo\n11 reviews\nRated 1.0 out of 5,\nThe viet masseue had no skill and was more focused on watching TV than massaging. She left me without cleaning my feet after massage and her colleague had to do it.\n\n",
        "2MuchAwardNess Gaming\n1 review\nRated 5.0 out of 5,\nStar is the best Vietnamese therapist in my option she massage very good and very friendly will definitely will go back for her again❤️❤️😘😘😍😍⭐️⭐️⭐️⭐️⭐️\n\n",
        "Wei Han\n2 reviews\nRated 5.0 out of 5,\nIts was great, Snow was great, she gives excellent massage. Will come again\n\n",
        "zheng cindy\n1 review\nRated 5.0 out of 5,\nCrystal massaged my shoulders and neck very well. My neck was twisted. She was very patient and treated me with courtesy 👍\n\n",
        "Victor Chin\n2 reviews·1 photo\nRated 5.0 out of 5,\nAwesome massage place, was tired after work just want some massage and relax and I was served by vina her massage therapist skill was awesome and great 👍\n\n",
        "shong on\n3 reviews\nRated 5.0 out of 5,\nGreat place to relax - Lina is very professional and great massage skills. Highly recommended!\n\n",
        "Mark Tony Ng\n4 reviews\nRated 1.0 out of 5,\nAwful spa, Unprofessional Therapist, kept talking with other Vietnamnese therapist, booked for 1,5 hr, the therapist fall asleep so many times, kept going out of the room, therapist even called up the front desk said she had stomach ache, but Front desk told her to keep going.\n\n",
        "Leong kit Tong\n1 review\nRated 5.0 out of 5,\nThis place is clean and the atmosphere is very present. Your massuse Miss Anna is very well trained and professional. Will certainly recommend my friends the visit this place.\n\n",
        "Antony Lim\n1 review\nRated 5.0 out of 5,\nIt is a clean place, and have a pleasant and professional masseur Lina. She have a good of pair hands could have u relax.\nThanks Lina!!\n\n",
        "Tsukihi Araragi\n1 review\nRated 2.0 out of 5,\nGood environment. Nice front staff. But be careful with some of the staffs as they ask you if you want special service and their technique in massage is very bad.\n\n",
        "Xinyi Peng\n1 review\nRated 1.0 out of 5,\nDon’t go it’s quite bad, room is cold and massager is not very well trained. After give feedback on the temperature about the room, the front desk lady was not even take it serious.\n\n",
        "Jimmy Ng\n1 review\nRated 5.0 out of 5,\nClean and great spa! Kudos to my therapist Vina for being so professional and skilful. Highly recommended!\n\n",
        "Denise W\nLocal Guide·46 reviews·4 photos\nRated 5.0 out of 5,\nVery friendly staff. Clean, comfortable rooms and waiting area. Excellent Chinese massage. Will visit again when I come back to see relatives!\n\n",
        "lee Lmyuan\n1 review\nRated 5.0 out of 5,\nI like the staff name Star ，will always look for her only ，kind、 cute 、talkative ，will coming as well ，highly recommend👍\n\n",
        "Winston Ng\n2 reviews\nRated 5.0 out of 5,\nGood massage service, had a good chat with this staff, friendly, and beautiful.\n\nMassage by : Star\n\n",
        "man45pai manpai\n1 review\nRated 5.0 out of 5,\nI have a very good massage service from miu miu and she make me comfortable till i doze off,sincerely very good👍\n\n",
        "C O\n1 review\nRated 5.0 out of 5,\nVisit Spa weekly and Highly recommended Linda as she can help to release your neck and back Ache.\n\n",
        "Albert Que\n4 reviews\nRated 5.0 out of 5,\nGood.place for relax, especially when you need a body massage. Lina is very experience and skillful, and friendly.\n\n",
        "Darren Gue\n1 review\nRated 5.0 out of 5,\nGood and professional service from the massage therapist Star.\n\n",
        "Vincent Kwek\n2 reviews\nRated 4.0 out of 5,\nThis is my first time here massage by yuna no bad hard massage and friendly 👍because your room no shower so I only give 4 star\n\n",
        "Adwin Lee\n1 review\nRated 5.0 out of 5,\nGood massage and services was good, i will surely recommand my friends to come. Thanks!\n\n",
        "Melvin Shah\n1 review\nRated 5.0 out of 5,\nMy therapist  Clara is the best.. she really make me feel so relax.\n\n",
        "Ameen Loud\n2 reviews\nRated 5.0 out of 5,\nDetail,efficient & nice ambiance. Star lived up to her name. Very bubbly and take work seriously. Highly recommended.\n\n",
        "Haruma Sasaki\n1 review\nRated 1.0 out of 5,\nThey offer extra service at this place. Massage skill was super bad. I will report this matter to the police.\n\n",
        "WL P\n2 reviews\nRated 5.0 out of 5,\nProfessional massage , nice place for relaxing . Highly recommended vina\n\n",
        "tan hai yong\n3 reviews\nRated 5.0 out of 5,\nA professional massage by Ms. Joanne, very experienced and polite staff in Le Meriden spa.....VERY MONEY WORTH......\n\n",
        "Shaun Lim\n3 reviews\nRated 5.0 out of 5,\nMiki has very good massage skills\n\n",
        "Lawrence Tan\nLocal Guide·448 reviews·1,319 photos\nRated 5.0 out of 5,\nVery nice spa with great shower facilities! Snow is also good at her field!\n\n",
        "torres hong\n1 review\nRated 5.0 out of 5,\nGood massage and good manners would recommend Jolin massage therapist 👍\n\n",
        "Yandy “hondu”\n1 review\nRated 1.0 out of 5,\nNot worth the price they charge. Lousy massage and gave me someone that keeps coughing in the room.\n\n",
        "Lilian yee\n18 reviews\nRated 1.0 out of 5,\nThe massage was lousy. I just can't wait to finish it fast.\n\n",
        "Randy Low\nLocal Guide·113 reviews·72 photos\nRated 4.0 out of 5,\nGood massage, able to sleep well\n\n",
        "prabhu prabha\n1 review\nRated 5.0 out of 5,\npaya lebarLandy  is  very  nice  girl  and  very  nice  Massage\n\n",
        "Hito hara\n1 review\nRated 5.0 out of 5,\nNice place! Went after work. Got foot reflexology decided to try and it was very good. Got yourself a returning customer goodjob!\n\n",
        "Yi fan Chan\n1 review\nRated 5.0 out of 5,\nGood massage and customer service from Crystal\n\n",
        "惠旻陈\n2 reviews\nRated 5.0 out of 5,\nStar is very good ! good massage 5 star!\n\n",
        "alan tham\n1 review\nRated 5.0 out of 5,\nGreat place great people. Mango was the theraipist attitude was great, and skillful.\n\n",
        "Josh Peasley\n1 review\nRated 5.0 out of 5,\nAwesome place! I will always go there when I visit Singapore!!\n\n",
        "Soh Choon Chai\n1 review\nRated 5.0 out of 5,\nTimi good service, skill and friendly\n\n",
        "Anthony Lee\n1 review\nRated 5.0 out of 5,\nLandy, thanks for the good massage👍👍\n\n",
        "thomas ng\n1 review\nRated 5.0 out of 5,\nTimi services very good 👍\n\n",
        "Lee James\n8 reviews\nRated 4.0 out of 5,\nNice and clean ambience for the price!\n\n",
        "Afizzle FerShizzle\n4 reviews\nRated 5.0 out of 5,\nAmber's knee massage is amazing.. the right pressure.. hits the spot..\n\n",
        "See Hoe Lim\n2 reviews\nRated 5.0 out of 5,\nMiki. Good service\n\n"
    ],
    "Phone": "6377 0628",
    "Website": "http://www.lemandarinspa.sg/"
}