{
    "Name": "Live Spa",
    "Products": null,
    "Address": "71 Seng Poh Rd, 01-45, Singapore 160071",
    "Opening Hours": "Saturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nFriday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.7\n67 reviews",
    "Reviews": [
        "Belle B\n3 reviews\nRated 5.0 out of 5,\nAlways have had a great experience here, friendly reception, professional massage services, super value for money, very accommodating and receptive to feedback. Would be super awesome if they had a membership package. :)\n\n",
        "anya chen\nLocal Guide·23 reviews·55 photos\nRated 5.0 out of 5,\nWent for a last minute full body massage and the masseuse was lovely, very attentive and used the perfect amount of pressure! The price is so reasonable and I’ll definitely be coming back :) if you’re looking for a good value, quality massage in Singapore then this is the place!\n\n",
        "Meneka Chand\n4 reviews\nRated 5.0 out of 5,\nWas looking for a massage and chanced upon Livaspa. Wasn't expecting much given the price\n(1hr full body massage $50). But boy was i wrong!!! Called them up at 7.30am for 1 hr full body massage at 8.30pm for 2pax, requested for couple room too. We arrived at 8.10pm and was grreted by a very beautiful gal at the reception. She was quick to assign the room & massuers to us. They were Amy & Ivy. They were sooooo good!! Highly recommend them. Initially massage was abit too hard for me. Informed her and she applied just the right pressure. Will definitely come bk again!!! My husband can't stop talking about the massage. We had a really good night's sleep that night.\n\n",
        "Belle B\n3 reviews\nRated 5.0 out of 5,\nAlways have had a great experience here, friendly reception, professional massage services, super value for money, very accommodating and receptive to feedback. Would be super awesome if they had a membership package. :)\n\n",
        "anya chen\nLocal Guide·23 reviews·55 photos\nRated 5.0 out of 5,\nWent for a last minute full body massage and the masseuse was lovely, very attentive and used the perfect amount of pressure! The price is so reasonable and I’ll definitely be coming back :) if you’re looking for a good value, quality massage in Singapore then this is the place!\n\n",
        "Meneka Chand\n4 reviews\nRated 5.0 out of 5,\nWas looking for a massage and chanced upon Livaspa. Wasn't expecting much given the price\n(1hr full body massage $50). But boy was i wrong!!! Called them up at 7.30am for 1 hr full body massage at 8.30pm for 2pax, requested for couple room too. We arrived at 8.10pm and was grreted by a very beautiful gal at the reception. She was quick to assign the room & massuers to us. They were Amy & Ivy. They were sooooo good!! Highly recommend them. Initially massage was abit too hard for me. Informed her and she applied just the right pressure. Will definitely come bk again!!! My husband can't stop talking about the massage. We had a really good night's sleep that night.\n\n",
        "tiongbahruboy\n2 reviews\nRated 3.0 out of 5,\nThis is a no nonsense place. Good, clean massage. However, I didnt quite enjoy the massage though. The room I was allocated was next to the recep area and I could hear conversations outside. Room was dark and cosy. Massage a little on the hard side. Painful at times.\n\n",
        "Edwin Lim\n2 reviews\nRated 5.0 out of 5,\nRaymond did a wonderful job for my foot massage. Very reasonable very value for money! Great job!\n\n",
        "Jamie Chan\n11 reviews·10 photos\nRated 5.0 out of 5,\nIvy did an excellent job. Had a tension headache that lasted for weeks. I could tell that she knew the pressure points well and my tension headache was relieved significantly. Will be back!\n\n",
        "JL T\n7 reviews·1 photo\nRated 5.0 out of 5,\nCame here without an appointment on a weekday afternoon. Read good reviews and wanted to have a massage that will help soothe soreness from my workout. My masseuse was a Chinese lady who applied the right amount of force and pressure on sore points. After that, I had the guasha treatment which supposedly helps relieve body “heat” and improve blood circulation. All in all my muscles felt looser after the massage session at Live Spa. Highly recommended for good quality, good value massage!\n\n",
        "Sarah Harrison\n19 reviews·16 photos\nRated 5.0 out of 5,\nClean, quiet, friendly and not freezing - skilled masseur who responded well to pressure feedback. Will definitely go back for the price and service.\n\n",
        "Esther Fong\n6 reviews\nRated 5.0 out of 5,\nJust had body massage for 90 mins. Very relaxing. Ambience is relaxing. Clean place. Price is affordable. Will come again.\n\n",
        "Lynn Lynn\nLocal Guide·14 reviews·5 photos\nRated 5.0 out of 5,\nFirst time here after living in Tiong Bahru for so long, am amazed to find this hidden treasure message place. Amy and Jason were professional and on point  with their massage. My hubby and I will be back for more!\n\n",
        "Min 99\n1 review\nRated 5.0 out of 5,\nNice environment and good service! The massage area is so comfortable that i can fall asleep and their masseuse are all so strong. I really love this place and would definitely patronise again!\n\n",
        "K t\n16 reviews·7 photos\nRated 1.0 out of 5,\nDefinitely not worth it.\n\nMy friends did the massage, they told us 30 min for $28. Till they saw the banner outside 40 min for $28, so we asked them. They told us that they lack of manpower and only can massage 30 min after we had make the payment and finish everything. Nonsense.\n\nI did the facial, horrible. I do not mind it's a simple facial but the massage on the head it's horrible.\n\nWill never patron here again.\n\n",
        "Neo Dro\n8 reviews\nRated 5.0 out of 5,\nIvy was phenomenal and very professional 👌 her experience showed throughout the 90min session. Highly recommend this place for a deep tissue massage. It is very imp you communicate how much pressure you would like 'cos they are used to such long sessions but our bodies aren't, at least mine wasn't!\n\n",
        "Agathe\n4 reviews\nRated 5.0 out of 5,\nI have experienced three services in this spa (full body massage, foot massage and facial) and I'm very glad of them all. Michelle and Peipei are great therapists, and I highly recommend them. Plus, the manager is a really nice woman, always ready to help and advise you.\n\n",
        "Amanda w\nLocal Guide·76 reviews·29 photos\nRated 5.0 out of 5,\nGet to know this place recently and it never disapoints me. It was a good place to get your foot massage and their skills are really very good. Prices are pretty reasonable and i will definitely drop down again to enjoy my foot massage! Nonetheless, people there are nice! :)\n\n",
        "Gaeul Ok\n1 review\nRated 1.0 out of 5,\nI will not come here again. And i will definitely not recommend this massage place to my friends.\nOverall, massage skill was very bad. They should get training for better massage.\nIt was nothing more than “rubbing oil all over body”.\nWhen i get massage, usually i feel “oh is it already over?”. But this one was “oh god, when is it going to be over?”.\nI don’t know how other massage is (foot / shoulder). I got full body massage, and i can tell It is highly over rated place.\n\n",
        "A W\n1 review\nRated 5.0 out of 5,\nA wonderful massage experience i have over there. The receptionist is really friendly and she explains well for the doubts i have.  I can't wait for the next visit again😊💙\n\n",
        "Mandeep\n1 review\nRated 5.0 out of 5,\nGreat massage at a great price. Amy the masseuse was very professional, front desk was friendly. Would definitely return.\n\n",
        "cheezy cake\n1 review\nRated 5.0 out of 5,\nCame across tiong bahru and saw the spa hence decided to try for the first time. Great experience! The staffs were very nice and experienced, after the massage i felt much more relaxed. Would ask my friends along the next time and come back again\n\n",
        "Marlon D\nLocal Guide·15 reviews·52 photos\nRated 5.0 out of 5,\nReally Shiok foot massage for a reasonable price\n\n",
        "E Chong\n8 reviews\nRated 1.0 out of 5,\nWent in for a 40mins foot massage. The lady at the counter said one of us have to wait 10mins while the other can start immediately. We said ok.\n\nAfter 20 mins of waiting, no one attended to us. I had to approach them to ask what’s going on. We got a refund instead. Would not recommend this place. Lousy management given that no Masseuse were assigned to us after we made payment before the service.\n\n",
        "Benjamin Ang\n2 reviews\nRated 5.0 out of 5,\nI just done a foot massage by Apple and it was very comfortable and relax.\nDefinitely will return for more visits, even extends the massage to 2hours.\nGood job !\n\n",
        "AJ M\n2 reviews\nRated 5.0 out of 5,\nI have been there a few times and i am really in love with the place. Firstly, the environment is cosy and located near Tiong Bahru hawker centre where there is also alot of good food. Their shop have free wifi, tv and provides water. Their aircon is also cooling! If you would like to drop by for massage on weekends, it is better to make a call to make a booking because it can be fully booked. Come if u like strong massage and able to request for not so strong massage if you would like to! :)\n\n",
        "Isabella\n14 reviews·1 photo\nRated 5.0 out of 5,\nOne of the best places where you can find decent foot massage. Don’t judge a book by its cover though, the shopfront might look a little dodgy but the masseuse were so professional for me and my fiancé.\n\n",
        "Amanda Wong\n2 reviews\nRated 5.0 out of 5,\nThis is the best massage shop that i have ever visited before. Good service attitude and super lovely place. Their massage skills are also the strongest.\n\n",
        "Cynthia Wei\nLocal Guide·867 reviews·2,343 photos\nRated 4.0 out of 5,\nStrong massage! The decor at the entrance looks slightly tacky but it's in face very basic and clean inside. Great tactics and polite / friendly service, good price too!\n\n",
        "James Yew Huat\n1 review\nRated 5.0 out of 5,\nMy friends and overseas customers ( from USA, Germany, Japan, Italy, etc..) very like all Live Spa staffs are very good service, and also Mangement staff, Well done! All will come back again. Thanks!\n\n",
        "Mirae Xi\n2 reviews\nRated 5.0 out of 5,\nCosy area for me to relax and have my massage. The price is pretty reasonable and people are very polite with us when i was there with my boyfriend.\n\n",
        "Lynn Zhi Tay\n2 reviews\nRated 5.0 out of 5,\nGreat service and affordable price! The staff are very friendly and professional too. Will definitely bring my friends back again.\n\n",
        "Shinchan Iscute\n1 review\nRated 5.0 out of 5,\nEnvironment is comfortable, the masseur are very professional and service is good. Will definitely come back again\n\n",
        "Rachel Choe\n12 reviews·3 photos\nRated 5.0 out of 5,\nCame here after having a terrible experience at nimble/knead and was saved by Amy! Clean, no frills place with affordable pricing, will definitely be back soon\n\n",
        "Moojigay Singapore\n1 review\nRated 5.0 out of 5,\nBest experience ever! Strongly recommended. Good service, reasonable price and friendly therapist.\n\n",
        "Andrew\nLocal Guide·36 reviews·70 photos\nRated 5.0 out of 5,\nExcellent foot massage - go there every time I am in Singapore!\n\n",
        "Steven Robbins\nLocal Guide·40 reviews·9 photos\nRated 5.0 out of 5,\nI have never had a stronger massage. Great technique and very professional.\n\n",
        "Jasmine Hoe\n3 reviews\nRated 5.0 out of 5,\nQuality massage by Lulu.\n\n",
        "Monica Adina\n2 reviews\nRated 5.0 out of 5,\nReally good massage, loved it!!\n\n",
        "Yong Hwee Chin\n11 reviews·1 photo\nRated 5.0 out of 5,\nbeen a regular customer of this spa already. like their strong massage and nice staff!\n\n",
        "Francis Lansakara\n2 reviews\nRated 5.0 out of 5,\nLive Spa locatesd in Tiong Bahru area experience of quality service by friendly masseurs a place value for money recommend  👍\n\n",
        "kate s\n1 review\nRated 5.0 out of 5,\nThe environment is great and gives people a comfortable feeling.. the price is also ok not too pricey.\n\n",
        "Jessica W\n5 reviews·2 photos\nRated 5.0 out of 5,\nnot a fancy place by decor but very kind and courteous staff with excellent technique in a 60min reflexology session.\n\n",
        "Vera Ng\n1 review\nRated 5.0 out of 5,\nbeen here a few times and enjoy the back massage! will come again!\n\n",
        "Jin Zuan\n2 reviews·2 photos\nRated 5.0 out of 5,\nExcellent service, a cool place to chill and relax, definitely recommend! 👍🏻\n\n",
        "Jinhui Lee\nLocal Guide·64 reviews·116 photos\nRated 5.0 out of 5,\nGood service, comfortable atmosphere and environment\n\n",
        "Jane 서현 Park\nLocal Guide·113 reviews·83 photos\nRated 5.0 out of 5,\nWell experienced and kind masseuse\n\n",
        "Ashley Ong\n2 reviews\nRated 5.0 out of 5,\nVery good and worth the money!\n\n",
        "cheongyun xp\n1 review\nRated 5.0 out of 5,\ngreat environment, good massage skills\n\n",
        "Tan Winson\n4 reviews·1 photo\nRated 5.0 out of 5,\nAmy was great!!!!\n\n",
        "Dominic Wong\nLocal Guide·9 reviews·3 photos\nRated 5.0 out of 5,\nFirst time here and definitely will come back again! Lovely environment, reasonable price.\n\n",
        "Martin Langthaler\nLocal Guide·19 reviews·18 photos\nRated 3.0 out of 5,\nA bit average\n\n",
        "MARI\nLocal Guide·217 reviews·239 photos\nRated 4.0 out of 5,\n(Translated by Google) I am passing many times during my stay. Very treatment is pleasant and kind. Jeong Bao district away from the main tourist but fancy and fancy restaurants and famous bakeries are also nearby so please visit.\n\n(Original)\n滞在中、なんども通っています。とても施術が気持ちよく親切です。観光のメインからは離れたチョン・バル地域ですが気さくでお洒落なレストランや有名なパン屋さんも近くにありますのでぜひ訪れてください。\n\n",
        "張瑾煜\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The environment is clean and hygienic, the massage technique is good, and the service attitude is great! Going next time is the best choice for massage. 👍🏻\n\n(Original)\n环境干净卫生，按摩技术好，服务态度棒棒哒！下次还去，是按摩的最佳选择。👍🏻\n\n",
        "梁红英\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The space is large, clean and tidy, and the focus is on the good techniques of the massage technicians. I love this SPA and I feel cordial.\n\n(Original)\n空间大，干净整洁，重点是按摩技师手法好，我爱上这间SPA,有亲切感。\n\n",
        "キャスバルレム・ダイクン\nLocal Guide·51 reviews·6 photos\nRated 4.0 out of 5,\n(Translated by Google) There is power of finger and feels good.\nHowever, it is also true that I feel like I can't reach my ugly place.\nIt ’s just a little waste because it ’s just good. Maybe it depends on people.\n\nSince there is nothing special, Zeon's soldiers should not have extra expectations.\n\n(Original)\n指の力があって気持ちが良い。\nただ、なんかちょっと痒い所に手が届かないような気がするのも事実。\n上手いだけになんだかちょっともったいない。人に依るのかもしれないが。\n\n何か特別なものは無いからジオンの下兵共は余計な期待を抱かないように。\n\n",
        "Yuki He\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Very good service, fair price, clean environment and good massage technique, great 👍👍\n\n(Original)\n很好的服务，公道的价格，干净的环境和很好的按摩技术，棒棒的👍👍\n\n",
        "ting ting\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Comfortable massage, high quality and efficient service, pursuit of customer satisfaction!\n\n(Original)\n舒适的按摩，优质高效的服务，追求顾客的满意！\n\n",
        "a a\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The massage here was very powerful and really lightened my body! !\n\n(Original)\nここのマッサージはめっちゃ力強くマッサージしてくれて、めっちゃ体が軽くなった！！\n\n",
        "Ashish Kumar\nLocal Guide·49 reviews·320 photos\nRated 5.0 out of 5,\n\n\n",
        "陈俐谛\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "JeanClaude Branch\nLocal Guide·198 reviews·425 photos\nRated 4.0 out of 5,\n\n\n",
        "Ha Thu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Takaya Toyokawa\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "zi ye\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "牛牛\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Dayne Iyavoo\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Malcolm Yam\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Kevin Sunga\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Tang Kum San\nNo Past Reviews\nRated 2.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6221 4889\">6221 4889</span>",
    "Website": "http://www.livespa.sg/"
}