{
    "Name": "Massage Master Pte Ltd",
    "Products": null,
    "Address": "341 Bedok Rd, Singapore 469522",
    "Opening Hours": "Saturday 10am–1am\nSunday 10am–1am\nMonday 10am–1am\nTuesday 10am–1am\nWednesday 10am–1am\nThursday 10am–1am\nFriday 10am–1am\nSuggest new hours",
    "Rating": "4.3\n161 reviews",
    "Reviews": [
        "Stephanie Chua\n6 reviews\nRated 5.0 out of 5,\nFirst time visit to Massage master from a friend’s recommendation! Really friendly and professional staff, massage was good and body feels great esp after cupping! Masseuse Jasmine was always checking on me as I had Low tolerance for pain and adjusted the techniques accordingly. Will be patronising more often! Thank you!\n\n",
        "Samantha Wu\n6 reviews·1 photo\nRated 5.0 out of 5,\nI just went to massage master for combi foot and back massage today. The confirmation & booking appointment was fast and upon reaching we( couple) were showed to a private room which was good especially with the current situation when you wish to be away from crowd. Masseuses were professional and the atmosphere in room during the massage was quiet and very relaxing. We fell asleep and thoroughly enjoyed the whole session.\n\n",
        "Velonica Von\nLocal Guide·161 reviews·131 photos\nRated 2.0 out of 5,\nChinese massage technique (they use a lot of elbows) so for those looking for the usual Thai massage, it is not available here. I personally enjoyed the scrub treatment. The environment is not the best out there but it is decent enough.\n\n",
        "Stephanie Chua\n6 reviews\nRated 5.0 out of 5,\nFirst time visit to Massage master from a friend’s recommendation! Really friendly and professional staff, massage was good and body feels great esp after cupping! Masseuse Jasmine was always checking on me as I had Low tolerance for pain and adjusted the techniques accordingly. Will be patronising more often! Thank you!\n\n",
        "Samantha Wu\n6 reviews·1 photo\nRated 5.0 out of 5,\nI just went to massage master for combi foot and back massage today. The confirmation & booking appointment was fast and upon reaching we( couple) were showed to a private room which was good especially with the current situation when you wish to be away from crowd. Masseuses were professional and the atmosphere in room during the massage was quiet and very relaxing. We fell asleep and thoroughly enjoyed the whole session.\n\n",
        "Velonica Von\nLocal Guide·161 reviews·131 photos\nRated 2.0 out of 5,\nChinese massage technique (they use a lot of elbows) so for those looking for the usual Thai massage, it is not available here. I personally enjoyed the scrub treatment. The environment is not the best out there but it is decent enough.\n\n",
        "J Low\nLocal Guide·62 reviews·35 photos\nRated 5.0 out of 5,\nReally good massage and good pricing as well. The masseuse reccommended cupping for my very tense back, and it really became better. Will come back again.\n\n",
        "Naes T\nLocal Guide·49 reviews·99 photos\nRated 4.0 out of 5,\nNice spacious place. Lower pricing during happy hours on weekdays. Massage is subjective. But overall good for me on most visits.\n\n",
        "rina cheong\nLocal Guide·32 reviews·3 photos\nRated 5.0 out of 5,\nMy hubby and I had the oil massage with guasha and war candling services. The masseuse who did the massage for me was great! Nt too hard my 1st experience for ear candling is quite comfy. Will recommend this place for a good and relaxing massage!\n\n",
        "Kelly K\nLocal Guide·84 reviews·677 photos\nRated 5.0 out of 5,\nClean, comfortable and reasonably priced. Great massage by experienced masseuse.\n\n",
        "Ruth Oh\n3 reviews\nRated 5.0 out of 5,\nMy return plc for a good massage. Affordable price esp. during happy hour\n\n",
        "Jim Tan\nLocal Guide·1,164 reviews·13,504 photos\nRated 4.0 out of 5,\nHad a great foot massage by Winnie.\nVisited during happy hour, affordable price and comfortable.\n\n",
        "Ghazali Salleh\nLocal Guide·33 reviews·73 photos\nRated 4.0 out of 5,\nfast and good service. Not the best massage but still good enough to be among top few massage center.\n\n",
        "Noomi Ekland\n6 reviews\nRated 5.0 out of 5,\nGood massage !\nExperienced the 90min body massage with lavender oil  😍🤩\n\n",
        "Joey Tang\n10 reviews\nRated 5.0 out of 5,\nLoved the place! Massage was good. But the cupping was painful lol. Will be back!\n\n",
        "HSL Sofa Maker\n2 reviews\nRated 5.0 out of 5,\nConvenient place with ample parking just at the side. The massage is perfect for me. Right strength on the right spots. I always add on the Fire Cupping and its really a wholesome session that makes you feel relaxed and recharged. Highly recommended and price is just right too! Will definitely come back again.\n\n",
        "Zayden Teo\nLocal Guide·292 reviews·1,141 photos\nRated 5.0 out of 5,\nMy go-to massage place!! Nice and clean environment, prices are reasonable for the service.\n\n",
        "- Ally\n5 reviews\nRated 1.0 out of 5,\nUsed to go to this massage place quite often. However, last two visits  were quite bad. Very painful massage throughout and it has became very a noisy place with staff talking among each other loudly along the corridor or on the phone with speaker on. Not going back anymore.\n\n",
        "adrija banerjee\nLocal Guide·62 reviews·253 photos\nRated 3.0 out of 5,\nThe place is clean and the staff is efficient and courteous. However, if you are looking for a great experience of calm and peace, this is not your place. The rooms are clean and tidy but you often end up hearing the staff chatting up or running along the corridors and it is not the experience which you want while relaxing. Given the price point, there are better parlours around in similar price points.\n\n",
        "Mei ling Ng\n1 review\nRated 2.0 out of 5,\nThe lady masseur was grinding my bones using her elbows instead of massaging. Told her twice it was painful, she said ok ok, but soon after she went back to applying her whole body weight. My whole back is feeling so sore now. Worst massage experience ever.\n\n",
        "Ace Kandar\n27 reviews\nRated 4.0 out of 5,\nExperienced masseuse and cosy ambience. Only gripe is masseuse needs to learn speak basic conversational English. But they are friendly though. Worth the $5/$10 tip.\n\n",
        "Fireblade AU\nLocal Guide·24 reviews·3 photos\nRated 5.0 out of 5,\nI had some spare time in Singapore so got a 2 & 1/2 hour massage (2 hr package + a foot massage). Massage Master has a nice atmosphere, the staff are helpful (to English only speakers such as myself) and the treatment was relaxing. Sore shoulders from carrying heavy luggage are completely relaxed. Thet are professional & polite. I recommend Massage Master in Bedok as a great place to relax & get excellent customer service.\n\n",
        "Norfazirah Sham\n5 reviews·2 photos\nRated 4.0 out of 5,\nWent for the couple's massage on the 18th July.\nTook a package with a combo of foot massage followed by whole body massage. The ambience and room was great, there's a tv to watch movie while having our foot reflexology. The masseuse was great initially for the body massage but towards the end, for mine, while she was massaging my head, i feel like her pressure force decreasing like as though she fell asleep while massaging. Hahaha.. Another friend who went on a different day before me also mentioned the same! We both went during the night like after 9pm on separate occasions. The masseuse seems tired. Maybe its best to go during the day when they're less sleepy or tired. Also, they're Chinese national, so there's a bit of communication break down coz they don't know much english. If you're going, I recommend being vocal when they're not meeting your expectation. However, overall, it's not that bad.\n\n",
        "Jurerat Kongkiattiwong (June)\nLocal Guide·132 reviews·392 photos\nRated 5.0 out of 5,\nVery good place. I just randomly search and came. The place is clean. The massage is a bit painful but very nice esp with the cupping. Very relieved afterwards. I will definitely come back to do more cupping and try other massage\n\n",
        "zermaine fontaine\n69 reviews\nRated 5.0 out of 5,\nLocation: conveniently located at Simpang Bedok.\n\nOutlet: clean, spacious, with shower facility inside the massage room.\n\nService: I was served by Irene who gave me a good massage all over my pain points esp my neck area that was stiff. I think Irene is pretty well trained. I've had bad ones from elsewhere and I can definitely differentiate between a good massage vs a bad one.\n\nActually highly recommended because I was wet from the rain and they let me shower before I commenced the massage. It was very comfortable indeed.\n\nWould go back again definitely since the other plus point is no hard sell! Excellent!\n\n",
        "Qiu yi\n4 reviews\nRated 1.0 out of 5,\nCalled and booked a reservation for 2 at 9pm. 20 mins before (alrdy otw there), they called and said reservation is cancelled as there are other customers, so meaning we are not customers? What's the purpose of reservation? Caller told us nvm, just come. We reached on the dot at 9, waited for ard 20-30 mins (alrdy lie down, prepared in the room) still no one came in yet , went to ask estimated time, they tell us another 15 mins at least?! We decided to just cancel and leave, and the receptionist cant even be bothered about us. Wow, worse service ever.\n\n",
        "joyce teo\n1 review\nRated 4.0 out of 5,\nAtmosphere is good. Room is clean. I have been there twice for body massage. First time is a male masseur, his is quite good but his massage style is Malaysia style which I don't really prefer. Second time I requested for China masseur. She is new from China so her style has not been influenced yet, still keeping to her China style massage. She is good, although not the best compared to real massage in China.\nI doubt they changed the towel because after massage I always feel my skin is oily. I did not use any oil for my massage so it must be from the towel.\n\n",
        "Au Kellumar\n48 reviews\nRated 5.0 out of 5,\nThe service is great! I am one of their regular customers and I usually go here every Saturday.  the place is also relaxing and you can really fall asleep while you are having your full body massage.\n\n",
        "Calvin Choy\nLocal Guide·49 reviews·4 photos\nRated 4.0 out of 5,\nLocated in Simpang Bedok, it is convenient with ample parking on the opposite side of the road. Their therapists hail from China & their style is definitely different from Thai massage. Good, deep strokes that reach deep into the muscles. The rooms are spacious enough & very comfortable with proper beds. Very professional. Prices are reasonable too.\n\n",
        "Philip Mehl\n7 reviews\nRated 5.0 out of 5,\nI’ve been here about 50 times and probably had a massage from every one here. They are all brilliant.\n\n",
        "Dee dee Maple\n2 reviews\nRated 5.0 out of 5,\nNice massage! Good service\n\n",
        "Naveen dharan\n5 reviews\nRated 1.0 out of 5,\nMassage is always awesome- especially Amy. I have been regular customer since 2 year, I wanted to become member. But the service by the receptionist (Mackey) is not warm. She is been rude.\n\nI WON'T GO THERE AGAIN. THEY NEED TO FIX THE CUSTOMER SERVICE!\n\n",
        "Aman Aman\n1 review\nRated 5.0 out of 5,\nVery comfortable place with nice ambience.\nBut more importantly, the massage actually does work for me. I have been having frequent back and neck aches and stiff because of my stressful desk job. Have been going to other parlours but they have not been effective for me. The massage from this parlour is.\n\n",
        "Qusairi Zulkifli\n1 review\nRated 5.0 out of 5,\nEva and Amy is awesome... Hit the pressure point when ur body is really pain, and it feel so lighter and better. This is called real massage. Tell them which part ur pain, they will help to fix it until better...is hard to find gd massage, alot place massage like hell,a that ask for extra service, hate that!\n\n",
        "DK X\nLocal Guide·40 reviews·16 photos\nRated 2.0 out of 5,\nMassage is ok, but the masseurs were extremely talkative even when you don't want to talk. They kept talking non stop to you even when you don't reply. Foot massage supposed to be a relaxing session but they gave me a headache with their chatter.\n\n",
        "Mardhn\nLocal Guide·82 reviews·29 photos\nRated 5.0 out of 5,\nGood full body massage. Im a regular customer. Just tell them your pain, they will help you to heal it fast. Massage on the correct spot.Awesome!\n\n",
        "Carl Parker\n1 review\nRated 1.0 out of 5,\nPaid for 60mins foot massage and got 45mins. Double checked with reception and they told me 5 min foot spa included but there was no foot spa only a tub with water to put my feet in. RIP off!\n\n",
        "Aaron Engel\nLocal Guide·105 reviews·759 photos\nRated 5.0 out of 5,\nGreat service, massage and good prices on simpang bedok. If you live in the area definitely go. Highly recommend the foot massage. The inside is also beautiful and luxurious.\n\n",
        "Rachel Lee\n2 reviews\nRated 5.0 out of 5,\nGreat service, I had the bundle deal and it was exactly what I needed. Was attended to by Helen, she was attentive and applied the right pressure. Will come back again\n\n",
        "Pauline Ong\nLocal Guide·88 reviews·52 photos\nRated 5.0 out of 5,\nAfter a hard day's work, away from hustle and bustle lifestyle, pamper yourself, rest and relax, enjoy foot reflex or body massage by a specialist where your blood circulates and improve and stay healthy, healthy, wealthy and wise. Its now check out at the above.. Massage Master..\n\n",
        "Nur Atiqah Abdul Rahim\nLocal Guide·16 reviews·16 photos\nRated 4.0 out of 5,\nI've always enjoy going there for leg massage. However i think they need to upgrade their wifi or download some movies as there's always trouble streaming online.\n\n",
        "Zargham Khan\nLocal Guide·92 reviews·41 photos\nRated 3.0 out of 5,\nMix up with our booking left us waiting ~1.5hrs for our appointment. Masseuse was rough as guts and was disorganized which made it hard to relax. Proceed with caution.\n\n",
        "Esther Kong\nLocal Guide·92 reviews·65 photos\nRated 5.0 out of 5,\nPricing is not expensive. Provides late night massages if your work shifts. The masseurs are professionals and well trained.\n\n",
        "Shah Indra\n3 reviews\nRated 5.0 out of 5,\nThis my second visit and great place, clean and very tidy.had a couple rooms and great service by Sofia and Jasmine.\n\n",
        "Stephanie Lim\n6 reviews\nRated 5.0 out of 5,\nMy go to place for massage. Tried many others, but still prefer the skills of the therapists here.\n\n",
        "Piyush Chawhan\nLocal Guide·10 reviews·1 photo\nRated 3.0 out of 5,\nClean set up but it's Oriental i.e Chinese style of therapy. I prefer Thai , otherwise this could have been just nice to go to\n\n",
        "Iylia Azmi\n1 review\nRated 5.0 out of 5,\nMassage has the best masseuse, i had the best experience ever never have i felt it before\nMiko the masseuse gave the best massage ever, its worth the money spent\nI would come here again and recommend others to come here\n\n",
        "Rajesh Chandran\n5 reviews·1 photo\nRated 1.0 out of 5,\nUsing elbows to massage even head.very pain full ,such bad massage\n\n",
        "Ken Ong\n13 reviews\nRated 1.0 out of 5,\nWent there on 25th May 19,location is good,the only problem is the attitude of the counter staff was very very rude,went there twice,two times visit and met the same staff, gal wearing spectacle,playing her mobil phone,was told by my friends about her poor attitude toward customer by raising loud voice when asking one two questions and its turn out to be true,we can't even choose the masseuse we like,they only follow by their random sequence masseuse,maybe very old or fat masseuse,any parts above tigh they do not massage,only body and lower  legs...Strongly do not recommend to my friends,will not visit again!!Waste money....No hanky panky.\n\n",
        "Clayton Chua\nLocal Guide·429 reviews·4,768 photos\nRated 5.0 out of 5,\nClean and comfortable place. Massage was professional and decent. Service were reasonably priced.\n\n",
        "Ck Fun\nLocal Guide·42 reviews·4 photos\nRated 5.0 out of 5,\nGreat massage... One of the few rare massage I fell asleep during the process\n\n",
        "Ghazali Salleh\nLocal Guide·46 reviews·15 photos\nRated 4.0 out of 5,\ngood massage good customer service\n\n",
        "Haneyy Joslin\nLocal Guide·28 reviews\nRated 5.0 out of 5,\nAffordable place, comfy massage chairs, friendly staff.\n\n",
        "James quek\n9 reviews·3 photos\nRated 5.0 out of 5,\nOne of the best and comfortable massage place in the east and Singapore.\n\n",
        "Grace Lim\nLocal Guide·137 reviews·53 photos\nRated 5.0 out of 5,\nGood massage place in the east if you want to find a late night massage joint.\n\n",
        "Amber Deux\nLocal Guide·38 reviews·111 photos\nRated 4.0 out of 5,\nNot bad foot massage. This has been featured in @SOT.LOVE follow us for more like this     \n\n",
        "Mudassar Ahmad\n10 reviews\nRated 5.0 out of 5,\nAffordable and good quality massage. Nice decor.\n\n",
        "Vincent Tan\n1 review·9 photos\nRated 5.0 out of 5,\nCozy and great ambience in the heart of simpang bedok. Simply love the touch of strokes for foot reflexology. will return again!\n\n",
        "Madeline Stowe\nLocal Guide·12 reviews·1 photo\nRated 5.0 out of 5,\nAfter the rude staf was fired, the new staff is not only nice and the service vastly improved. I highly recommend this place.\n\n",
        "woon kok whye\n4 reviews\nRated 4.0 out of 5,\nThe environment is good and clean.\n\n",
        "MoveInReadySG Sales\n1 review·5 photos\nRated 5.0 out of 5,\nVery good foot reflex place. Great Comfort and quality\n\n",
        "Stan Liu\n1 review\nRated 5.0 out of 5,\nGood point: it’s very relaxing and comfortable. It’s professional training.\nHope to visit next time.\n\n",
        "Anand Batavia\n7 reviews\nRated 5.0 out of 5,\nAmazing professional service..worth the time and money for sure!\n\n",
        "James Rigg\n3 reviews\nRated 5.0 out of 5,\nGreat deep tissue massage.\n\n",
        "Sam Travel from SG\nLocal Guide·105 reviews·903 photos\nRated 3.0 out of 5,\nDecent massage place.\n\n",
        "Tan Jeremy\n5 reviews\nRated 5.0 out of 5,\nV good and professional masseuses\n\n",
        "Melvin Au\nLocal Guide·40 reviews·21 photos\nRated 3.0 out of 5,\nDecent. Conducive. Soothing. Not out of this world for pricing.\n\n",
        "Brandon Wong\n19 reviews·175 photos\nRated 5.0 out of 5,\nKind staff and very welcoming\n\n",
        "Eugene Choo\nLocal Guide·68 reviews·162 photos\nRated 5.0 out of 5,\nThey have late owl discount past midnight\n\n",
        "Suresh Ramachandra\nLocal Guide·59 reviews\nRated 5.0 out of 5,\nVery good service..  value for money\n\n",
        "James Rigg\nLocal Guide·10 reviews·1 photo\nRated 5.0 out of 5,\nReally great massage!\n\n",
        "Kickoff\n2 reviews\nRated 5.0 out of 5,\nCounter is polite and cheerful. masseurs are professional. 5 stars!  I love their massage!\n\n",
        "Jace Chia\nLocal Guide·45 reviews·39 photos\nRated 4.0 out of 5,\nClean Environment.  Experienced massuer.\n\n",
        "Jay M\n1 review\nRated 4.0 out of 5,\nIs coco still working here?\n\n",
        "Farhan Fadillah\nLocal Guide·41 reviews·13 photos\nRated 5.0 out of 5,\nA highly recommend massage place\n\n",
        "Eife\n12 reviews·2 photos\nRated 5.0 out of 5,\nAlways the best with Nicole.\n\n",
        "Luci Le\n3 reviews·2 photos\nRated 4.0 out of 5,\nNice spa and massage!\n\n",
        "Chris Yap\n1 review\nRated 3.0 out of 5,\nSo so\n\n",
        "Rohaizad Bin Mohamed\nLocal Guide·56 reviews·3 photos\nRated 5.0 out of 5,\nGreat message place\n\n",
        "Deema Yanni Ma'at\nLocal Guide·554 reviews·433 photos\nRated 3.0 out of 5,\nnext to simpang bedok\n\n",
        "Talos Tan\nLocal Guide·13 reviews·36 photos\nRated 5.0 out of 5,\nGood Masseur.\n\n",
        "Ee Chuan Kiew\nLocal Guide·27 reviews·52 photos\nRated 2.0 out of 5,\nLousy massage\n\n",
        "Kwok Candy\nLocal Guide·16 reviews·9 photos\nRated 5.0 out of 5,\nGood massage. Enjoy\n\n",
        "QQ Kaze (Game)\nLocal Guide·7 reviews·12 photos\nRated 5.0 out of 5,\n(Translated by Google) The second time I came to massage Master, the masseuse has a very professional level and knows how to find acupuncture points to prescribe the right medicine, and also recommends scraping or cupping. PS (I am …More\n\n",
        "Loo l 87Ytommy0E low\nLocal Guide·16 reviews·17 photos\nRated 5.0 out of 5,\n(Translated by Google) The masseur's technique is very traditional\n\n(Original)\n按摩师的技术很传统\n\n",
        "Rafidah Ramli\nLocal Guide·26 reviews·35 photos\nRated 4.0 out of 5,\n\n\n",
        "Fidd Osman\n6 reviews\nRated 5.0 out of 5,\n\n\n",
        "xiaojun\nLocal Guide·19 reviews·21 photos\nRated 4.0 out of 5,\n\n\n",
        "Francis Tan\nLocal Guide·3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Joyce Koh\nNo Past Reviews\nRated 2.0 out of 5,\n\n\n",
        "Christopher Dorai\nLocal Guide·26 reviews·69 photos\nRated 5.0 out of 5,\n\n\n",
        "SiongYong Ang\nLocal Guide·40 reviews\nRated 4.0 out of 5,\n\n\n",
        "James Hong\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6702 0762\">6702 0762</span>",
    "Website": "http://www.massagemaster.com.sg/"
}