{
    "Name": "Massagez Kaki Wellness",
    "Products": {
        "SB96": "$88.00",
        "2021 new combo 1st Trials": "$38.00 – $58.00",
        "Camellia Oil 50ml": "$50.00"
    },
    "Address": "888 plaza, Woodlands Drive 50, 01 731B, 730888",
    "Opening Hours": "Saturday 11am–10pm\nSunday 11am–10pm\nMonday 11am–10pm\nTuesday 11am–10pm\nWednesday 11am–10pm\nThursday 11am–10pm\nFriday 11am–10pm\nSuggest new hours",
    "Rating": "4.9\n125 reviews",
    "Reviews": [
        "norani othman (nor othman)\n8 reviews\nRated 5.0 out of 5,\nI have used their services for the past few years and the store has recently undergone a renovation. There is only space for 3 reflexology clients and 2 massage beds which meant you have to make a booking prior to your visits. I like it because there is space to move around and you are not cramped together. The masseurs are skilled and friendly and know how to untie knots in your body and feet. They have a membership package but they don't push it aggressively. Highly recommended.\n\n",
        "Yannyy c\n3 reviews\nRated 5.0 out of 5,\nCosy and more comfortable after  renovation recently. All staffs are friendly and skillful. Always feel good after massage and really address the stiff issue, Reasonable price. Highly recommend!\n\n",
        "Fiq Adella\n4 reviews·2 photos\nRated 5.0 out of 5,\nHave been a member since 2018.\nRenewed over the years. Never trusted neighborhood massage parlour much but tried on this one the 1st time back in 2018. Never regret my decision to join member ever since then.\n\nFriendly and approachable staff. From senior team leader Gary, to senior staff David, Iqa, Ah Meng, and Uncle Ken. Ex staff, Sam. We know them all too well.\n\nTheir skills all differs yes, definitely. Some are new some are seniors. No doubt, all their skills and knowledge are good in terms of pressure points, pressure applied, understanding of muscles aches, advices on health, are acceptably good.\n\nSome people may not like it, but its personal preference really. We love it, not only because of their painful massage which works but their warm welcome hospitality and service towards all their customers.\n\nPic 1 : Gary working on my feet\nPic 2 : David on my hubby\n\n",
        "norani othman (nor othman)\n8 reviews\nRated 5.0 out of 5,\nI have used their services for the past few years and the store has recently undergone a renovation. There is only space for 3 reflexology clients and 2 massage beds which meant you have to make a booking prior to your visits. I like it because there is space to move around and you are not cramped together. The masseurs are skilled and friendly and know how to untie knots in your body and feet. They have a membership package but they don't push it aggressively. Highly recommended.\n\n",
        "Yannyy c\n3 reviews\nRated 5.0 out of 5,\nCosy and more comfortable after  renovation recently. All staffs are friendly and skillful. Always feel good after massage and really address the stiff issue, Reasonable price. Highly recommend!\n\n",
        "Fiq Adella\n4 reviews·2 photos\nRated 5.0 out of 5,\nHave been a member since 2018.\nRenewed over the years. Never trusted neighborhood massage parlour much but tried on this one the 1st time back in 2018. Never regret my decision to join member ever since then.\n\nFriendly and approachable staff. From senior team leader Gary, to senior staff David, Iqa, Ah Meng, and Uncle Ken. Ex staff, Sam. We know them all too well.\n\nTheir skills all differs yes, definitely. Some are new some are seniors. No doubt, all their skills and knowledge are good in terms of pressure points, pressure applied, understanding of muscles aches, advices on health, are acceptably good.\n\nSome people may not like it, but its personal preference really. We love it, not only because of their painful massage which works but their warm welcome hospitality and service towards all their customers.\n\nPic 1 : Gary working on my feet\nPic 2 : David on my hubby\n\n",
        "Heryadi Ngajeri\n4 reviews·18 photos\nRated 5.0 out of 5,\nExcellent pair of hands . A very trusted chap who never fail to deliver an excellent time of massage\n\n",
        "Hui Jie Heng\nLocal Guide·96 reviews·119 photos\nRated 5.0 out of 5,\nVery beneficial first visit at Massagez Kaki yesterday. The master was skillful in loosening my stiff neck and shoulders and even gave me tips to live healthier. Felt the care for my wellbeing on top of providing service. Such a wonderful find in the neighbourhood, I will be back again! ;)\n\n",
        "Sok Leng Tay\n1 review·1 photo\nRated 5.0 out of 5,\nGary is good with his skills and he makes you feel comfortable in a new setting easily. Ika has good skills and strength as a lady practitioner! 👍\n\n",
        "Mandisa Toh\nLocal Guide·55 reviews·182 photos\nRated 5.0 out of 5,\nFirst visit and was totally impressed with masseur's skill.\n\n",
        "Chris Chan\nLocal Guide·51 reviews·35 photos\nRated 4.0 out of 5,\nSmall shop, foot reflex was pretty good. Value for money for long term/ regular customers, cos got member discount\n\n",
        "Neo Neo\n1 review\nRated 5.0 out of 5,\nI very much enjoyed the attention to detail when adjusting various parts of the body and stretching or massaging based on what’s needed, and in a way that can actually help your pain points feel better. In comparison to other massages shop, my experience here felt way more therapeutic and the most important factor is the price is reasonable.\n\nI highly recommend and will definitely be returning! Thanks to my masseuse Mr Gary😊\n\n",
        "Siew Yin Chew\n3 reviews\nRated 5.0 out of 5,\nMasseurs skills are really good.and friendly. The price is reasonable and so far cheapest I have tried in Singapore. Additionally Gary's skills is excellent. My mum (89years old) enjoyed the massage very much. Strongly recommended to come try for yourself.\n\n",
        "Cass\n1 review\nRated 5.0 out of 5,\nComfortable and skillful. Knowing that I had a fall, the masseur, Gary exert the right amount of force.\n\n",
        "Kou Cai Tan\nLocal Guide·21 reviews·11 photos\nRated 2.0 out of 5,\nSaw 90 over 5 star reviews and was eager to try. Sadly the experience paled in comparison. Opted for an hour body as my body was aching from sports.\n\nStrength was good but didn't quite hit the right spots. Pressure applied was inconsistent towards the 2nd half of the massage. She barely used any strength when massaging the left it band area. Right calf, hip and it band was skipped for some unknown reason.\n\nWill return for a massage by the widely praised Mr Gary next time. Hope to get a better experience and will update this review\n\n",
        "Ardriza Isnin\n1 review\nRated 5.0 out of 5,\nDavid is a good physiotherapist that can address client’s physical problems.\nWell done!\n\n",
        "Xian Ling\n1 review\nRated 5.0 out of 5,\nThis is a place I always will visit as it relaxed me when I have some sleeping & headache issues. The masseur, Gary is able to help in releasing the tiredness. Besides, with my leg condition, the masseur is also able to find the pressure point to release the pressure. All the staff are friendly, helpful and thoughtful. I enjoyed every session and will visit minimally 1 time a month. Strongly recommend to visit this shop. Massagez Kaki Wellness\n\n",
        "Wei Wei Lim\n4 reviews\nRated 5.0 out of 5,\nGem spot in woodlands 💎 Spotted this place after covid hit Singapore and crossing the border is not allowed anymore. Glad that I have found this place to ease my backache since WFH has actually caused longer working hours. No hard selling and pricing is reasonable! Decided to be a member after several visits. I prefer massuer with more strength so usually I will find Gary or Ah Ming 👍🏻 Friendly and their skills never disappoint me\n\n",
        "Meryl Bear\n1 review\nRated 4.0 out of 5,\nVery skillful & affordable! Feels relaxed after every massage!\n\n",
        "Prahlad Kunalan\n1 review\nRated 5.0 out of 5,\nI've searched high and low for massage that actually goes into the muscle and not just piano massage. The staff here give real massage and a re very professional. Mr Gary is exceedingly good and should be given a raise. The female staff are equally adept. I have very bad legs due to sports and they've managed to fix my issues. Can finally feel blood circulation again. I stumbled upon them and have been back more than 5 times.\n\n",
        "Ah Lin (imm)\n1 review\nRated 5.0 out of 5,\nThis is the right place for leg massage. Ever since I came here to try the leg massage, I will make sure every week I will come here at least once. Especially when I do vigorous workout like tabata.\nWalk in possibility quite slim cos their schedule quite packed. Unless you want to wait for some time. If wanna come I will suggest you to make an appointment.\n\n",
        "sean leong\n1 review\nRated 5.0 out of 5,\nReasonably priced and professional therapist. Most importantly left feeling much better than before. Will definitely go back again!\n\n",
        "Karen Cheng\n2 reviews\nRated 5.0 out of 5,\nIt is the best massage visited by far and have been receiving treatments for  3 years. All the staff are polite and friendly. The senior staff are especially very experienced and skillful. They know clearly which are the areas that need to focus each time, whether is it body or foot massage. Feeling much relief from the muscle/neck strain and ache with every round of treatment. Thumb up and thank you! :)\n\n",
        "Shivika Mahtani\n2 reviews\nRated 5.0 out of 5,\nThis massage place is beyond 5 star! Very very good service and people! Always care for your needs. Never worry about time and being tired. Always care for the customer ! I always come back here! Been years now i keep renewing my membership! Try them out ! Keep going guys! Hard working!!\n\n",
        "Maggie Oh\n4 reviews·3 photos\nRated 5.0 out of 5,\nThe skills of the masseurs are really good. It’s really rare to find a massage parlour that has all the masseurs with excellent skills. I have been visiting for more than a year already. Strongly recommend to come if you need a good massage and look for Gary, David or Ah Meng.\n\n",
        "Zul Md Isa\n2 reviews\nRated 5.0 out of 5,\nI,ve been a regular customer to Massage Kaki since they open their doors in Woodlands...\nWhen you enter their establishment, you will feel welcome not only because of the ambiance but also because of the friendliness of the staff...\nProfessional masseuse both man/lady cater to the needs of your tiresome body..\n\n",
        "Fadzilah Mk\n1 review\nRated 5.0 out of 5,\nGary, Kenti, Ikah & Ming, wow all of them are very professional. They are good in the way they understand my needs and massage accordingly. Every time  I call the shop for an appt, they always find a suitable time for me. Good services! I LOVE THE MASSAGE HERE! THANK YOU🙂\n\n",
        "Aikawa Kazuhiko\n1 review\nRated 5.0 out of 5,\nGood massage experience. Staff are friendly and accommodating, you can request to increase/decrease the strength. I don't often frequent massage kaki due to busy work schedule but the staff here still remembers me.\n\n",
        "Lyn Gan\n1 review\nRated 5.0 out of 5,\nGreat in relieving tight muscles and aches. Flexible and reliable staffs that always accomodates to our timing as much as possible. Well recommended neighbourhood massage service! Prebook in advance to prevent disappointment as they are usually full house 👍🏻👍🏻👍🏻\n\n",
        "Khairun Nurliyanah\n3 reviews\nRated 5.0 out of 5,\nRecommended: Gary.👍👍👍👍👍\nBooked an appointment on the day itself.  Experience it for the first time it was so good. He hit on the right point at my legs and upper back which was painful. Good to give a trial for first timer at $38. Subsequently, I signed on the  member package because it was so much worth it. Go go try! ✌✌ I felt more relaxed after. Most important are staffs are soo friendly!\n\n",
        "jordan wong\n2 reviews\nRated 5.0 out of 5,\nThe staffs are very friendly and accommodating. Have been coming here for my leg/body massages. It’s affordable and definitely worth the price that is paid for. The staffs are experience and really help to release the knots and tension in the muscles of the body.\n\n",
        "LX\nLocal Guide·16 reviews·15 photos\nRated 5.0 out of 5,\nWent down for the first trial $38 for 40min foot and 20min massage, and was welcomed very warmly by the staff Ah Meng. 888 plaza shop was simple and cosy with 3 foot massage chairs and 3 beds, and 1 shoulder massage chair. Our masseuses were Ah Zhen and Ikah, who were both excellent and targeted all the right points. We have been to many massage shops in Singapore and were blown away by the level of expertise, and immediately signed up as members ($68 for one year and includes a free 40min body + 40min foot massage). We really appreciate how honest this business is ran, as they do not sell packages and the membership scheme is perfect for regulars who can get some savings without spending a bomb to  buy a package. Prices are very reasonable too!\n\n",
        "Zahirah Aishah Ismail\nLocal Guide·15 reviews·74 photos\nRated 5.0 out of 5,\nI did reflexology and the masseuse is good. This is my 2nd time visit.\n\n",
        "Mai M.S\n1 review\nRated 5.0 out of 5,\nMy first experience just now with Uncle Ken was good.. he is very friendly.. i take the first trial of 40 minutes foot massage n 20 minutes of upper shoulder back massage.. feeling much better now..before my feet was so tired n painful due to my previous ankle sprained. Definitely will come back again next month n will take up d membership.. Thank you Uncle Ken n Gary!\n\n",
        "Zarina Esa\n1 review\nRated 5.0 out of 5,\nI went there for the first time for foot issue\nLipping as walk , I told one of the staff a Malay gurl\nShe understood my problem. She was Soo sweet friendly polite we had good conversation all tru the\nSession and she did a great job.... I was  Soo happy and satisfied and I keeps on saying thank you to her\nHer name tika I think . Honestly all 3 of them are very polite and friendly. I recon to all my nieces and sisters to go there . Thank you so much\nI will come back\n\n",
        "Junhao Cai\n7 reviews\nRated 5.0 out of 5,\nFriendly staff and cozy environment. Was served by Ah Zhen and she was skillful in finding the muscle knots and relieved my neck and back pain. Reasonable pricing. Well recommended!\n\n",
        "Mulan Tay\n1 review\nRated 5.0 out of 5,\nI am very fortunate that Massagez Kaki is just next to my blk. I like to go Massagez Kaki (888 Plaza), not only because it's near,  most importantly their staffs are very friendly and skillful too. Always feel relief after the treatment.  I have been joining their membership for 3 years with NO REGRETS!\n\n",
        "Usha Devi\n2 reviews\nRated 5.0 out of 5,\nI had a good time feeling better after foot and body massage . I got recommended by my colleague to go here indeed I made a good choice by coming here. Massaged  by a  lady named Ah Sen is good definitely will come here again😄\n\n",
        "irene png\n1 review\nRated 5.0 out of 5,\nGood service and skillful masseurs.\nMy usual place for massage.\nReally relieve my tired and ache body.\nStrongly recommend this place if you want a good leg or body massage. 😊😁\n\n",
        "Junaidah Ramlee\n2 reviews\nRated 5.0 out of 5,\nMe and my family members have been coming to this place for a year.\nAll of them very professional,friendly and are very very good...strongly recommend this place for people who need good massage and to help with any pain.\nThumbs up to ah ming and all team members\nEspecially for their hardwork during this covid19 period!\n\n",
        "Chermaine Kumar\n5 reviews·2 photos\nRated 5.0 out of 5,\nhave been here a few times. one of the rare places where masseuses provide consistent quality each time even though its a different person every time. they also know where the problem areas are. affordable and friendly service. thank you!\n\n",
        "Noi bugis\n1 review\nRated 5.0 out of 5,\nMost of the masseures there at massage kaki are very dedicated and very good. I have been a regular customer at massage kaki for years. I have indeed recommended some of my colleagues to this place. In fact, almost every fortnight i will go to massage kaki.\n\n",
        "Yus Lynn\n11 reviews·22 photos\nRated 5.0 out of 5,\nVery friendly staff. Feels homely and cosy.\nAlways had a great massge on every visits.\nWoodland residents should try thier massage services. Call and book early for appointment.\n\n",
        "Ewan McRidz\nLocal Guide·88 reviews·17 photos\nRated 5.0 out of 5,\nFavourite massage place ever! As a massage enthusiast, these guys have standard. Most times are good and communicative.\n\n",
        "Toh Shufen\n1 review\nRated 5.0 out of 5,\nThe staffs are very friendly and they provide excellent service. It’s a good place to come and unwind the body. I feel good after every massage session. Highly recommended.\n\n",
        "Yang Yang\n2 reviews\nRated 1.0 out of 5,\nSaw good reviews thus made an appt for the outlet at 888 plaza as I reali needed Tuina for my stiff shoulder... It was my 1st time there n staff was polite... Had opted for the Combo $38 which was for 20mins back n 40mins leg then staff asked if I prefer 30/30 cos it's near to closing time which I said OK since is total 60mins anyway... Ended up paying 48 instead cos they said 30/30 is another combo which I wasn't even informed B4 hand so it juz doesn't seem honest to me thou he said sorry he forgot to tel me 🙄... Not only I had to pay more for nth it seems to make my shoulder worse.. Shoulder was stil so stiff n hurts so much that I couldn't slp well for past 2 days n ya now I have to spend another amount to visit another Tuina master...\n\n",
        "Janis Tan\n1 review\nRated 5.0 out of 5,\nI came here for almost 2 yrs for body and foot massage.Their service is good and staffs are friendly too... .\n\nBe a member also have member price on cheaper rates and birthday month will have 50% off too..\n\nEnjoyed their service. 👍\n\n",
        "Faizal Mazlan\n10 reviews\nRated 5.0 out of 5,\nAwesome massage good pricing nice aroma\n\n",
        "Amitha Fernando\n16 reviews·1 photo\nRated 5.0 out of 5,\nsmall but clean with very professional staff. they use the right pressure and I always feel refreshed after a visit!\n\n",
        "Nic\n4 reviews·1 photo\nRated 5.0 out of 5,\nThe masseurs are skilled and professional. Highly recommend if u are looking for a place to rest and relieve ur aches. The environment is comfortable too!\n\n",
        "Melissa Lim\n4 reviews\nRated 5.0 out of 5,\nNo hard selling. True skills! Was a wonderful first time and lifted my month-long fatigue off in just a 40 minute massage. Will definitely be back!\n\n",
        "Nancy Lim\n2 reviews·3 photos\nRated 5.0 out of 5,\nI have never regretted to get to know this massage kaki. I was introduced by TCM tuina teacher.  He strongly recommend me when I had a very bad back n right leg pain. I was treated very well with their tok gong skill.   I strongly recommend most to try their skill. 💪💪💪\n\n",
        "Eunice Chian\n3 reviews\nRated 5.0 out of 5,\nStaffs are friendly and polite! Very skillful and experienced. One of the best massage service I have experienced\n\n",
        "hairini Hamzah\n2 reviews\nRated 5.0 out of 5,\nWe have been coming here for our night massages (legs and body) for more than a year...the team of masseurs are quite accommodating and will provide advices too!!!  Will definitely continue to come!\n\n",
        "Carina Hang\n3 reviews\nRated 5.0 out of 5,\nThe skills of the masseurs are really good. Very friendly staff. Will come every week. Highly recommended.\n\n",
        "Aalisha R\n1 review\nRated 5.0 out of 5,\nThey have very friendly and knowledgeable staff. Excellent service rendered every visit at affordable rates. Clean and comfortable space\n\n",
        "Wayne Lee\n4 reviews\nRated 5.0 out of 5,\nThe masseurs have great skills and are honest in their conversations with the customers. Loving the vibes,\nwill come back again 😊👍🏼\n\n",
        "Jann Leong\n1 review\nRated 5.0 out of 5,\nVery friendly and professional people should come and give it a try\n\n",
        "Clement Ong\n1 review\nRated 5.0 out of 5,\nRecommended place to be for a high value foot and body reflexology! Have been a customer for many years. If you are serious about your health and wellness, this is the place. No regrets!\n\n",
        "Lindy Tan\nLocal Guide·119 reviews·3,159 photos\nRated 5.0 out of 5,\nVery good massage. Good strength and customer service. Will definitely be return customer\n\n",
        "Tan Kok Hin\n1 review\nRated 5.0 out of 5,\nHas been a member for almost 2 years. Staff are friendly, very skillful and experienced, prices are very reasonable as well. Highly recommended.\n\n",
        "Low Boonkiat\n1 review\nRated 5.0 out of 5,\nHave been a member for past 3 years. This is my go to place after my weekly soccer session. Kudos to the team: gary, ming, uncle ken, botak n the rest!\n\n",
        "Kevin Khoo\n2 reviews\nRated 5.0 out of 5,\nBeen visiting them regularly for 2+ years\nSolved a lot of my muscle ache problems\nGood service and pricing.\nHighly recommended.\n\n",
        "Khairul Asyfar\n1 review\nRated 5.0 out of 5,\nBeen here since they open up till now. Very friendly stuff, professional, good advice, cheap memberships price & promotions.\n\n",
        "Max See Jia Ying\n3 reviews·1 photo\nRated 5.0 out of 5,\nFantastic skill from Gary. Friendly and very responsive to my requirement when having foot  massage.Highly recommended.\n\n",
        "Raymond Chew\n1 review\nRated 5.0 out of 5,\nHighly recommended. Providing excellent massage  service from Gary and Ming!!\n\n",
        "Jack Chung\n9 reviews\nRated 5.0 out of 5,\nLocation is convenient (car park just beside), shop is clean and comfortable, their staff is friendly and massage skill is very professional...highly recommended\n\n",
        "rYanti rAh\n2 reviews\nRated 5.0 out of 5,\nGreat service    Monthly massage w the hubs is definitely a must here!\n\n",
        "Rina Rai\n1 review\nRated 5.0 out of 5,\nHad a fantastic massage.. Ika & Jeremy highly recommended.👍\n\n",
        "Brian Koh\n3 reviews·2 photos\nRated 5.0 out of 5,\nAn amazing experience with the staff at this branch\nAlways come here for their massage\nGood job\nKeep it up 👍\n\n",
        "Bernadette Goh\n5 reviews\nRated 5.0 out of 5,\nGary is one of the BEST masseur that I have encountered over these few years. Must TRY!\n\n",
        "chai bih yi\n1 review\nRated 5.0 out of 5,\nGreat service and professional skill with the staff especially ah Ming @amk brunch, friendly staff Gary.\n\n",
        "faizal syed\n3 reviews\nRated 5.0 out of 5,\nSuperb massage and cosy ambience. Highly recommended!\n\n",
        "VINCENT KONG\n1 review\nRated 5.0 out of 5,\nHere massage very good, price reasonable and good service.\n\n",
        "Vincent Lee\n1 review\nRated 5.0 out of 5,\nI've been coming for the past 2 years. These guys are experienced and skilful, consistent and reliable. Great.\n\n",
        "Alice Lim\n1 review\nRated 5.0 out of 5,\nSkills are consistant across their masseurs. Friendly and accomodating, sincere and reliable!\n\n",
        "aikiang chua\n1 review\nRated 5.0 out of 5,\nVery good customer service. Skill is great. Price is very reasonable\n\n",
        "Carolyn TAN\n1 review\nRated 5.0 out of 5,\nFirst visit here, staff is friendly and polite, service is good and affordable. Highly recommended.\n\n",
        "Raymond Liew\n1 review\nRated 5.0 out of 5,\nI enjoyed very much Ah Meng & Gary their professional service.  5 stars for ah meng.\n\n",
        "Nor Zaika\n1 review\nRated 5.0 out of 5,\nSkillful masseurs over at woodlands branch esp Gary n David. My place to go for foot reflex.\n\n",
        "Grace Chan\n1 review\nRated 5.0 out of 5,\nFriendly masseurs with great skills! Highly recommended (:\n\n",
        "LYNN LIM\n1 review\nRated 4.0 out of 5,\nExperienced and professional masseurs. Target your problematic areas.\n\n",
        "Gladys Ong\n1 review·26 photos\nRated 5.0 out of 5,\nGood place to go to..\nClean and comfortable environment..\n\nHighly recommend to look for Gary and Ah Ming\n\n",
        "tan lifang\n1 review\nRated 5.0 out of 5,\nGood massage place....love it\n\n",
        "Lee Mark\n1 review\nRated 5.0 out of 5,\nGreat value and good massage service\n\n",
        "Mei Hwei\n2 reviews\nRated 5.0 out of 5,\nOverall, their service is good. Most of them are skilful and I am enjoying it very much.\n\n",
        "Tiffany Goh\n2 reviews\nRated 5.0 out of 5,\nStaffs are great and friendly! Prices are also affordable too. 😃👍\n\n",
        "ng agnes\n1 review\nRated 5.0 out of 5,\nExcellence service and experience massage shi fui\n\n",
        "Thia C S\nLocal Guide·18 reviews\nRated 4.0 out of 5,\nVery skillful and knowledgeable\n\n",
        "Mavericks Chong\n2 reviews\nRated 5.0 out of 5,\nMassagez Kaki is a good Massage Shop,high recommended\n\n",
        "Yogas Ganesan\n2 reviews\nRated 5.0 out of 5,\nTheir service crew staff are really doing a good job!!\n\n",
        "Nedu Maran\n1 review\nRated 5.0 out of 5,\nMore relaxed and relieved pain after 3 months.\n\n",
        "Lo Edmund\n14 reviews\nRated 5.0 out of 5,\nA masseur i followed for 5 years.\n\n",
        "Kim Ha Too\n1 review\nRated 5.0 out of 5,\nService is good & price is reasonable\n\n",
        "poohpooh the pooh\n2 reviews\nRated 5.0 out of 5,\nGary is the best ..... worth the money spend 😄😄\n\n",
        "Esmond Lee\n6 reviews\nRated 5.0 out of 5,\nGood, nice and friendly staff!!\n\n",
        "Edmund\n7 reviews\nRated 5.0 out of 5,\nSkilled masseuse worth trying\n\n",
        "andrei tan\nLocal Guide·37 reviews·59 photos\nRated 5.0 out of 5,\n5 Star to Gary.\n\n",
        "Germaine Fang\n3 reviews·6 photos\nRated 5.0 out of 5,\nGary with good skill.\n\n",
        "jason Phang\n1 review\nRated 5.0 out of 5,\nGood service, Good skill👍👍👍\n\n",
        "longshao Shuai\n2 reviews·1 photo\nRated 5.0 out of 5,\nGood skill and power\n\n",
        "MK Google\n1 review\nRated 5.0 out of 5,\nGreat massage\n\n",
        "Saharudin Md Ali\n1 review\nRated 3.0 out of 5,\nSurrounding good\n\n",
        "Cindy Tham\n1 review·1 photo\nRated 5.0 out of 5,\n(Translated by Google) Ah Ming, Gary, David, Ken, and Ikah each have their own methods. The massage technique was very good and in place helped me solve the problems of back pain and foot pain. Very recommended👍👍👍\n\n(Original)\nAh Ming,Gary,David, Ken,Ikah  各有各的手法。按摩手法很好很到位帮我解决了背痛和脚痛问题。非常推荐👍👍👍\n\n",
        "Angelia Ng\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Massage 💆 First class\nFirst-rate service attitude\nIf you want first-class service, you should come to Massagez Kaki\nGet some kakil to Massagez Kaki to enjoy first-class service\nThe two massage masters, Gary and Ming Ge are very professional in massage techniques.\n\n(Original)\n按摩💆一流\n服务态度也一流\n想要一流的服务就要来Massagez Kaki\n找几个kakil来Massagez Kaki 来享受一流服务吧\n两位按摩💆‍♂️师，Gary和明哥的按摩技术都很专业。\n\n",
        "Chris JiaQi\n4 reviews\nRated 5.0 out of 5,\n(Translated by Google) The techniques of each masseuse are great, and the people are very nice👍\n\n(Original)\n每个按摩师的技术都很棒、人也很nice👍\n\n",
        "Hui Ngiun chin\n4 reviews\nRated 5.0 out of 5,\n(Translated by Google) First-class massage skills👍🏻👍🏻\nPeople are also super friendly\nWill come again next time\n\n(Original)\n按摩手艺一流👍🏻👍🏻\n人也超友善的\n下次还会再来\n\n",
        "Mei Xin Chan\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) Acupoint selection is quick and acupressure is applied to massage.\n\n(Original)\n取穴技巧快速,穴位指压按摩。\n\n",
        "芬妮Tee\n1 review·2 photos\nRated 5.0 out of 5,\n(Translated by Google) Service👍Attitude✌Hand pressure is good🙌\n\n(Original)\n服务👍态度✌手压不错🙌\n\n",
        "Hype xvx\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Brian Chan\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Raymond Liew\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ng Leng\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jang Man\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Yazid Abdul Samat\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ziggernaut Comlagger\n5 reviews·16 photos\nRated 5.0 out of 5,\n\n\n",
        "Vigalise\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "chantelle Wi\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Rafael Yazid\n1 review\nRated 5.0 out of 5,\n\n\n",
        "shamala chelva raja\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Annie Tan\nLocal Guide·29 reviews·290 photos\nRated 5.0 out of 5,\n\n\n",
        "AlynxGamerx\n8 reviews·8 photos\nRated 5.0 out of 5,\n\n\n",
        "Lee Christine\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6363 0813\">6363 0813</span>",
    "Website": "https://massagez-kaki-wellness.business.site/?utm_source=gmb&utm_medium=referral"
}