{
    "Name": "Massagez Kaki Wellness AMK",
    "Products": null,
    "Address": "532 Ang Mo Kio Ave 10, #01-2499 Cheng San Centre, Singapore 560532",
    "Opening Hours": "Saturday 11am–10pm\nSunday 11am–10pm\nMonday 11am–10pm\nTuesday 11am–10pm\nWednesday Closed\nThursday 11am–10pm\nFriday 11am–10pm\nSuggest new hours",
    "Rating": "5.0\n49 reviews",
    "Reviews": [
        "Valerie Toh\n4 reviews\nRated 5.0 out of 5,\nReally great massage. Masseuse were really friendly and did a good job rubbing away all the knots in my back and shoulder. They were also really knowledgeable in pressure points etc. Will definitely revisit.\n\n",
        "Terence Chan\nLocal Guide·85 reviews·56 photos\nRated 5.0 out of 5,\nVery friendly and skilled masseurs. Very good value for money too. The day we booked only had 1 staff designated at the outlet. However they made the effort to arrange for 1 more staff who came down all the way from their Woodlands outlet so my girlfriend and I could book our preferred slot. We train HIIT & weights quite often and the masseurs were able to loosen all our knotted muscles. Will surely be coming back regularly!\n\n",
        "Eileen Lim\n1 review\nRated 5.0 out of 5,\nHighly recommend, I forget to ask the name. But his professional amazed me. Good strength, worth the price. Will go back definitely:)\n\n2nd time to massagez kaki, Ah Ming is the one who give as good massage as David... Nice place, good massage from both of them... Thumb up\n\n",
        "Valerie Toh\n4 reviews\nRated 5.0 out of 5,\nReally great massage. Masseuse were really friendly and did a good job rubbing away all the knots in my back and shoulder. They were also really knowledgeable in pressure points etc. Will definitely revisit.\n\n",
        "Terence Chan\nLocal Guide·85 reviews·56 photos\nRated 5.0 out of 5,\nVery friendly and skilled masseurs. Very good value for money too. The day we booked only had 1 staff designated at the outlet. However they made the effort to arrange for 1 more staff who came down all the way from their Woodlands outlet so my girlfriend and I could book our preferred slot. We train HIIT & weights quite often and the masseurs were able to loosen all our knotted muscles. Will surely be coming back regularly!\n\n",
        "Eileen Lim\n1 review\nRated 5.0 out of 5,\nHighly recommend, I forget to ask the name. But his professional amazed me. Good strength, worth the price. Will go back definitely:)\n\n2nd time to massagez kaki, Ah Ming is the one who give as good massage as David... Nice place, good massage from both of them... Thumb up\n\n",
        "Peh Jia Yi\n1 review\nRated 5.0 out of 5,\nI’ve came here for a total of 4 times and will definitely keep coming again. All of the masseur (Gary, David & Ming) are really skilled and friendly. Each visit makes me feel like all my muscles are relaxed. I also signed up for membership for its perks. It offers 1 time FOC massage after signing up and will subsequently offer membership pricing instead of usual price. There’s a complimentary 50% off birthday month too.\nWill strongly recommend to try this place out.\n\n",
        "K\nLocal Guide·17 reviews·7 photos\nRated 5.0 out of 5,\nI decided to give Massagez Kaki a try after reading the good reviews and I've no regrets. Although it's a small and simple set up tucked within a rather quiet part of AMK, the centre was cozy and brightly lit (not a sleazy kind of place), and Gary was very friendly and professional. I felt at ease despite being there for the first time and having a male masseur. The massage really helped to loosen my tight muscles. I'll definitely be back since I've signed up for the membership as well.\n\n",
        "DK\n1 review\nRated 5.0 out of 5,\nExcellent service, professional and knowledgeable masseurs that are able to resolve my aches and pain. They provide both leg and body massages at very reasonable prices. I have been very particular and high standards about massages, searching for good masseurs all over Singapore. Finally found this place. The staff are well trained, and each time I go for the service, I find that they put their heart to serving the customer. I also like the fact that it is a open concept, so that everything is proper and transparent. Highly recommended.\n\n",
        "Max See Jia Ying\n3 reviews·1 photo\nRated 5.0 out of 5,\nGibe a try at Amk branch Massager .\nAh meng and David.\nBoth are well trained.Their Foot Massage skill are among the top best that I ever met.\nThumbs up.\nPrice reasonable. worth the value\n\n",
        "aini karim\n5 reviews\nRated 5.0 out of 5,\nFoot reflexology done by Ming. Great & no regrets!! Definitely will comeback again🤗\n\n",
        "Jaclyn Lim\n1 review\nRated 5.0 out of 5,\nFirst time massaging here and the masseur's skills is really superb! (Especially Gary as he knows all the points to help relief tension) Clean and relaxing environment too. Highly recommend!\n\n",
        "Michele Tan\n7 reviews·5 photos\nRated 5.0 out of 5,\nThe staff made u feel welcome, environment cozy n nice too, pricing +skills is good as well, thanks to Gary esp w my upper back, 'crack crack' sounds and fix my back, felt light n relax after that.\n\nDefinitely be back again.\n\n",
        "Jake Tan\n3 reviews\nRated 5.0 out of 5,\nVery cozy and clean place to enjoy a weekend massage after a long work week. Prices are competitive and affordable. The staff here are friendly and very compete in their skills! Thoroughly enjoyed (in pleasure and agony) my massage here 😂 will definitely be back for more!\n\n",
        "Dr Maya Sari Lim\nLocal Guide·5 reviews·45 photos\nRated 5.0 out of 5,\nMassagez Kaki Wellness best in Singapore. Cant find  elsewhere.Gary my therapist  is professional . He knows what i need without telling him anything. Very happy with his sevice. 10 Stars. Highly recommended\n\n",
        "Jacqueline Keh\n2 reviews\nRated 5.0 out of 5,\nThe place is cleaned and the staff are friendly and polite.  I have always enjoyed every session here, be it foot or back massage.  The masseur who attended to me is very skillful. Highly recommended.\n\n",
        "Jesslyn Ong Hwee Sim\n3 reviews·4 photos\nRated 5.0 out of 5,\nThe staffs at ang mo kio was professional and friendly. Is worth coming as they make my massage experience very good and memorable. I would like to give Gary, Ah Ming and Ikah from Ang Mo Kio a thumbs up. I would go for more massage service at Ang Mo Kio.\n\n",
        "Joycelyn T\n1 review\nRated 5.0 out of 5,\nstaffs are very friendly and welcoming. signed up as member on my first visit so will definitely be back!!\n\n",
        "Mohd Hirman Mohd Ghous\nLocal Guide·26 reviews\nRated 5.0 out of 5,\nThank you so much Gary.. You are the best therapist in singapore.. Highly recommended. Very friendly and good service. My backache and my leg pain is solve..\n\n",
        "Desmond Lay\n8 reviews·3 photos\nRated 5.0 out of 5,\nI felt the masseur doing a great job. Will be back again.\n\n",
        "Toluwanimi Rapahel Angie\n3 reviews\nRated 5.0 out of 5,\nNice and convenient. They helped to dissolve my tired body and back by giving a good massage according to my problem. Worth for money. Highly recommend. Also friendly staff.\n\n",
        "Isaac Low\n2 reviews\nRated 5.0 out of 5,\nGary is a great masseur especially his crackings and the right pressure to the right acupoints. Worth visiting for a nice massage!\n\n",
        "Sean NG\nLocal Guide·8 reviews·21 photos\nRated 5.0 out of 5,\nVery professional therapist, good skills and service. If you need to loosen up, this is the place. Especially Gary he is really good.\n\n",
        "Heng Ee Chin\n1 review\nRated 5.0 out of 5,\nCompetent friendly staff.\n\nAlways catered to my requests for harder massages (more strength required & very tiring for masseur)!\n\n",
        "Valerie Chong\n3 reviews\nRated 5.0 out of 5,\nI’ve been here a few times and the masseurs were very professional. Every session was relaxing and after each session I can sleep better.\n\n",
        "Jack Chung\n9 reviews\nRated 5.0 out of 5,\nLocation is convenient (open car park just opposite the shop), shop is clean and comfortable, their staff is friendly and massage skill is very professional...highly recommended\n\n**This is their 2nd branch...have been their customer for 3+ years...\n\n",
        "Glenys Yim\n1 review\nRated 5.0 out of 5,\nGood & professional services from Gary. His colleague Ah Min is friendly too.\n\n",
        "milamber\n1 review\nRated 5.0 out of 5,\nVery good skills. Pinpoint areas that affects my problems. Good strength used! Will go again!\n\n",
        "Ignatius Coleman Alexander\n4 reviews\nRated 5.0 out of 5,\nGreat and professionally skilled person, they know their job well and helps your needs, a healing process for an overworked body and mind 💯💯💯\n\n",
        "Giselle Channel\n5 reviews·1 photo\nRated 5.0 out of 5,\nNice and clean ambience! Very skillful masseau! They practice good hygiene and sanitise their workstation\n\n",
        "Kevin Wee\n1 review·3 photos\nRated 5.0 out of 5,\nGreat and comfy environment for a good foot massage, especially after a long day.\n\n",
        "jordan wong\n2 reviews\nRated 5.0 out of 5,\nThe ambience is very comfortable. Very clean environment. The staffs here are very friendly. Recommended!\n\n",
        "Nantheniel Chiam\n2 reviews\nRated 5.0 out of 5,\nGood massage , comfortable and relaxing place .\n\n",
        "cheryl chan\n3 reviews\nRated 5.0 out of 5,\nGood massage. Friendly masseur. Good value too\n\n",
        "Kian Loo\n2 reviews\nRated 5.0 out of 5,\nThe one and only massage place that I will visit in Singapore.\n\n",
        "longshao Shuai\n2 reviews·1 photo\nRated 5.0 out of 5,\nGood experience and power,high recommended to here massage\n\n",
        "Nan Wang\n2 reviews\nRated 5.0 out of 5,\nLove this place. Gary is the master!! Able to crack and locate my issues\n\n",
        "Joanne Poh\n1 review\nRated 5.0 out of 5,\nGood skill and good service, Nice environment...strongly recommended💪👍\n\n",
        "Joe1 Joe1\n1 review\nRated 5.0 out of 5,\nVery skillful. Highly recommend!\n\n",
        "Mavericks Chong\n2 reviews\nRated 5.0 out of 5,\nGood Skill and friendly...highly recommended\n\n",
        "CC Lim\n1 review\nRated 5.0 out of 5,\nGreat services. It really helped relieve tension and it feels much lighter after massage. They customize their massage routine to individual customer. Gary and Kent are great masseurs.\n\n",
        "chua katlyn\n1 review·1 photo\nRated 5.0 out of 5,\nhard leg is recommended here.👍👍👍👍👍\n\n",
        "joanne poh\n1 review\nRated 5.0 out of 5,\ngood skill and good service...\n\n",
        "李伟鸣\n1 review·1 photo\nRated 5.0 out of 5,\n(Translated by Google) The environment is clean and tidy, overall comfortable, the masseur's technique and communication are good, highly recommended\n\n(Original)\n环境干净整洁，整体上舒服，按摩师的手法与沟通很好，强力推荐\n\n",
        "Kiat Long Chong\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The environment is simple and beautiful, the service attitude is good, and the craft is really powerful. Worth trying.\n\n(Original)\n环境简单优美，服务态度好，手艺真是给力。值得试。\n\n",
        "Sam Lim\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) Although the store is small ~ but simple, treat people friendly ~ worth recommending\n\n(Original)\n店虽小～但精简，待人友善～值得推荐\n\n",
        "Z Toh\n1 review·1 photo\nRated 5.0 out of 5,\n(Translated by Google) Press to the point, first-class 💪\n\n(Original)\n按到点，一级棒💪\n\n",
        "Lee S.\n3 reviews\nRated 5.0 out of 5,\n(Translated by Google) 👍Recommended although it hurts\n\n(Original)\n👍推荐 虽然痛\n\n",
        "Teoh Fang\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "T Tan\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Mei Xin Chan\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Kaitiri Raveendhran\n1 review\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6873 0813\">6873 0813</span>",
    "Website": "https://massagezkakiwellnessamk.business.site/?utm_source=gmb&utm_medium=referral&kWe=2ahUKEwj64YOcxd7zAhW0uksFHa-LAb04PBCBT3oFCAEQnAI"
}