{
    "Name": "NING Foot & Back Massage Spa",
    "Products": null,
    "Address": "78 Airport Boulevard #04 - 215 / 216 Jewel, Singapore Changi Airport, 819666",
    "Opening Hours": "Saturday 11am–9pm\nSunday 11am–9pm\nMonday 11am–9pm\nTuesday 11am–9pm\nWednesday 11am–9pm\nThursday 11am–9pm\nFriday 11am–9pm\nSuggest new hours",
    "Rating": "4.7\n120 reviews",
    "Reviews": [
        "Alicia\n1 review\nRated 5.0 out of 5,\nFirst time leaving review. first time visiting this spa. Spontaneous visit. Firm but relaxing 60 mins back and shoulder massage. Paid $72. They sanitised after each customer.\nI had a tight neck muscle on my left. Left the place with more relax shoulders. Only me and other customer on Thur late afternoon. They have lowered the price. Remember to refer to the printed copy pasted in front of counter as good. Copy on Google review is outdated.\nWill visit again.\n\n",
        "Sie Yen Ng\n1 review\nRated 5.0 out of 5,\nDiscovered this gem at Jewel today. My masseuse, Irene, was super nice, friendly, working hard on all my knots, especially where I told her that I was feeling sore. The ambience was really relaxing and I could just sink into the very comfortable chair. Irene told me their business is very badly affected by the pandemic though. Do support them!\n\n",
        "The Pink geEk\n2 reviews·1 photo\nRated 5.0 out of 5,\nThe massage was very relaxing. Irene did a very good job and all my aches melted away. Thank you. The place is also very relaxing and i loved their tea. Will be coming back.\n\n",
        "Alicia\n1 review\nRated 5.0 out of 5,\nFirst time leaving review. first time visiting this spa. Spontaneous visit. Firm but relaxing 60 mins back and shoulder massage. Paid $72. They sanitised after each customer.\nI had a tight neck muscle on my left. Left the place with more relax shoulders. Only me and other customer on Thur late afternoon. They have lowered the price. Remember to refer to the printed copy pasted in front of counter as good. Copy on Google review is outdated.\nWill visit again.\n\n",
        "Sie Yen Ng\n1 review\nRated 5.0 out of 5,\nDiscovered this gem at Jewel today. My masseuse, Irene, was super nice, friendly, working hard on all my knots, especially where I told her that I was feeling sore. The ambience was really relaxing and I could just sink into the very comfortable chair. Irene told me their business is very badly affected by the pandemic though. Do support them!\n\n",
        "The Pink geEk\n2 reviews·1 photo\nRated 5.0 out of 5,\nThe massage was very relaxing. Irene did a very good job and all my aches melted away. Thank you. The place is also very relaxing and i loved their tea. Will be coming back.\n\n",
        "Jas Pn\n9 reviews\nRated 1.0 out of 5,\nLousy back and foot massage, feels like a back rub than massage. Therapists does not ask if the massage strength is ok or not. Don't feel any relief after the massage, will not visit again.\n\n",
        "Chay Daniel\n1 review\nRated 5.0 out of 5,\nToday my family had 03 masseurs (May, Irene & Koo) for Foot Massages. It was good, professional and friendly. The ambience was nice. Definitely will go back again\n\n",
        "Hermann Loy\nLocal Guide·52 reviews·155 photos\nRated 5.0 out of 5,\nHad the 70min Foot and Back massage before my Long flight. Karen was my therapist and she did a amazing job of working out the knots. Flying, especially in economy Long haul puts a lot of pressure in the lumbar area so it was good to get some relief before another Long haul flight. Ambience and setting is nice.\n\n",
        "KD is Kindness Daily\n4 reviews·2 photos\nRated 5.0 out of 5,\nWonderful soothing massage from June in a beautiful professional location. What a treat! Thank you June and staff for being open and available during this special time in the world.\n\n",
        "Yuri Ko\n9 reviews\nRated 5.0 out of 5,\nGood atmosphere and quiet. Very relaxed and rejuvenated after the 40 mins massage.\n\n",
        "Olivier Le Sayec\n11 reviews·12 photos\nRated 2.0 out of 5,\nHad an overpriced foot massage for 1 hour. The massage was average and they let you clean your feet by yourself at the begining of the session.\nI gave my card and realised that they have charged me $85 (or $10 more than advertised). I asked for rectification and got just $5 back.\nThey advertise $75 but have a hand written tiny note that say (exl of 7% gst).\nOverall, i felt ripped off by this massage place.\n\n",
        "Jolyne Tan\n2 reviews\nRated 5.0 out of 5,\nThe massage was great by the therapist Irene. The amount of pressure was just on-point and relaxing!\n\n",
        "hanwei ng\n5 reviews·1 photo\nRated 5.0 out of 5,\nGood massage, clean and great environment! Receptionist is super friendly\n\n",
        "aria eu\n3 reviews\nRated 5.0 out of 5,\nAwesome and therapeutic experience at Ning spa!😍\nHighly recommend (Irene) for foot and leg massage,\nShe’s my fav masseur♥️\nShe’s has very warm personality and she will share with you the details of our leg and feet so we know better why are certain parts so sore💯\n\n",
        "Meli\n7 reviews·1 photo\nRated 4.0 out of 5,\nWe opted for the 100 minute massage today - the service is good. My therapist got rid of the tight knot at my back which I really appreciate. I'd recommend dropping by the place when you're in Jewel.\n\n",
        "Simin Liu\n6 reviews\nRated 1.0 out of 5,\nWent for a foot spa and it an extremely poor experience. It was already strange at the start that we had to dry our own feet after the foot bath and the spa scrub was outright painful. Therapist did not pay attention to blisters or cuts on the feet and pulled the skin off a fresh blister. Would not return\n\n",
        "Angela Ng\nLocal Guide·96 reviews·62 photos\nRated 2.0 out of 5,\nShould have paid more attention to the reviews. Lots of 5 star reviews by people who only have one review on their profiles... 😒\n\nThere's only a single masseuse who doesn't seem to know what she's doing. Lots of pressing with thumbs on the same spots. I left feeling more sore than refreshed. Didn't seem to know how to adjust the chair properly either, which left me seated in an uncomfortable position.\n\n",
        "nur hafizah\n1 review\nRated 5.0 out of 5,\nGreat foot reflexology done by Mary. The pressure is fantastic and the strokes of the massage was good. Recommended place to go for the quick fix for the tired feet!\n\n",
        "Avelyn Cho\n1 review\nRated 5.0 out of 5,\nLooking for a massage place with hubby and chances upon NING FOOT & BACK SPA. Chosen a 40 min back and shoulder massage, therapists are KATHERINE and KAREN. They are very professional, it was so comfortable and techniques used were great. Place is clean and music is soothing.\n\n",
        "Charli Mocon\n5 reviews·1 photo\nRated 1.0 out of 5,\nDecided to get the 60min shoulder and back massage despite it being a bit pricey. The chair wasn't adjusted properly and incredibly uncomfortable. The 'massage' was a back rub at best and gave me zero relief from the knots in my neck and shoulders.\nCouldn't wait for it to be over. Easily the worst massage I've ever had.\n\n",
        "michelle yow\nLocal Guide·35 reviews·43 photos\nRated 5.0 out of 5,\nGreat massage skills! Went in to get my very sore back and shoulders sorted and the therapist did not disappoint at all! She found every knot and sore point and after 40 minutes, my back felt so much 'lighter' and the soreness has completed disappeared. Highly recommend this spa joint\n\n",
        "Annie Cahill\n1 review\nRated 5.0 out of 5,\nIrene, Jason, and Katherine were truly wonderful. After months of living in a developing country under stressful circumstances, it was lovely to be brought back with a massage here. Irene was able to relieve a lot of stress and I feel great.\n\n",
        "Durga Sureshlal\n11 reviews\nRated 4.0 out of 5,\nI visited in January this year before the Covid situation. Katherine gave me an amazing foot massage! She even helped focus on relieving the heel pain owing to Plantar Fasciitis which causes discomfort after my running sessions. It's been 5 months now and I have had little to no pain post the message therapy. Able to run worry- free now. Will definitely visit again.\n\n",
        "Judy Chiang\n1 review\nRated 5.0 out of 5,\nHad a great massage! The masseuse was very respectful and treated my back with care. I got relief from it! Would recommend anyone who needs a good relief before flying off from the airport. Got this done at the Jewel at Changi!\n\n",
        "Chen Jacqueline\n1 review\nRated 5.0 out of 5,\nFirst visit to NING Foot & Back Massage Spa. Wonderful service and experience by therapist Mary. Did foot callus removal! Price is very affordable too!\n\n",
        "joseph ng\n2 reviews\nRated 5.0 out of 5,\nVery clean and peaceful environment to come for massage. Both Katherine and Karen skill is awesome. Fall asleep during massage. After the massage, feel more refreshing.\n\n",
        "justin\n7 reviews\nRated 5.0 out of 5,\nExceptional foot massage for plantar fasciitis!\nI have problems with my arches that lead to debilitating heel pain that comes on if I have been walking a lot on hard concrete type surfaces, and was actually just looking for a general foot massage that I have had several times before at other reflexology places.\n\nI didn't have the pain at the time of the massage but thought I would ask if they knew anything about preventing heel pain through massage. To my surprise the masseuse (Agnes) questioned me further on my symptoms correctly identifying where and when the pain generally occured and the aggravating factors. It felt like a professional consultation (and I work in healthcare)!\n\nI opted for the 60min massage on the basis that they actually work up the foot and into the lower leg in this session, to allow enough time to see if Agnes could make any difference.\n\nThere's no denying that the massage was painful at times, but Agnes was able to modify the pressure accordingly and it was totally worth it as I could actually feel the muscles under my foot relax as the knot that she was pressing dispersed...if I could bring her back to London with me as my personal foot masseuse I would. Best foot massage I've had to date!\n\n",
        "Samanntha C\n2 reviews\nRated 5.0 out of 5,\nThe therapist who attended to me (Mary) was really good at working out all the knots in my shoulders! Thank you :)\n\n",
        "Justino Soh\n7 reviews·5 photos\nRated 5.0 out of 5,\nGreat ambience and service. Ever friendly receptionist, Michelle, welcomed me with her warm interaction.  Karen, my therapist, treated my aching back with her superb massage skills.\n\n",
        "Elsa Rose\n1 review\nRated 5.0 out of 5,\nThank you for such a wonderful foot massage by June, I really enjoyed it and see you next year when I am back to Singapore.\n\nOn behalf of my husband too who had body massage by Karen, it was such a wonderful experience\n\n",
        "Ken\n4 reviews·7 photos\nRated 5.0 out of 5,\nJust came out of a massage session at Ning and I must say it’s the best massage I’ve ever had.\n\nI’ve always had heel pains and this place has really fixed it for me!! Will definitely come back again for another session and maybe I can get rid of my pains for good.\n\n",
        "James Mensah\n1 review\nRated 5.0 out of 5,\nMy first time having Foot massage from Katherine, Karen, they were very kind and nice. It’s was a great massage! Highly recommend.\n\n",
        "Kai Jun Koh\n1 review\nRated 5.0 out of 5,\nGood massage, friendly and welcoming staff\n\n",
        "Linda Wibowo\n1 review\nRated 5.0 out of 5,\nKatherine and Irene were very professional in the way they took care of us and ensured that our treatment were done properly. We will definitely be back the next time we are at Jewel!\n\n",
        "Howard Ouyang\n1 review\nRated 5.0 out of 5,\nKatherine and Irene were very professional in the way they took care of us and ensured that our treatment were done properly. We will definitely be back the next time we are at Jewel!\n\n",
        "Andrew Chow\nLocal Guide·44 reviews·583 photos\nRated 5.0 out of 5,\nJason and Katherine served my mum and.  They were professional and patient. Besides being good in their foot massage skills,  they are also very engaging\n\n",
        "Johanan Sen\nLocal Guide·19 reviews·3 photos\nRated 5.0 out of 5,\nGreat experience at Ning Spa. Decided to stop for a quick back and neck massage and was tended to by May who worked wonders.\n\n",
        "Yulia Ivanova\n1 review\nRated 5.0 out of 5,\nMy family and I had a great Shoulder and Foot massage from Katherine, Edison, Karen, June and Amiral. It’s was a great massage! Highly recommend!\n\n",
        "Ong Femy\n4 reviews\nRated 5.0 out of 5,\nGreat ambience and service. Great massage by June and Katherine relieving backache and tight shoulder. Feel good and refreshed.\n\n",
        "Crystal Liu\nLocal Guide·15 reviews·53 photos\nRated 4.0 out of 5,\nThe massage is not bad, but for that price is much higher than city area. 90SGD for 60 mins shoulder. For that price, i would expect better skill and service.\n\n",
        "Yong Keong Woo\nLocal Guide·52 reviews·29 photos\nRated 5.0 out of 5,\nTook a 70min shoulder and foot massage. Great therapist and quiet place to unwind.\n\n",
        "Kok Hua Kang\n2 reviews\nRated 5.0 out of 5,\nEnjoyable experience and my therapist was very skilful with her foot massage skills.\n\n",
        "James C\n2 reviews\nRated 5.0 out of 5,\nJune and Katherine did a 40 minute back and shoulder massage which was wonderful. Lovely, soothing music in the background. Thanks!\n\n",
        "Jason Ryan\n2 reviews\nRated 5.0 out of 5,\nPerfect way to break up a few flights. Jason and Katherine are miracle workers. Do yourself a favour and swing past for a cheeky relax ✌\n\n",
        "Sarah Y\n12 reviews·9 photos\nRated 5.0 out of 5,\nDecided to get a foot and back massage before my flight and I'm glad I found Ning Spa. Very pleased with the cleanliness, friendly staff and an excellent massage\n\n",
        "Product Design\n1 review\nRated 5.0 out of 5,\nAgnes and Irene were extremely good. The massage was excellent. Thank you !!\n\n",
        "Robert Martinez\n1 review·80 photos\nRated 5.0 out of 5,\nHad a great message by Katherine. The staff was super nice and professional. Thank you Michelle for the great hospitality.  I would definitely come back.\n\n",
        "Sandra Jez Me\n2 reviews\nRated 5.0 out of 5,\nTried foot massage and the service, environment n treatment good .. recommended if you happen to reach. Changi Jewel.\n\n",
        "Jin M\n1 review\nRated 5.0 out of 5,\nWe really enjoyed the foot, shoulder and back massages by Katherine and Jason. They were friendly and professional. 👍🏻👍🏻\n\n",
        "A W\nLocal Guide·59 reviews·19 photos\nRated 1.0 out of 5,\nPoor environment, too bright, no music, seat not comfy and you have to pay extra just for the  bed coz they only have one bed :/ I won't go back again\n\n",
        "Yu Ming\n10 reviews·1 photo\nRated 5.0 out of 5,\nI did their foot and back massage. Their therapist are very skilled and the ambience was one of the best. Will come back again!\n\n",
        "Zoe Morgan\nLocal Guide·97 reviews·39 photos\nRated 5.0 out of 5,\nJust had an amazing massage.  It has set me up for my long flight tonight. I feel so much better.\n\n",
        "Shirley Bong\n1 review\nRated 4.0 out of 5,\nThe lady Irene who did my back and shoulder massage was good.\n\n",
        "Glen M\nLocal Guide·9 reviews·7 photos\nRated 5.0 out of 5,\nNice and friendly, great shoulder and back massage\n\n",
        "Bruno Lanceleaux\n2 reviews\nRated 5.0 out of 5,\nJason was amazing. Thank you for a great massage before my flight! Bruno\n\n",
        "Katherine M\n1 review\nRated 5.0 out of 5,\nA wonderful way to relax. Quiet and comfortable atmosphere. The best foot massage ever:)\n\n",
        "Emma Billsberry\n1 review\nRated 3.0 out of 5,\nMassuer gave good firm foot, back and shoulder massage, chair was quite uncomfortable though\n\n",
        "Kelly Lee\n3 reviews\nRated 5.0 out of 5,\nRelaxing and superb massage from to ease my backaches and shoulder aches. Nice and calm ambience.\n\n",
        "Catherine -\n1 review\nRated 5.0 out of 5,\nfor foot therapy, Irene's massage on my achy feet feels really thorough with a holistic touch. thanks!!\n\n",
        "dreamzpop\n1 review\nRated 5.0 out of 5,\nA very relaxing massage! Thanks to Katherine for her very professional service!\n\n",
        "RC Liyana\n2 reviews·3 photos\nRated 5.0 out of 5,\nFancy and soothing environment. foot and back massage done by Katherine was well done, good pressure\n\n",
        "Sweetheart OfS\nLocal Guide·29 reviews·84 photos\nRated 5.0 out of 5,\nWonderful experience... I had katherine - I didn't want it to end... OMGEE.\nHusband had Karen.\nDon't miss this guys...\n\n",
        "Steven Schriefer\n1 review\nRated 5.0 out of 5,\nHad a 100 minute back, shoulders and feet massage. It was amazing and I highly recommend it.\n\n",
        "Mariko Toyoda\n1 review\nRated 5.0 out of 5,\nKatherine and Karen gave us a fantastic foot massage. I feel so refreshed. Thank you!\n\n",
        "Angela G\n2 reviews\nRated 5.0 out of 5,\nJason was great in working out the knots on my shoulders. Definitely recommend!\n\n",
        "Katja Holtta-Otto\n2 reviews\nRated 5.0 out of 5,\nGreat foot massage before a long flight. Katherine was wonderful.\n\n",
        "Jules p-e\n1 review\nRated 5.0 out of 5,\nGreat massages from Edison and Jason - we will definitely be back! Jules and Kerri\n\n",
        "Ch X\n24 reviews·6 photos\nRated 4.0 out of 5,\nNice quiet environment for a good massage.Recommended!\n\n",
        "Shidah\n2 reviews\nRated 5.0 out of 5,\nHad a great & awesome time at Ning Spa! Fantastic atmosphere! Thank u Irene, Jason & Catherine! 👍🏻👍🏻👍🏻👍🏻👍🏻\n\n",
        "Joanna Lin\n1 review\nRated 5.0 out of 5,\nIrene was really professional and really awesome in reliefing my back ache n foot ache!!!\n\n",
        "yumtumz lee\n1 review\nRated 5.0 out of 5,\nReceptionist Hao Jiet was amazing and extremely helpful. Highly commendable actions by him.\n\n",
        "Gijs Hoogeveen\n15 reviews·5 photos\nRated 5.0 out of 5,\nGreat foot massage by Agnes, my wife also enjoyed!\n\n",
        "Irene Teng\n1 review\nRated 5.0 out of 5,\nIrene and June are very nice and caring, and also the beds are very comfortable.\n\n",
        "Dread T666\n1 review\nRated 5.0 out of 5,\nGd back massage 5 stars..really rejuvinating and energy source..yeah 5 stars Katherine, irene , jason\n\n",
        "Rayhana Wahid\n1 review\nRated 5.0 out of 5,\nThe staff were thorough and detailed in their work. Would recommend this place!\n\n",
        "Kristine De Castro\n2 reviews\nRated 5.0 out of 5,\nIrene is the best! I will surely come back!\n\n",
        "Wan Noor Ayati Bte Syed Ali\n1 review\nRated 5.0 out of 5,\nExcellent ambience and service. Therapist Irene is very good.\n\n",
        "Alvin Peh\n4 reviews\nRated 5.0 out of 5,\nBest place for massage\n\n",
        "Hasan Kazmi\n6 reviews\nRated 5.0 out of 5,\nCatherine was amazing, great place for a massage before a flight.\n\n",
        "Siew Mei Lee\n2 reviews\nRated 5.0 out of 5,\nJune is very nice and a great massagist\nThanks june\n\n",
        "Jim Merritt\n24 reviews·1 photo\nRated 5.0 out of 5,\nFantastic service. Katherine was very kind, firm and effective. Thank you.\n\n",
        "Kanishka Surana\n4 reviews\nRated 5.0 out of 5,\nGood experience. Ask for June when you get here she is great.\n\n",
        "Suzzie K\n2 reviews\nRated 5.0 out of 5,\nTherapists was good and meet my satisfaction.\n\n",
        "Floyd Crocker\n6 reviews·2 photos\nRated 5.0 out of 5,\nGreat relaxing environment and good foot and leg massage.\n\n",
        "Addison Wong\n2 reviews\nRated 5.0 out of 5,\nVery relaxing and refreshing! Highly recommended.\n\n",
        "A Chef with a Passport #Tanu\n3 reviews·1 photo\nRated 5.0 out of 5,\nGreat massage by Katharine!! Loved it\n\n",
        "Mia Hall\n1 review\nRated 5.0 out of 5,\nStaffs were very attentive and overall experience was great from the moment I stepped in.\n\n",
        "HweeMin Ng\n1 review\nRated 5.0 out of 5,\nQuality service, friendly staffs, pretty interior and comfy chairs!\n\n",
        "Kenny Chee\n1 review\nRated 5.0 out of 5,\nReceived excellent service from Katherine . Well done\n\n",
        "Rs\n7 reviews\nRated 5.0 out of 5,\nGood back and shoulder massage!\n\n",
        "Joeven Zhuo\n4 reviews\nRated 5.0 out of 5,\nGood experience here! Recommend to come!\n\n",
        "Sophie Fitsall\n2 reviews\nRated 4.0 out of 5,\nGood massage from Katherine - thank you\n\n",
        "Lee Zhengyi\n6 reviews·1 photo\nRated 5.0 out of 5,\nGood back massage.\n\n",
        "Joy Liu\n1 review\nRated 5.0 out of 5,\nGreat foot massage!\n\n",
        "solomon thangaswamy\n4 reviews\nRated 5.0 out of 5,\nSerene atmosphere & professional massagers\n\n",
        "Diana Ishak\n10 reviews·13 photos\nRated 5.0 out of 5,\nMary was great, i took the 1 hour back shoulder and feet massage and i actually felt so shiok that i fell asleep. not painful and great ambience too. will be coming back!\n\n",
        "Demetri Ramos\n1 review\nRated 5.0 out of 5,\nTherapist Karen was wonderful\n\n",
        "Tyler Thia\n1 review\nRated 5.0 out of 5,\nVery comfortable and enjoyable!\n\n",
        "Paul H.\nLocal Guide·204 reviews·856 photos\nRated 5.0 out of 5,\nVery relaxing and quality service!\n\n",
        "Michelle Zheng\n2 reviews·9 photos\nRated 5.0 out of 5,\n(Translated by Google) The environment is very good, and the massage chair is too comfortable\n\n(Original)\n环境很好，而且按摩的椅子太舒服了\n\n",
        "すみす\n12 reviews·5 photos\nRated 5.0 out of 5,\n(Translated by Google) In the dive (Sunday evening) on the day, I waited for a while, but I also had the flexibility to massage. Back and shoulders in bed. The interior is dark and calm, but the bed facing the outside is a bit dazzling. But the massage was the best and the therapist was good. I would like to go back and forth before and after the flight if it is timed!\n\n(Original)\n当日飛び込み（日曜夕方）で、少し待ちましたが融通もしていただきマッサージしてもらいました。背中と肩をベッドで。中は照明暗めで落ち着いていますが、外と面したベッドは少し眩しいかもです。でもマッサージは最高でセラピストの方もうまかったです。タイミングあえばフライト前後にまた行きたいです！\n\n",
        "南田明美\n4 reviews\nRated 5.0 out of 5,\n(Translated by Google) I feel very comfortable. Recovery from airplane fatigue is quick. It is always polite customer service. It is also useful during transit.\n\n(Original)\nとても気持ちがよいです。飛行機疲れのリカバリーが早いです。いつも丁寧な接客です。トランジットの時も便利です。\n\n",
        "Minna Luukka\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Irene was a skilled neck massager. He had strong fingers. Good relaxation before your flight!\n\n(Original)\nIrene oli taitava niskahieroja. Hänellä oli vahvat sormet. Hyvä rentoutushetki ennen lentoa!\n\n",
        "Wally Lam\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Jason & katherine presses well! come back next time\n\n(Original)\nJason&katherine 按得很好！下次再來\n\n",
        "Honey H\n20 reviews\nRated 5.0 out of 5,\n(Translated by Google) Great massage from Karen, June and Jason !!!\n\n(Original)\nSuper Massage von Karen, June und Jason!!!\n\n",
        "Pekka Luukka\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Well done right back - June got it right!\n\n(Original)\nHyvin oikeni selkä - June laittoi kuntoon!\n\n",
        "Hongbin Chen\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Katherine pressed well\n\n(Original)\nKatherine按的不错\n\n",
        "Anna Luukka\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Karen was good !! :-)\n\n(Original)\nKaren oli hyvä!!:-)\n\n",
        "Sie Yen Ng\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Adrian Chung\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Vinnie Chan\n2 reviews·1 photo\nRated 4.0 out of 5,\n\n\n",
        "T r i c i a\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Fabio Pellegrini\n88 reviews·113 photos\nRated 3.0 out of 5,\n\n\n",
        "C T\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Joanna Francesca Flores\n1 review\nRated 5.0 out of 5,\n\n\n",
        "HR Dept\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Enquiry Expressions\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Tj\n10 reviews·3 photos\nRated 5.0 out of 5,\n\n\n",
        "Shazwani Mohamad\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Rommel Chew\n2 photos\nRated 5.0 out of 5,\n\n\n",
        "Edwin Lee Wei Ann\n4 reviews·1 photo\nRated 4.0 out of 5,\n\n\n",
        "Alby Yeo\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6612 1313\">6612 1313</span>",
    "Website": "https://ningspa.com/"
}