{
    "Name": "Oriental Therapy Pte Ltd",
    "Products": {},
    "Address": "354 Alexandra Rd, #01-16 Alexis on, Singapore 159948",
    "Opening Hours": "Friday 9am–10:30pm\nSaturday 9am–10:30pm\nSunday 9am–10:30pm\nMonday 9am–10:30pm\nTuesday 9am–10:30pm\nWednesday 9am–10:30pm\nThursday 9am–10:30pm\nSuggest new hours",
    "Rating": "4.7\n116 reviews",
    "Reviews": [
        "Bonan Zhang\nLocal Guide·233 reviews·1,039 photos\nRated 5.0 out of 5,\nHad my chiropractic here, very experienced chiropractor, she knows where is my pain spot and how to relieve my pain. Cupping/guasha is complementary, too. Very worthy. The shop is nicely decorated, free bottled waters are provided, will definitely visit again.\n\n",
        "Juz Interior\n2 reviews\nRated 5.0 out of 5,\nI went for Tuina for the first time, upon following my husband. I was not really into massage and stuff, but after this session i can really feel my body was lighter, relaxed, and overall better. The therapist is friendly and helpful, so does the receptionist. She knows what she pressed, not just simply rub. Will come again for more session\n\n",
        "Tamago\n21 reviews\nRated 5.0 out of 5,\nClean environment and polite staff who were not pushy. Tuina massage was good (painful but that is what tuina is). Will recommend Le Le and Rachel! Do call to book a slot before heading down. For those who are driving, you can park in the condominium's carpark.\n\n",
        "Bonan Zhang\nLocal Guide·233 reviews·1,039 photos\nRated 5.0 out of 5,\nHad my chiropractic here, very experienced chiropractor, she knows where is my pain spot and how to relieve my pain. Cupping/guasha is complementary, too. Very worthy. The shop is nicely decorated, free bottled waters are provided, will definitely visit again.\n\n",
        "Juz Interior\n2 reviews\nRated 5.0 out of 5,\nI went for Tuina for the first time, upon following my husband. I was not really into massage and stuff, but after this session i can really feel my body was lighter, relaxed, and overall better. The therapist is friendly and helpful, so does the receptionist. She knows what she pressed, not just simply rub. Will come again for more session\n\n",
        "Tamago\n21 reviews\nRated 5.0 out of 5,\nClean environment and polite staff who were not pushy. Tuina massage was good (painful but that is what tuina is). Will recommend Le Le and Rachel! Do call to book a slot before heading down. For those who are driving, you can park in the condominium's carpark.\n\n",
        "Alvin Lau\n1 review\nRated 5.0 out of 5,\nIt's not easy to find great foot reflexology that meets expectations but Oriental Therapy quite literally hits the spot! My masseuse Joyce was great - applying the right amount of pressure and ensuring I was comfortable throughout. Cozy interiors and warm, friendly staff. 10/10 will come back and am considering signing up for a package when I do.\n\n",
        "Kok Heng Kam\n3 reviews\nRated 5.0 out of 5,\nI went for the first time after 2 friends both recommended Susan. I got preexisting condition n Susan take note about that seriously. She is able to identify what are my issues, and relieving them. Staff are all friendly and helpful. Will be back for more session.\n\n",
        "Eliz Kuan\n1 review\nRated 5.0 out of 5,\nMy back pain had troubled me for a long long time. I have been searching for a good chiropractor but to avail. I found them and tried their service, it works perfectly for me. The pain is gone and I have adjusted my backbone and it’s better than before.\n\nThey have TCM treatment and massage too\n\nHighly recommended to try out their treatments. It might cure your body ache and give you a healthy body too.\n\n",
        "Fiona Leong\n11 reviews·3 photos\nRated 5.0 out of 5,\nCame across Oriental Therapy while searching on Google for Tuina Massage located nearer to the west as I plan for treatment on weekdays after working hours to destress.\n\nReached out to them via WhatsApp message on last Monday afternoon, Amelia was very quick to respond. They have female masseuse which matches my own preference, Orthopedist too. She is very helpful in giving recommendations to what kind of treatment is suited for me and my partner. E.g. Mentioning that if having muscle pain or sore, she recommends normal Tuina, as for me I have a permanent swell hence she recommend orthopedist but only if I'm comfortable.\n\nI made an appointment with her for the next day evening. Location-wise, it is easy to find - one of the shops located right along Alexis Condo (nearest MRT station will be Queenstown). We drove there so there is no problem parking at the condo carpark with ease. Went in being surprised with how spacious, relaxed and calm setting they have!\n\nI personally really enjoy my Tuina experience with Elaine and for my partner (his first time trying out Tuina) with LeLe. Also get to try cupping for my very first time!\n\nAlso chatted a little and got to know they were previously located at Club Street and has been around for 22 years.\n\nThank you Amelia, Elaine and LeLe once again for the great experience!\nWill recommend to others and come back again.\n\nFiona\n\n",
        "Alexis Loo\n1 review\nRated 5.0 out of 5,\nPlace is clean and nicely decorated. The masseuse was great as well - she checked in on me from time to time, asking if the pressure was ok and if I was feeling cold. Left the place with my stiff neck, shoulders and back gaining a new lease of life!\n\n",
        "suxian soo\n1 review\nRated 5.0 out of 5,\nMy therapist was very skilled and managed to release my knots and cures my aches! Highly recommend and would definitely return.\n\n",
        "Jewel Angy\nLocal Guide·54 reviews·77 photos\nRated 5.0 out of 5,\nVery clean and well decorated place..\nI've this massage lady name Alice.. she is very professional and able to spot on my \"frozen shoulder\" and tui na in order.  Thumbs up :)\n\n",
        "Chih Chwen Heng\n1 review\nRated 5.0 out of 5,\nNot a fan of tui na massages, so I asked for a gentle therapist and it was a great experience. She was skillful and attentive, constantly checking in to make sure the pressure was good and my problem areas (neck and back) was properly treated. Bought a $500 package after and have been coming back regularly.\n\n",
        "Olivia Lim\n1 review\nRated 5.0 out of 5,\nHardly one to do write a review but I totally feel this place deserves a good write-up - their staff are polite and I had a superb experience with Alice.\n\nI have a desk-bound job and pretty much on my computer/phone most times thus the stiff shoulders, knots all over and Alice was very specific to target those knots (btw, my knots are really very tight and deep)\n\nWhat I loved about it was that, it wasn't one of those massages that's too light, too fast or too rough - she was quick to share with me what are the problematic areas on the body.\n\nIt was a very good massage altogether and I am looking forward to my next week's appointment with Alice!\n\n",
        "Joelle Ng\n3 reviews\nRated 5.0 out of 5,\nBeen there a few times but tried essential oil therapy this time for the first time; very impressive, smooth and relaxing. The price of it is fair and staff are all polite and professional. Would recommend visit this nice place and to try their essential oil therapy\n\n",
        "Joanna T\nLocal Guide·36 reviews·254 photos\nRated 5.0 out of 5,\nI’ve had chronic shoulder issues for many years, and with a job that requires me to be in front of a computer regularly, I am constantly experiencing pain in my shoulders. I have tried many other Tuina places in the past, but was never able to find any therapist that can help with my pain as well as Alice has.\n\nI’ve frequented Oriental for the past 1.5 months weekly and the pain has become a lot more manageable. Alice always makes me feel at ease. Her tuinas are forceful and will not provide a relaxing session that some people might expect, but to me it’s necessary. I consistently feel refreshed after every session, and the discomfort in my shoulders do not return so quickly (this is something I’ve noticed with other Tuina places, which suggests they might only be providing temporary relief).\n\nThe space is conveniently located, very clean, and easy to make an appointment. At $64 for a 1-hour session, their rates are also affordable and comparable to other establishments.  I will definitely recommend them, be sure to look for Alice!\n\n",
        "JJ C\n1 review\nRated 5.0 out of 5,\nChiropractor Susan and Masseur LuLu are great; Shoulder pain was relieved after one treatment; Will definitely visit again;\n\n",
        "Prayas Gautam\n2 reviews\nRated 5.0 out of 5,\nI did the tuina plus the cupping therapy. They were very professional and did the massage very nicely. Would recommend it to others as well. Definitely going there for my next appointment.\n\n",
        "wahlaueh anyhow\n10 reviews·11 photos\nRated 3.0 out of 5,\nMy go-to tuina place for the past 1 year. Frequent this outlet at least once a month without package. Staff turnover is quite high so I always get a different masseur every time. The skills of the masseur vary so it's really a hit or miss if you don't have a regular one, but out of 15 times visited- it's about 30% of the time I got a less skillful massage experience, the rest was fine\n\nThey have 2 outlets- with the smaller one at tiong baru and the rooms there are also more squeezy.\n\nRooms are quite clean however they only have a mixed toilet in the premise so gotta queue up during peak hours.\n\nRecommend to book if you are coming during the weekends!\n\n",
        "Sharon Jieling\nLocal Guide·8 reviews·91 photos\nRated 5.0 out of 5,\nSusan, the senior orthopedic, is extremely professional and cares for her patients. She is dedicated in treating the problems and focuses on helping her patients feel better.\n\n",
        "Carina Lim\n3 reviews\nRated 5.0 out of 5,\nPlace is serene and relaxing. My therapist, Alice kept her room clean, cares for her customers’ well being and dedicated in solving my body aches. My health has certainly improve under her care. Thanks Alice for help. 谢谢。你最棒！\n\n",
        "Alice Goh\nLocal Guide·14 reviews·28 photos\nRated 5.0 out of 5,\nThe therapist very professional here. Checked my needs, could kwa sha and chi guan too. Super happy and satisfied\n\n",
        "Qianying Chan\n1 review\nRated 5.0 out of 5,\nReceptionist is friendly and welcoming and the zheng gu session with Susan was painful but extremely good 😅\n\n",
        "Jolene Toh\n1 review\nRated 5.0 out of 5,\nFirst time here, nice environment and good massage. Will come again.\n\n",
        "Dr Yang Ing Hong Joseph\nLocal Guide·127 reviews·836 photos\nRated 5.0 out of 5,\nLoved it.\nQuite.\nSafe.\nProfessional.\nBed is clean n warm.\nSusan is The Best. Knows how much pain i can bear.\n\n",
        "Riduan Tay\nLocal Guide·30 reviews·2 photos\nRated 5.0 out of 5,\nExcellent, best ever had provided given where your pain or problems located. Only the face rest need to be bigger a bit.\n\n",
        "박인규\n1 review\nRated 5.0 out of 5,\nA perfect tuina treatment I've ever got. Will visit later again.\n\n",
        "Lee Yu Kang\n1 review\nRated 5.0 out of 5,\nGood and friendly staffs! David’s zheng gu session was really good as well!!\n\n",
        "Vishal Agarwal\n6 reviews·2 photos\nRated 5.0 out of 5,\nGreat experience.\nThe therapist very skilled and well tranied.\nHighly recommended for body pain and if you want some self pampering.\n\n",
        "Allison Phua\n12 reviews·4 photos\nRated 5.0 out of 5,\nExcellent therapists, I always come out feeling much better than when I went in. Lovely environment and very clean and relaxing!\n\n",
        "vera ng\n1 review\nRated 1.0 out of 5,\nPatronised alexandra branch not long since they opened for business at alexis few years ago and as a gesture of goodwill i received good package rates since then for both foot and body massages on a weekly basis.  I also recommended my friends to use their services since i have fixed therapists. This lasted for a few years.\n\nJust 2 weeks ago, without prior informing me, they ceased my package rates and realised there is a change of management since oct, they charged me higher than i used to pay without prior notice. I will accept the changes if the management communicated with their existing customers and prepare them for the change. Worse of all i was received by a \"new\" elderly front staff who obviously has an attitude and simply told me this is the new rates with a hard stare.  Shocked by her attitude and i told her to check my records, she then relunctantly gave me the old rates without eye contact.\n\nNobody informed me the business was bought over and now the management has ceased all the old package price, dont we deserve to be informed prior to our appointments ?  so i decided to take the initiative to speak to the person in charge but to my disappointment she speaks without thinking and cited: \"even takashimaya change price without informing customers\" what a poor example to cite cos takashimaya will surely communicate with their loyal customers u bet. Immediately i know i should not continue the conversation with someone with different mentality and mindset.\n\nI am in no position to give advice but i sincerely hope they will treat their loyal customers with more respect and better communication.\n\n",
        "kyrene thng\n6 reviews\nRated 3.0 out of 5,\nHave been going there for a year so far BUT the customer service lady is always very impatient each time i call over, aren't helpful. (As the masseur that attended to me has left, so i have been using different masseurs each time and i couldnt remember their names.) P.S: They dont keep a record unless you sign a package. So even though i frequent the place, there is no records of my appointments and which masseur attended to you. To be fair, it is a great place for tuina and massage just not service friendly.\n\n",
        "Rossanne Tagaban\n1 review\nRated 5.0 out of 5,\ngot 60min massage in good price. the customer service and massage quality is very satisfying. will definitely come back here. recommendable.\n\n",
        "JIAZHI LI\n1 review\nRated 5.0 out of 5,\nnice service with reasonable price and no hard sell!\n\n",
        "neo weiwei\n3 reviews\nRated 5.0 out of 5,\nGood strength and pressure for the massage!\n\n",
        "Yaxin Zeng\n1 review\nRated 5.0 out of 5,\nVery great experience!! Massagist is professional and very nice to me! I will come again ~\n\n",
        "Joel Bong\n5 reviews·6 photos\nRated 5.0 out of 5,\nVery professional. The masseuse was very knowledgeable and managed to fix my lower back problems.\n\n",
        "Iris Pey\n1 review\nRated 5.0 out of 5,\nExcellent service and good message. Will visit again.\n\n",
        "Cheryl Goh\n4 reviews·5 photos\nRated 5.0 out of 5,\nTherapists were professional and very knowledgeable\n\n",
        "Grace Low\n3 reviews\nRated 1.0 out of 5,\nTCM and massage I good. But the appointment system is frustrating.  They have messed up at least 3 times in my 3 months going there and I always find out only when I arrive. And they get defensive. If time is precious for you, consider elsewhere.\n\n",
        "Iris Tan\n2 reviews·1 photo\nRated 1.0 out of 5,\nBeen more than one week but my back still hurts quite badly. Now i can't even lift my head up and I can feel a pull from middle of my spine all the way till my neck. Bad encounter ! Will be my first and last time visiting.\n\n",
        "Sebestian Szeto\nLocal Guide·364 reviews·2,087 photos\nRated 5.0 out of 5,\nOne of best TCM massage I hv tried in Singapore.  Professional masseurs, clean & neat rooms, frdly & helpful staff, reasonable charges and u can join their packages at better rates.\n\n",
        "Daniel Arranz\nLocal Guide·76 reviews·56 photos\nRated 5.0 out of 5,\nSo far, the best deep tissue massages I have had. The clinic is intimate enough, they have individual rooms for massage.\n\n",
        "sameer gupta\n2 reviews·3 photos\nRated 4.0 out of 5,\nGood ambience and ok massage\n\n",
        "seven wang\n1 review\nRated 5.0 out of 5,\nNice experience here. Susan is very professional! Will definitely come again\n\n",
        "Yuanchen Xiao\n1 review·1 photo\nRated 5.0 out of 5,\nvery nice and relax exprience^_^\n\n",
        "Jairaj Amin\nLocal Guide·12 reviews·4 photos\nRated 5.0 out of 5,\nOne among the best massage centre in Singapore,  professional.\n\n",
        "XO H\n2 reviews\nRated 5.0 out of 5,\nVery impressive treatment and all staff well friendly. Definitely strongly recommendation.\n\n",
        "Matthias Loy\n5 reviews·1 photo\nRated 3.0 out of 5,\nThe staff are pleasant and place is clean generally. Had a bad experience today when messuer insisted on strength despite repeated instructions to go softer.\n\n",
        "Lijun Zhao\n1 review\nRated 5.0 out of 5,\nHad a good night sleep after relaxation massage! Enjoyed it so much!\n\n",
        "wei zhang\n1 review\nRated 5.0 out of 5,\nhas been suffering from back and shoulder ache from office work, massage in the morning definately prepares me for the day!\n\n",
        "Rin Chang\n1 review\nRated 5.0 out of 5,\nhave a session with Susan, fantastic experience. Thank u!\n\n",
        "Leongboi\n11 reviews·5 photos\nRated 5.0 out of 5,\nExcellent services and really nice service crews! Strongly recommended if you are looking for TCM, chinese massage or cupping services!\n\n",
        "Jay Kovak\nLocal Guide·50 reviews\nRated 4.0 out of 5,\nI had a good experience, although I did not have a true pathology, I just went to improve my general stamina\n\n",
        "Sanjay Kewlani\nLocal Guide·21 reviews·11 photos\nRated 5.0 out of 5,\nExcellent place for TCM and massage. Very capable and skilled therapists.\n\n",
        "Chang Cao\n5 reviews·18 photos\nRated 5.0 out of 5,\nGreat!\n\n",
        "Perpetua Ng\n3 reviews·6 photos\nRated 5.0 out of 5,\nLinda is very delicate and professional.\n\n",
        "Joseph\nLocal Guide·33 reviews·1 photo\nRated 4.0 out of 5,\nGood\n\n",
        "Adrien Verbeek\nLocal Guide·17 reviews·41 photos\nRated 5.0 out of 5,\nGreat deep tissue massage, best I've tried\n\n",
        "Ping Wong\n1 review\nRated 5.0 out of 5,\nPerfect to get rid of your painful knots!\n\n",
        "Lim Pearly\n1 review\nRated 4.0 out of 5,\nGreat service !\n\n",
        "Lum Qing Wen\n1 review\nRated 5.0 out of 5,\nEffective treatment and good service.\n\n",
        "Christofle Rio\n6 reviews·1 photo\nRated 5.0 out of 5,\nGreat place professional treatment\n\n",
        "Yang Ge\n3 reviews\nRated 5.0 out of 5,\nVery professional, will visit again.\n\n",
        "s vialli\n8 reviews\nRated 5.0 out of 5,\n👍👍\n\n",
        "XinRan Huang\nNo Past Reviews\nRated 5.0 out of 5,\nDefinitely enjoyed my neck and shoulder treatment with LeLe. if have a stiff neck and hard shoulder you should look for LeLe. Be prepared for pain(during) and shiok (after)\n\n",
        "Denny Choi\n2 reviews\nRated 5.0 out of 5,\nGood massage\n\n",
        "X\nLocal Guide·11 reviews·40 photos\nRated 5.0 out of 5,\n(Translated by Google) I did slimming massage here, using grapefruit lemon essential oil. The legs are really thinner! Auntie is very professional! Really recommend! !\n\n(Original)\n在这边做了瘦身推拿，用的是柚子柠檬精油。腿真的细了不少！阿姨很专业！真心推荐！！\n\n",
        "Amanda (Amanda)\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) Today, I came to maintain the car and do a massage by the way. The technician is very professional, strong and has a very good attitude. The environment is also elegant and clean. The pressing process is sore because I haven't massaged for too long. After pressing it, I feel comfortable and I will take my husband next time. come together\n\n(Original)\n今天过来保养车子顺便做个推拿，技师非常专业，力道足并且态度非常好，环境也优雅整洁，按的过程有酸疼是因为我太久不按摩了，按完浑身舒爽，下次带老公一起来\n\n",
        "李金谣\n1 review\nRated 5.0 out of 5,\n(Translated by Google) This is the first time to experience Tui Na in Singapore, recommended by the Lion City Hot Mom. The location is easy to find, the environment is comfortable, and the technicians are very good. The key is no sales promotion! Before you come, you must make an appointment in advance, otherwise there may be no place.\n\n(Original)\n这是来新加坡初次体验推拿，狮城辣妈推荐的。位置很好找，环境舒适，技师手法非常好，关键是全程无推销！来之前一定要提前预约哈，不然可能没位置哟。\n\n",
        "Tao Tao\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) I experienced bone setting for the first time, and I felt that my shoulders and necks had come alive. The little sister is very amiable and will not be nervous 😊\n\n(Original)\n第一次体验正骨，做完感觉肩颈都活过来了。小姐姐很和蔼可亲，不会紧张😊\n\n",
        "yi jiang\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The environment is clean and tidy, and the technician service is also good, very satisfied\n\n(Original)\n环境干净整洁，技师服务也不错，挺满意\n\n",
        "苏伟\n1 review·2 photos\nRated 5.0 out of 5,\n(Translated by Google) Elegant environment and superb technology👍🏻👍🏻👍🏻\n\n(Original)\n环境优雅，技术精湛👍🏻👍🏻👍🏻\n\n",
        "Venus\n10 reviews·24 photos\nRated 5.0 out of 5,\n清潔なところがいい\n\n",
        "Justin Wee\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Sally massage is awesome👍It feels like floating on the clouds\n\n(Original)\nSally 按摩功夫真棒👍感觉就像漂浮在云上\n\n",
        "WenHuan Cheah\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Very good experience😊\n\n(Original)\n很好的体验😊\n\n",
        "王玲\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Alex M\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Winnie MC Wee\nLocal Guide·20 reviews·170 photos\nRated 5.0 out of 5,\n\n\n",
        "Elvin Lim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Xiuli Gao\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jean Eu Leong\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Lyne Goh\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Daniel Govindan\nLocal Guide·1 review·1 photo\nRated 5.0 out of 5,\n\n\n",
        "TING ZHOU\n1 review\nRated 4.0 out of 5,\n\n\n",
        "Amelia\n81 reviews·65 photos\nRated 1.0 out of 5,\n\n\n",
        "W O\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Hoa Poh Lin\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "gek liang goh\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "chongtian peng\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Test\nLocal Guide·15 reviews\nRated 5.0 out of 5,\n\n\n",
        "Jing Wen\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Sophia Xu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Kevin Tan\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Joshua Wong\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Jasmine Wong\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jayce Peng\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Aurelia Roselyn\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "四二\nLocal Guide·37 reviews·16 photos\nRated 4.0 out of 5,\n\n\n",
        "kaijin flux\n1 review\nRated 5.0 out of 5,\n\n\n",
        "JH\nLocal Guide·26 reviews·65 photos\nRated 5.0 out of 5,\n\n\n",
        "Ashish Shivankar\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Gabriella roselyn\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Qiqi Zhang\n1 review·5 photos\nRated 5.0 out of 5,\n\n\n",
        "Linlin Zeng\n5 reviews\nRated 5.0 out of 5,\n\n\n",
        "MEIYUAN CHEN\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Geraldine Chong\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Edwin Low\nLocal Guide·4 reviews·144 photos\nRated 5.0 out of 5,\n\n\n",
        "Zou zhancun\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "T J\n3 reviews·12 photos\nRated 5.0 out of 5,\n\n\n",
        "hailong zhang\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "940702nee\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "6334 1678",
    "Website": "https://orientalthsg.com/"
}