{
    "Name": "Precious Foot Reflexology - Massage  Tui na  Foot Massage  Gua Sha - Clementi",
    "Products": {
        "40 mins Foot Reflexology + 20 mins Back & Shoulder": "$58.00",
        "60 mins Foot Reflexology + 30 mins Back & Shoulder Massage": "$70.00",
        "90 mins Foot Reflexology + 30 mins Back & Shoulder Massage": "$90.00",
        "Back & Shoulder Massage": "$38.00 – $58.00",
        "Foot Reflexology": "$28.00 – $75.00",
        "Body Massage": "$45.00 – $112.00",
        "Ba Guan (20mins)": "$38.00"
    },
    "Address": "443 Clementi Ave 3, #01-65, Singapore 120443",
    "Opening Hours": "Saturday 10am–10pm\nSunday 10am–10pm\nMonday 10am–10pm\nTuesday 10am–10pm\nWednesday 10am–10pm\nThursday 10am–10pm\nFriday 10am–10pm\nSuggest new hours",
    "Rating": "4.8\n339 reviews",
    "Reviews": [
        "Jeanette Ong\n5 reviews\nRated 1.0 out of 5,\nUnpleasant encounter at Precious Foot Clementi outlet because of the rude staff counter (I think she is the manager). I asked for 30 min foot massage and 20 min neck and shoulder massage. My masseuse was Ivy, she served me with a herbal foot bath (10min) and told me that I can switch on the tap to add more hot water if needed. After awhile, the water temperature was cooling off and I turned on the tap to add a little more water. The staff counter immediately hollered to Ivy that 'the customer is switching on the tap on her own'. I felt embarrassed by the unprofessional behaviour of the staff counter. I was clearly told by Ivy that I can add more water if I want to. Masseuse Ivy was kind and tried to make up for the unpleasantness. I will give Ivy 5 stars for her massage skills and 1 star for the staff counter.\n\n",
        "Dune Might\nLocal Guide·65 reviews·38 photos\nRated 5.0 out of 5,\nWent for a 90minutes foot massage. Great experience! Especially like it that they clean your feet after so no oily feel.\n\n",
        "ENYU\nLocal Guide·27 reviews·10 photos\nRated 4.0 out of 5,\nHad a 60 minutes foot massage and 60 minutes full body massage. Foot massage was great but body massage was rather disappointing - staffs kept talking nonstop for an hour, really hard to rest properly.\n\n",
        "Jeanette Ong\n5 reviews\nRated 1.0 out of 5,\nUnpleasant encounter at Precious Foot Clementi outlet because of the rude staff counter (I think she is the manager). I asked for 30 min foot massage and 20 min neck and shoulder massage. My masseuse was Ivy, she served me with a herbal foot bath (10min) and told me that I can switch on the tap to add more hot water if needed. After awhile, the water temperature was cooling off and I turned on the tap to add a little more water. The staff counter immediately hollered to Ivy that 'the customer is switching on the tap on her own'. I felt embarrassed by the unprofessional behaviour of the staff counter. I was clearly told by Ivy that I can add more water if I want to. Masseuse Ivy was kind and tried to make up for the unpleasantness. I will give Ivy 5 stars for her massage skills and 1 star for the staff counter.\n\n",
        "Dune Might\nLocal Guide·65 reviews·38 photos\nRated 5.0 out of 5,\nWent for a 90minutes foot massage. Great experience! Especially like it that they clean your feet after so no oily feel.\n\n",
        "ENYU\nLocal Guide·27 reviews·10 photos\nRated 4.0 out of 5,\nHad a 60 minutes foot massage and 60 minutes full body massage. Foot massage was great but body massage was rather disappointing - staffs kept talking nonstop for an hour, really hard to rest properly.\n\n",
        "Renee L\n1 review\nRated 5.0 out of 5,\nConvenient location at Toa Payoh. No Hard sell! Great services by both the receptionist Nicole (hope I got the name right) and Jackson!\nNicole is very patient and took time to listen to my worries.\nJackson on the other hand is very skilful! I STRONGLY recommend him! From the massage, you can see the years of experiences he had. Usually it can be a painful experience and yet doesn’t relieve the pain, after not having a massage for a long time. However Jackson was able to relieve the pain and make the whole experience tolerable. 👍🏻👍🏻👍🏻\n\n",
        "Abhinav Nagpal\n2 reviews\nRated 2.0 out of 5,\nUsed to be a regular here (Clementi outlet) but sad to see the deteriorating levels of service and basic etiquette. The staff was constantly chatting and giggling, with zero regard for their customers. Almost felt like they were forced to service us, as they were constantly looking at the clock and were so quick to wind up as soon as the clock hit the hour mark.\n\n",
        "Aaron Dass\nLocal Guide·57 reviews·82 photos\nRated 2.0 out of 5,\nI visited this place with my wife.\nDid the 1h foot massage ($40) although we just wanted the 30 min. Thanks to the very persistent sales lady. It was too pushy to my liking , keep asking us to upgrade from the service we chose or keep asking us to try some oil even after we said no thanks multiple times.\n\nMassage staff were oki normally polite and did not rush, decent finger pressure and technique.\n\nAmbiance very normal. Grey walls\nNo music.\nNo aroma\nNot too cold air-cond I like it but some not so.\nChairs were clean and comfy.\nDid see the staff spray and sanitise\n\nKinda strange they asked my wife to sit far away when we the only once there. Well I'll chalk that to covid situation.\n\nOverall I don't think I'll be back 😛 I've tried better. Cheers\n\n",
        "Manoj M\n23 reviews\nRated 5.0 out of 5,\nLovely massage and feel very relaxed. Very professional. Would recommend this to anyone looking for a good massage. The masseuse was great.!\n\n",
        "Chunchun Fang\nLocal Guide·411 reviews·1,076 photos\nRated 5.0 out of 5,\nNo frills foot reflexology. Conveniently located next to clementi MRT station. Place is clean and smells fresh. The massager is skilled as well. Good quality and value for money. Would come back. Receptionist tried few times to sell package deals but overall pleasant experience.\n\n",
        "Alan Chan\n109 reviews·22 photos\nRated 5.0 out of 5,\nRobin is well experienced in his skills such as guasha and giving advice etc. Paid $88 for an hour including guasha. Highly recommended\n\n",
        "bimmer man29\n5 reviews·1 photo\nRated 5.0 out of 5,\nGood service, no hidden price, friendly and accommodating. Went for leg massage, very good. Highly recommend ravvin.\n\n",
        "Manish Thapar\n3 reviews·1 photo\nRated 5.0 out of 5,\nTried \"Body Therapy\" with Sue for first time here. It was an excellent experience. Looking forward to visit again. Thanks.\n\n",
        "Xin Ping\n4 reviews·1 photo\nRated 5.0 out of 5,\nJust finished my foot massage and neck, shoulder massage combo @ $55 in this outlet. Andy have done an extremely great job in loosening my tight muscles!! Customer service is also good~ Although the price is on the pricey side, but this experience is really enjoyable and I  recommend people to support them~ thank you Andy.\n\n",
        "Simba Senorita\n3 reviews·1 photo\nRated 5.0 out of 5,\nMassauer Sue was very experienced.Will return and get her to massage again when making next appointment .👍👍\n\n",
        "Priya\n1 review\nRated 1.0 out of 5,\nToday I took neck, shoulder, back massage, done by Ivy. She didn't use oil for massage, have to pay extra $12 for that.Just massaged on top of my dress. This is not the way of doing this. Sad to say I wasted my $45. I would not recommend this type of massage.. Every penny is valuable, treat every customers same.\n\n",
        "Amran Zanis\n1 review\nRated 5.0 out of 5,\nReceptionist Jun is very friendly and advise accordingly to my problem. I was assign to masseuge Lili to help with my troubled areas (shoulder and calf muscle) she did a very good job and applied good pressure at all of my trouble points she is good at finding those knots. Thank you to the team members will come back again definitely.\n\n",
        "Ohamidah\n1 review\nRated 5.0 out of 5,\nAndy is an excellent massage therapist, and is very friendly. I saw him after so long having stiff neck and I had all the expected knots and strains. He found the trouble spots and left me feeling great. Would definitely go for massage with him again in the future\n\n",
        "Evangeline Tan\n10 reviews·1 photo\nRated 5.0 out of 5,\nVery skilled reflexologists and very enjoyable experience! No hard selling and generally very professional :) love it!\n\n",
        "Jessica Kong\n7 reviews\nRated 5.0 out of 5,\nA good experience, had the normal neck, back massage, the massage was good, strength was deep tissue kind.. Though we never top up for essential oil, staff respect our choice and was never pushy. Staff were friendly and nice. Staff will sanitize the bed in front of you and also check with masseau if towels were all clean. It's like they will bother to check instead of assuming things were done, so it gives me a piece of mind. Will definitely go back for future massage.\n\n",
        "Feryashi Sng\n1 review\nRated 5.0 out of 5,\nVery relaxing massage by therapist Andy. Highly recommended. Right to the point n with just the right strength. My feet feel revitalised! Friendly boss and staff shared their service information but are not pushy. Thumbs up. Will definitely visit again and recommend to friends :)\n\n",
        "Dawn Tan\n6 reviews·12 photos\nRated 5.0 out of 5,\nI genuinely enjoy coming to this place for a good massage. This is my 3rd visit, and i’ve been faithfully served by Ivy who is very skilled!! I did the 45min neck, back and shoulder massage. Ivy always applies just the right amount of pressure and knows precisely the tension points in my muscles to work on. Most of all, i respect her for the effort and great strength she gives everytime (even when I come for a night appointment and she was probably already tired from a whole day of work) Ivy, thank you for making my shoulder and back feel so much better (:!\n\n",
        "Katherine Foong\n1 review\nRated 5.0 out of 5,\nClean environment with relaxation music and Friendly staff. I tried foot massage and theIr therapist Michael was friendly, skilful with experience. He really press hard & soft on my foot accuputure point. Overall service was excellent. I give Michael 5 stars n 5 likeS 👍👍👍👍👍. Will come back again.\n\n",
        "josef ang\n1 review\nRated 5.0 out of 5,\nMy first time coming to this massage place and was attended by Andy. He was really good strong and firm. Very professional and sharing his knowledge. My body feel relaxed after the session. Recommended and will come back again.\n\n",
        "Ruth Sek Wan Ru\nLocal Guide·44 reviews·30 photos\nRated 5.0 out of 5,\nI have been visiting this massage parlour almost every month or twice a month! Masseur like Michael is very skilled. It is of correct pressure, not too hard or soft and super on point.\nYou can look for Shu too. They are both really good! :) most importantly, it is very affordable and convenient!\n\nTwo thumbs up!! 👍 👍\n\n",
        "Rachel Tan\n3 reviews·4 photos\nRated 5.0 out of 5,\nI went for a massage immediately when Phase 1 started on 19 June as my body was aching from built-up tension accumulated over the time working from home. I did the 4 in 1 feet, neck, shoulder, back package for $50 for 1 hour.\n\nThe masseur Andy was skilled and friendly. l left the place with my neck and shoulder and loosened up. l actually felt more relaxed and less tension in my shoulders. Andy also used traditional foot reflexology techniques to release the tension in my shoulder through massaging my feet. We had a enjoyable conversation and l enjoyed the whole experience.\n\n",
        "Stephen Mak\n3 reviews\nRated 5.0 out of 5,\nWas in need of a back massage, and decided to book an appointment here. Mr Andy did a very good job loosening up all the knots and making me feel reborn lol. Would definitely recommend to others!\n\n",
        "Pickyeater\n16 reviews·3 photos\nRated 4.0 out of 5,\nMy first visit to this place. I needed a strong massage and my therapist was quick to adjust after I asked for a stronger massage. Definitely one of the better massages I have had in Singapore. My only grievance is the cost. A 90 minute massage costs $85 and you’ll be asked to add on another $12 if you wish to have an oil massage. That’s a total of $97...more pricey than any other neighbourhood massage places.\n\n",
        "Rachel Tay\n10 reviews·4 photos\nRated 5.0 out of 5,\nI read the good reviews and so decided to try out with my bf. Oh wow we are impressed! They are nice, friendly and have good massaging skills. Michael is really good, i din get to catch the name of another chinese masseau but he was really good as well. Highly recommended!\n\n",
        "Shawn Lee\n1 review\nRated 5.0 out of 5,\nvery good massage! the receptionist and some of the masseurs can speak english. clean place as well. they are not pushy about their packages at all. however, do note that oil is a top up of $12. i would return again!\n\n",
        "Tongcai Chen\n2 reviews\nRated 5.0 out of 5,\nHad a great foot massage session with Andy. He was very skillful, controlled his strength well and had a very friendly personality which helped add to a very pleasant visit\n\n",
        "Michelle Johnson\n1 review\nRated 5.0 out of 5,\nMichael is one of the best therapist in this place.  Very professional and polite. Hardworking. Thumbs up for his service. The place also is a good place if you want to relax for massage. The staff here is respectful and friendly. I highly recommend.\n\n",
        "Ian C\n9 reviews\nRated 5.0 out of 5,\nSo honestly the place wasn't terribly well furnished and there was construction noise that was heard before the massage. The staff were slightly uncoordinated and I heard mild arguing and loud conversations between them several times. Not exactly a tranquil environment. However, the deep tissue massage by Andy was shiok and he wasn't afraid to use his strength to clear the knots in my body. So far the best massage I've had in Singapore.\n\n",
        "Sophie Syed\n4 reviews\nRated 5.0 out of 5,\nReally relaxing place! Love the one hour foot reflexology massage here, and the 30 mins back rub. Perfect after sitting all week doing work! The staff are really friendly, polite and are generous with warm tea as well! The place itself is clean, and hygiene standards are good.\n\n",
        "Sharon Melissa Telingai\n2 reviews\nRated 5.0 out of 5,\nMy first time coming to this massage place. Was served by Miss Ivy. She was really good with her hands. Strong and firm. Three hours went by in a flash! Came out from the place feeling much better and refreshed. Definitely recommended!\n\n",
        "Priya Rath\nLocal Guide·59 reviews·12 photos\nRated 4.0 out of 5,\nIvy was very skilled and friendly, I will definitely return.\nThe outlet has two rooms and the one I was at was quite small. Ambience could be better\n\n",
        "Kit Lam\n9 reviews\nRated 5.0 out of 5,\nWent to the Clementi branch, was served by Michael. He is really good in massage skills n techniques. 100% recommended!!! Very friendly, caring nice guy.\n\n",
        "Adrienne Koh\nLocal Guide·61 reviews·1 photo\nRated 5.0 out of 5,\nMy therapist, Sue, was very friendly, professional and experienced. Felt very relax after the session. She helped to reduce my neck and shoulder pain which I've been experiencing for a week. Would recommend you to try!\n\n",
        "Carmond Lim\n8 reviews\nRated 5.0 out of 5,\nHad a fantastic massage by Michael. It was no wonder that he's high recommended by the reviewers here. Very experienced  masseur who knew what to do to\nrejuvenate tired feet & body. He\nhas good technique & skills. Applied just the right amount of pressure without causing any pain & yet it was effective in relaxing\nthe tight muscles\n\n",
        "Cindy Claudia Susanto\n3 reviews\nRated 5.0 out of 5,\nThe foot massage was really good.. My therapist is Andy Liu Very recommended, he has the knowledge of every nerve and point of my foot.. I like harder massage and he can gave it to me! Very Recommended! Good Job Andy! Will come back here for sure. 👍\n\n",
        "Fiona Ho\n2 reviews·1 photo\nRated 5.0 out of 5,\nMy mom has been to so many massage spas but this is the first time she praised her masseuse.\n\nLook for Ivy and Jas :-)\n\n",
        "evan c.\n1 review\nRated 5.0 out of 5,\nEnjoyed our massage at the clementi outlet. Sue and lily helped with our massage and the strength used was just right. They were also able to point out issue we faced such as bad posture that lead to headache. Definitely a must come for massage!\n\n",
        "Ray T\n1 review\nRated 5.0 out of 5,\nhighly recommended! me and my wife was very satisfied. They really have best and experienced masseuse👍🏻👏🏻👏🏻We had Andy and Lili they both have great skills, our tired and stiff body is very relaxed now.We will definitely be back!\n\n",
        "TAN YAN\n2 reviews\nRated 3.0 out of 5,\nWent to the TPY branch few times for my massage, the service is excellent. Except the damage flooring & ceiling which make me  feel unsafe. Hope the management can do something about it....\n\n",
        "Simon Ng\n2 reviews\nRated 5.0 out of 5,\nHad my first foot reflexology today and it was amazing. Good and appropriate strength was apply not those piano kind of massage.\nMichael was the one attending to me and will definitely look for him for my future session\n\n",
        "Sherline Lai\n2 reviews\nRated 5.0 out of 5,\nI am a regular haha. My massager is a ah sue. She had been my massager since the first time I come . She is super friendly and professional. Her skill is excellent too. I always am in a relax mode during my visit. I enjoy her massage and chatting. Thank you 😍\n\n",
        "PropertyAdhanaKamis IngatHartanahIngatAdhana\n2 reviews\nRated 5.0 out of 5,\nIvy is a good masseue. 😜😆😆\nI can recomend her. She massaged me many times\nBook your massage with Ivy. Call precious foot & book for her service\n\n",
        "Dabbling Dabblers\n5 reviews·3 photos\nRated 5.0 out of 5,\nDecided to try this place with my husband since it got such high review ratings, and the experience didn't disappoint. The staff was polite and friendly, place was clean and spacious with reasonable affordable prices. Both of us enjoyed our massages very much, will come back again.\n\n",
        "Chermaine Lim\n2 reviews\nRated 5.0 out of 5,\nThanks June for the recommendation! Tried a shoulders, neck and back from Michael for the first time and was pleasantly surprised at how comfortable the whole experience was. Will definitely be back to try the foot massage!\n\n",
        "Jannah Osman\n3 reviews\nRated 5.0 out of 5,\nfirst time visited this place. nice ambience. was served by Ivy. her massage is gentle but yet strong on point. 😃 really hit those sore spot. awesome! would definitely visit again. recommend to try out. 👍👍👍\n\n",
        "Julian Galistan\n6 reviews·5 photos\nRated 5.0 out of 5,\nMichael is an amazing massage therapist. I asked to up the strength during the massage and he maintained the intensity throughout. It was a very good experience overall and I highly recommend to everyone.\n\n",
        "Tracy Yap\n2 reviews\nRated 5.0 out of 5,\nVisited on 4/10/20 night for foot & back massage. My treatment is done by Michael who is very skillful yet gentle with no pain. I will visit this shop again together with my hubby. Thumbs up.\n\n",
        "Jia Da Lee\n1 review·3 photos\nRated 5.0 out of 5,\nRecommend Andy!\nI came in with severe headache. After a 45 mins session, he not only relieved my headache but my body ache too.\n\nVery professional. And accurate massage!\n\nThe place is generally clean, the towel they use and replace are clean too.\n\nIf you are looking for someone with strength, you might want to look for him.\n\n",
        "Vina Hamzah\n2 reviews\nRated 5.0 out of 5,\nMy first time here to do feet reflexology ($35) and Mdm Shu Keep was my masseuse.\nHer pressure was just nice for me.\nShe gave me some good advice on how to care for my well-being after looking at my feet and why they were hurting.\nWill be back definitely ☺️\n\n",
        "Dinah Ahmad\n1 review\nRated 5.0 out of 5,\nHad a good foot, neck, shoulder back massage. Should’ve taken 120minutes, but 60minutes was great too! Michael did my massage & he’s very good! Very recommended 🤩\n\n",
        "Macky Suson\n1 review\nRated 5.0 out of 5,\nAndy’s massage is perfect! I had 1 hour foot massage and 1 hour body massage and after 4 weeks of feeling so much pain on my back, legs and shoulder, I went home feeling like a baby. I am pretty sure I will have a great sleep tonight! Thanks Andy!\nJoey is amazing too at the front desk!\n\n",
        "farah nadiah\n4 reviews\nRated 5.0 out of 5,\nEnjoyed my experience here. Massage was great and the masseuse really took her time to massage my pain points, while constantly checking in if everything was okay. Would highly recommend!\n\n",
        "Anshu Vajpayee\nLocal Guide·29 reviews·4 photos\nRated 5.0 out of 5,\nI am writing this review little late. I took the massage session in March with Andy.   He knows very well different points  for massage and relaxing.  Overall very good experience with Mr Andy.  Also no hard selling for any package.\n\n",
        "CP Sun\n2 reviews\nRated 5.0 out of 5,\nThe place is very clean and counter staff are very friendly . My wife and I had a 90 mins oil massage by LiLi and Ivy and both of them were very good and professional and we enjoyed our massage throughly . Will have our regular massage there whenever we are free .\n\n",
        "Lance Zheng\n9 reviews\nRated 5.0 out of 5,\nWent with my friend for massage after seeing the good reviews. Andy Liu and Sally served us, and both have great skills. They also abide to social distancing by not overcrowding the massage area.\n\n",
        "Debbie Low\n6 reviews·1 photo\nRated 5.0 out of 5,\nPositive first experience at Clementi Outlet at affordable quality promotional package for 90 mins shoulder, back and foot massage.\nBoth Masseurs Lili and Shuchun are very professional and experience in their fields. Very interactive. Will patronize again.\n\n",
        "Gabriel Heng\n5 reviews\nRated 5.0 out of 5,\nHighly Recommended\nvenue for foot massage.\n\nVisited the place multiple times and every single time was satisfying. My favorite go-to venue.\n\nThe masseues and masseurs were equally fantastic.\nThey were friendly, honest, humble, applied adequate/ appropriate conversions/non-conversion during the sessions, skillful and professional.\n\nSo far, I have experienced Shu (female), Andy (Male) and Michael (Male).\nThey were all great in their own ways.\nHowever, I will go to Michael (Tiep) if I have a choice because his style is more suitable for my needs.\nHis massage method hit the points of my feet that require tension relief.\nThe strength applied was well balanced and adequate according to my pain endurance threshold and tension relief needs.\n\nUpdates as at 20th Oct 2020:\nHighly recommended body massage\nMichael's (Tiep) body massage was one of the best i ever had.\nPressures were at the right locations i.e. neck, shoulders, back. All tensions were very well relieved.\nMy go-to body massage also.\n\n",
        "梁彦宗Neo Yan Zong\n7 reviews·2 photos\nRated 5.0 out of 5,\nAndy is your guy, 5 stars. Without a doubt, one of the best masseurs in Singapore. Grounded personality, very nice to talk to. Great experience and I will be back again (:\n\n",
        "Andy Lam\n3 reviews\nRated 5.0 out of 5,\nMichael is one of the best therapist, professional and polite. Me and my wife were highly satisfied. Thumbs up for his service. Keep up the good work! Cheers!\n\n",
        "Eileen Fong\n2 reviews\nRated 5.0 out of 5,\nHad a full body massage with LiLi and was very pleased with my experience. She was able to release the tension in my back with her excellent massage techniques. She is also very pleasant and courteous. Will return again.\n\n",
        "Kat Tan\n1 review\nRated 5.0 out of 5,\nDid a foot and back massage with them, and it was great! Their masseuses are very skilled and really released the knots in my back and helped soothe the aches in my feet. Will definitely come back for future treatments!\n\n",
        "Zarina Walli\n27 reviews\nRated 5.0 out of 5,\nMichael was very good with the foot , neck,  back n shoulder massage. He practically took extra care when handling my shoulder. I will definitely recommend Precious Foot and credit to Micheal.\n\n",
        "Melisa\nLocal Guide·121 reviews·25 photos\nRated 5.0 out of 5,\nI woke up with a very stiff shoulder and neck 2 days ago. It didn't get any better at all the next day nor after a very long sleep. Never happened to me before.\nFound a recommendation online for this chain. Nice website. Very responsive and helpful WhatsApp!\nJust had a very good massage by Michael; will definitely come back for more!\n\n",
        "JT\n6 reviews·8 photos\nRated 5.0 out of 5,\nSue is awesome and very skilled! Customer service is superb! The place is clean! Just a bit noisy but all worth it and great value for money! Would definitely be back! Highly recommended!👍🏼👏🏼\n\n",
        "Empty Nest\n1 review\nRated 5.0 out of 5,\nI enjoyed a 40min foot massage which was wonderful. Just the right pressure working the tightness out of my feet. Afterwards 20min back massage. Very good, as I have hip issues and she worked perfectly around it and kept the pressure light for that.\nHighly recommend this place:)\n\n",
        "Dana Chong\nLocal Guide·41 reviews·42 photos\nRated 5.0 out of 5,\nHave a first time trial combo session of 1 hour foot reflexology and 30 mins of back shoulder massage. It was professional done by the masseur. Focus on where my foot and back pain. Although the delay occur due to overwhelming of customers during weekend but they still provide no rush service. Thank you and appreciate the service.\n\n",
        "Andrew Yin Ji Jian\nLocal Guide·110 reviews·82 photos\nRated 5.0 out of 5,\nAn affordable but well serviced massage parlour in Singapore! My masseur, Andy, was excellent - I would highly recommend him if you are keen to try them out!\n\n",
        "Jingmin Cai\n2 reviews·1 photo\nRated 5.0 out of 5,\nAndy was good not only on his massage skill and also his excellent customer service, able to provide me WiFi password and saw that my hp batt running low offer me his charging cable\n\n",
        "Celene Choo\n9 reviews\nRated 5.0 out of 5,\nHad a full body massage by Sue in the Clementi outlet. She was really attentive to my pain points and went out of her way to tend to my injuries. Great service!\n\n",
        "Lamb Mohamed\n13 reviews\nRated 5.0 out of 5,\nMichael was Superb! Good and strong pressure. Pressure applied was also on point. Immediately felt revitalised. Will definite return. Do make call in before going though, usually packed...\n\n",
        "Tricia Yeo\n2 reviews\nRated 5.0 out of 5,\nI had a back, neck and shoulder massage with Lily and she did a fantastic job. She was strong and accurate with her pressing and would check if the strength was alright\n\n",
        "Linus Koh\n5 reviews·2 photos\nRated 5.0 out of 5,\nHad a great session with Sue today. I find the herbal foot bath to be unique here compared to other shops. While it costs an extra $5 the pre soaking of the meet really helps with the foot massage\n\n",
        "Nicole Lee\nLocal Guide·32 reviews·49 photos\nRated 5.0 out of 5,\nBeen a customer for about 3 years. There’s never any hard-selling and it’s always easy to book a slot. All the therapists have different styles but are equally capable. Enjoyed my experience!\n\n",
        "Vasumathy MS\nLocal Guide·22 reviews·92 photos\nRated 5.0 out of 5,\nIt’s such a relaxing place to visit especially your foot handed over to Mr. Andy one of best massage therapist at this place will take care of all the hidden pain. I highly recommend you to ask for him in particular if you want to experienced the best massage\n\n",
        "countrystar Tong\n4 reviews\nRated 5.0 out of 5,\nHad a great massage (foot, neck and shoulder) today at Precious Massage! Highly recommended! I was served by Andy.\n\n",
        "Audrina Lim\n2 reviews\nRated 2.0 out of 5,\nThey didn't inform that use of massage oil is excluded with the fee($58) collected at the counter during payment. I was told that massage without oil was not optimum for muscle ache when I insisted not paying extra for the oil. I think they could have inform this to their customers before they pay.\n\n",
        "Ronnie Santoso\n1 review\nRated 5.0 out of 5,\nLily was very good with service. The foot reflexology was expertly delivered. She managed to also solve a very frozen shoulder and a very sore back. Worth every minute of the time here. Will definitely be back! 5 stars for her!!\n\n",
        "James Tran\n1 review\nRated 5.0 out of 5,\nFoot massage here is really really good. Last weekend, I took my friend to many attractions around Singapore and my feet hurt a lot. After spending 60 minutes here, my pain was gone. Sue and Andy are my favorite masseur!\n\n",
        "Louis Lee\n4 reviews\nRated 5.0 out of 5,\nMassage was really good and professional. Recommend looking for Andy!\n\n",
        "Lejon Chua\n1 review\nRated 5.0 out of 5,\nExcellent place to do massage, masseuse are all well trained and press at the right spots. Feeling very relaxed after.\n\nRecommend Michael who can reach deep into tissue and sooth nagging muscle pain.\n\n",
        "BỒ CÂU TRẮNG\n4 reviews·2 photos\nRated 5.0 out of 5,\nI had a foot massage with the addition of shoulders, back and head massage. Wow - worth the extra money for a high quality relaxing and therapeutic massage. Michael was a magician with his massage techniques. Thanks!😊\n\n",
        "Alexis Chan\n2 reviews\nRated 4.0 out of 5,\nMy reliable massage therapist would be Micheal! He is professional and untie the tight knots at the right place with the right strength. Hard to come by such a good therapist, consider to give it a try! :)\n\n",
        "Firdaus Malik\n1 review\nRated 5.0 out of 5,\nThe best massage from Michael ever.. and he give me some medical tips to.. gd service overall, for sure i will come again and  book for u Michael..\nExcellent!!\n\nPs. Atan\n\n",
        "muhammad jai hassan\nLocal Guide·15 reviews·21 photos\nRated 5.0 out of 5,\nMy first time. Cozy & soothing. I didn't have an appointment but luckily there's a slot. My masseuse is Michael.  Very good. Not too hard & not to soft, just nice even without me telling. Will come & find him again. Best is to come early in morning & weekday. No crowd so you have a peaceful foot reflexology.  Aahhhh. Heaven.\n\n",
        "Wee Boon Tan\n1 review\nRated 5.0 out of 5,\nMe and my wife did our full body massage here and we are both super satisfied with our therapist Michael and Lily. Would highly recommend the service here.\n\n",
        "Sherilyn Tok\n2 reviews\nRated 5.0 out of 5,\nI booked a last min appointment with ivy and she was really accommodating! Did neck, shoulder back massage and it was really relaxing. Feel really refreshed afterwards\n\n",
        "ash tiwari\n16 reviews\nRated 5.0 out of 5,\nHad a full body massage here with Ivy and it cured all my backaches. Highly recommended. Would try to go for the essential oil next time\n\n",
        "John Teo\n3 reviews\nRated 5.0 out of 5,\nRecommend Andy - Strength is on strong side but not too painful. Well versed with acupoints. Feel refresh and relief from tiredness after massage. Would visit again.\n\n",
        "Ziyou Zhang\n1 review\nRated 5.0 out of 5,\nVery excellent massage by Micheal. Every time my shoulder feel stiff and pain, I come and find Micheal. After massage, my back and shoulder very comfortable. Fantastic massage experience!!\n\n",
        "J “John” T\n3 reviews\nRated 5.0 out of 5,\nWas served and attended by Michael. Very good experience, he is professional and have good skill. My body feel relaxed after the session. Recommended and will come back again.\n\n",
        "Jemima Leung\n2 reviews\nRated 5.0 out of 5,\nIvy did my full body and neck shoulder massage. Her skills were really good. She was thorough with her massage and service.\n\n",
        "thomas chan\n3 reviews\nRated 5.0 out of 5,\nMassager is Ivy,  She is professional and friendly. Her skill is excellent too. I am fully refreshed after the session. Thank you Ivy. 😊❤️\n\n",
        "Dylan Tan\n1 review\nRated 5.0 out of 5,\nGood atmosphere, massage was very good as well. Prices affordable and they really dont shortchange on timing. Very pleasant experience!\n\n",
        "Jeric Wong\n4 reviews\nRated 5.0 out of 5,\nHad Michael for my 60min feet + 30min body massage. Strength was good and consistent all the way.\n\nWould recommend.\n\n",
        "Wallace Chan\nLocal Guide·120 reviews·142 photos\nRated 5.0 out of 5,\nAndy been awesome at his craft and shared pressure points that affect the body. He is careful and knowledgable about how each point can be felt on different parts of the body\n\n",
        "Thaddaeus Tan\n2 reviews\nRated 5.0 out of 5,\nDid a 40mins foot reflex and 20mins back and neck - must say one of the best experiences I've had :) Highly recommend Michael for a great strong massage!\n\n",
        "Azcel Martian\n2 reviews·5 photos\nRated 5.0 out of 5,\nVery relaxing massage done by Michael. All tensions release from my back legs and feet. Very nice. Will definitely come back again.\n\n",
        "Zhen Yin\n2 reviews\nRated 2.0 out of 5,\nDon’t understand why so many 5 stars. I had package of 60min foot massage, 30 min back and shoulders for $60, done by a lady. The foot massage was half good, meaning half the time you feel the shiok pain that comes with good foot …More\n\n",
        "Jennifer Cing\n4 reviews\nRated 5.0 out of 5,\nIf you need someone with strength call Andy. He is very good with his technique. He ensures that you can take the pressure when he start massaging.\n\n",
        "Roni A\n27 reviews·3 photos\nRated 5.0 out of 5,\nMasseuse andy really know what hes doing. My back pain is gone and feel much better. Amazed on how quickly my back is recovered shouldve gone to this place 3 days ago.\n\n",
        "Sneha Tilak\nLocal Guide·13 reviews·34 photos\nRated 5.0 out of 5,\nI took the 60 min foot massage which included the back and shoulder massage for 55sgd. Was done by Ivy. She was so good!\n\n",
        "Abdul Rahman Yacob\n1 review\nRated 5.0 out of 5,\nToa Payoh\nTreatment very good, especially Jeffery who gave his all when massaging me. Pain but nice after massage.\nYvonne the receptionist very friendly.\n\n",
        "alfred kwan\nLocal Guide·25 reviews·12 photos\nRated 5.0 out of 5,\nVisited this place after making an appointment online. Got assigned to Andy.\n\nVery professional and comfortable, took the 40min foot with 20min …More\n\n",
        "Mohamed Suffi Sapuan\nLocal Guide·10 reviews·58 photos\nRated 5.0 out of 5,\nPrecious Foot Reflexology (Clementi) is the place! Cozy and quiet ambience. The branch manager was friendly, explaining to us on the definition of reflexology. …More\n\n",
        "Hazel Riambon\n1 review\nRated 5.0 out of 5,\nIvy done my massage today and she’s very skillful. I’m very satisfied with her service and strongly recommend with my friends.  😍\n\n",
        "Mika Perlada\n2 reviews\nRated 5.0 out of 5,\nGood professional service by the team, highly rated. Body massage by Ivy was relaxing. will be back. Thank you\n\n",
        "Febe 3388\n1 review\nRated 1.0 out of 5,\nThe massage was very uncomfortable. when I requested for alittle more pressure she used all the strength. when I said it was painful she requested to change another of her colleagues to tasked over. It's a total disaster!!! Worst place I have visited! Poor service & very uncomfortable atmosphere throughout!!\n\n"
    ],
    "Phone": "8363 4703",
    "Website": "http://www.preciousfoot.com.sg/"
}