{
    "Name": "Precious Foot Reflexology - Massage  Tui na  Foot Massage  Gua Sha - Toa Payoh",
    "Products": {
        "40 mins Foot Reflexology + 20 mins Back & Shoulder": "$58.00",
        "60 mins Foot Reflexology + 30 mins Back & Shoulder Massage": "$70.00",
        "90 mins Foot Reflexology + 30 mins Back & Shoulder Massage": "$90.00",
        "Back & Shoulder Massage": "$38.00 – $58.00",
        "Body Massage": "$45.00 – $112.00",
        "Foot Reflexology": "$28.00 – $75.00",
        "Ba Guan (20mins)": "$38.00"
    },
    "Address": "177 Toa Payoh Central, #01-134, Singapore 310177",
    "Opening Hours": "Saturday 10am–10pm\nSunday 10am–10pm\nMonday 10am–10pm\nTuesday 10am–10pm\nWednesday 10am–10pm\nThursday 10am–10pm\nFriday 10am–10pm\nSuggest new hours",
    "Rating": "4.7\n206 reviews",
    "Reviews": [
        "hakasson\n3 reviews·1 photo\nRated 5.0 out of 5,\nIt's my very first massage experience here. I was warmly welcomed by a friendly and spontenous lady, introduced herself as Linda.  Front desk counter linda is professional, prompt and quick to attend to customers. Even though the place is almost full, she is very professional, always carry a smiling face. The Chinese massue did an awesome job! Had a 2 hour body massage with Sandalwood Essential Oil. Massaue's techniques are really excellent. Room is clean and tidy with soothing music. Definitely will return for massage again!\n\n",
        "Guay Gen Phua\n5 reviews·5 photos\nRated 5.0 out of 5,\nWent there first time after seeing some good reviews and did not disappoint! Jackson was explaining in detail the different parts of foot massage linking to the bdifferent body parts. He's very skilled and did not\njust use brute forces like some other massage place. No hard sell, will recommend! Thanks for the great massage!\n\n",
        "Natalie Tay\n1 review\nRated 5.0 out of 5,\nChanced upon this gem on google and requested for Jackson due to the many good reviews here. On my first visit, my main concern was to resolve my excruciating daily migraine which recently worsened. 1 week later, my migraine is almost 90 percent cured. Today was my second visit and I opted for the 2 hour body therapy addon 0.5 hrs to slim my bloated and protruding tummy due to stagnated qi and water. And to my astonishment, he managed to flatten my tummy significantly within half an hour. It has never been so flat in 2 years! Another thing which amazes me is that he is able to pinpoint and target problem areas instantly, instead of the systematic steps (123, abc) monotonous massages offered in many other places.\n\n",
        "hakasson\n3 reviews·1 photo\nRated 5.0 out of 5,\nIt's my very first massage experience here. I was warmly welcomed by a friendly and spontenous lady, introduced herself as Linda.  Front desk counter linda is professional, prompt and quick to attend to customers. Even though the place is almost full, she is very professional, always carry a smiling face. The Chinese massue did an awesome job! Had a 2 hour body massage with Sandalwood Essential Oil. Massaue's techniques are really excellent. Room is clean and tidy with soothing music. Definitely will return for massage again!\n\n",
        "Guay Gen Phua\n5 reviews·5 photos\nRated 5.0 out of 5,\nWent there first time after seeing some good reviews and did not disappoint! Jackson was explaining in detail the different parts of foot massage linking to the bdifferent body parts. He's very skilled and did not\njust use brute forces like some other massage place. No hard sell, will recommend! Thanks for the great massage!\n\n",
        "Natalie Tay\n1 review\nRated 5.0 out of 5,\nChanced upon this gem on google and requested for Jackson due to the many good reviews here. On my first visit, my main concern was to resolve my excruciating daily migraine which recently worsened. 1 week later, my migraine is almost 90 percent cured. Today was my second visit and I opted for the 2 hour body therapy addon 0.5 hrs to slim my bloated and protruding tummy due to stagnated qi and water. And to my astonishment, he managed to flatten my tummy significantly within half an hour. It has never been so flat in 2 years! Another thing which amazes me is that he is able to pinpoint and target problem areas instantly, instead of the systematic steps (123, abc) monotonous massages offered in many other places.\n\n",
        "Isha Edzy\n1 review\nRated 5.0 out of 5,\nMy 3rd time visit . It was never a disappointment !! Their professional masseuse , Jason , can explain in detailed the pains u had & the caused of it n even give advises ! Not every masseuse can do that , thumbs up 👍👍👍👍👍👍, & thank you 🙏🙏 will definitely return again ✌️✌️\n\n",
        "Joseph Tan\n2 reviews\nRated 5.0 out of 5,\nGreat massage experience! My assigned masseur was Mr. Chong and he was professional and polite. I really enjoyed my 1 hour foot massage. The 3 very friendly ladies at the counter were very courteous as well! Love the cosy environment! Keep it up!\n\n",
        "law\n4 reviews\nRated 5.0 out of 5,\nAmazing first experience here. Came with hip inflammation issues and walked out feeling a lot better. Great service and skills by Jackson. Highly recommend\n\n",
        "jaswinder kaur\n1 review\nRated 5.0 out of 5,\nI would highly recommend massuer Jackson from TP outlet. He is so experienced in his skills that I feel very comfortable & relaxed when he massages my legs & feet. He doesn't make it painful for me and uses the right strength & acupressure to help resolve my issue of poor blood circulation. I can say that definitely my legs feel much better after each message session. Thks Jackson.\n\n",
        "Roseanne Peh\n11 reviews·2 photos\nRated 5.0 out of 5,\nThis is my first Visit to this outlet due to neck strain and purchased 45 mins for neck shoulder treatment. Jackson is very good masseur and help to resolve my issue. He also identified that I have vertigo in which I did not even realised myself (I do have height phobia + easily get dizziness) His acupressure skills were good and no need to apply medicated oil. Will look for him again to resolve my vertigo issue! Price there is reasonable!\n\n",
        "Hemalatha Seenivasan\n2 reviews\nRated 4.0 out of 5,\nUncle Chong helped me ease my foot pain that arose from tendonitis. I was limping quite a bit before the treatment and felt so much better after his reflexology that I visited Precious Foot again in the same week to enjoy the benefits.\n\n",
        "Wong Teck Jung\nLocal Guide·202 reviews·339 photos\nRated 4.0 out of 5,\nI have been a patron of this massage center. Most masseurs are good and provide comfortable massages (foot massage is highly recommended). One particular masseur (Jackson) has good skill for head and shoulder massage.\n\n",
        "Woi Cye Lee\nLocal Guide·74 reviews·9 photos\nRated 5.0 out of 5,\nHad a massage from Jackson. I went to do a massage with ba guan as I suddenly lost hearing on left ear. I tried ENT and ate steroids. Just feel like to try tcm way. Surprisingly after Jackson's ba guan, I recover on the next day. Strongly recommend Jackson. He is good and experienced.\n\n",
        "Shira Imura Rozali\n2 reviews\nRated 5.0 out of 5,\nJust had my Prenatal massage. Ivy is quite good. Feel very relaxed and actually fall asleep. Really enjoyed the experience. Thank you so much. Will discuss with husb if will sign up for a package.\n\n",
        "CHUI WEN Annie Yap\n1 review\nRated 5.0 out of 5,\nIs quite a good experience for me & my mother in law. We’ve enjoyed it so much for our 60mins foot + 30mins neck & shoulder. My masseuse Jackson & my mother in law have met a malay masseuse really help alot to soothe the stiffness of our foot & shoulder.\n\n",
        "hau teng\n5 reviews·4 photos\nRated 5.0 out of 5,\nHad a 2 hours full body message session with masseur Jackson.\nHe is very professional and knowledgeable. His skilful techniques helped greatly in relieving my long backache and stiff shoulder. Strongly recommended and will be back again 👍\n\n",
        "ChauChyi Tai\n5 reviews\nRated 5.0 out of 5,\nJackson is a very excellent and professional therapist. I have experienced long period of lower back pain. He has resolved all of my problems. High recommending him.\n\nJackson is very skillful in treatment of 经络推拿，a very effective TCM treatment of pain relief as well pain recovery.\n\n",
        "Ruwi MK\nLocal Guide·22 reviews·32 photos\nRated 5.0 out of 5,\nBlessings to Jackson. I came here because of the google reviews, thought I’d take a chance. My legs were swollen, and for weeks I’ve felt fatigue, lack of energy. Jackson was amazing, he knew most of the issues I had and after the foot reflexology I felt so much better. Very healing! Thank you so much!!\n\n",
        "Bell Flower\n1 review\nRated 1.0 out of 5,\nIt was the worst massage I ever encountered theres ' The lady masseur does not have any technique. The pressure used was wrong, and she pinched the calf instead of pressing on them .  She doesn’t have any idea what she’s doing. My legs felt much more painful after visiting them. It’s unfair n unethical for the shop to send an untrained masseur just cos they are busy yet want business. Disappointed 😡\n\n",
        "Edward Lee W Y\n3 reviews\nRated 2.0 out of 5,\nMasseurs are good. problem is the counter staff who is quite absent minded and in conflict with the masseurs sometimes which ruins the massage experience. Hard to get appointment slots from the counter lady wearing specs.\n\n",
        "Jacyln Tan\n3 reviews\nRated 5.0 out of 5,\nWent to do foot, neck and shoulder massage. Mr Chong is able to use the right strength and pin point to the area that I am facing issues and tips on how to make it better. Thanks Mr Chong:)\n\n",
        "Syafiqah Suhaimi\n3 reviews\nRated 5.0 out of 5,\nWent over a few days ago! I was searching on Google the best reflexology place nearby. I somehow injured my foot and was unwell for two weeks, had to take a lot of medicine, on bed rest for 7 days and went to the doctor 3 times.. so I finally decided to go for a foot massage to see if it would help. It has been a few days after the massage and amazingly my foot has recovered like 90%! I would like to thank Jackson so much for attending to my needs and making sure that I will heal faster and better :) He definitely knows his forte! I recommend you to ask for Jackson when you come over/or make an appointment as he really takes care of the client. He also knew the problem as soon as he started the massage. Turns out I'm just very dehydrated and also overweight haha! I really have him to thank as if it wasn't for him I would still be on MC. Didn't have any cash on me to give tips but I'll be sure to give some the next time I'm there :) Thanks so much, he's a keeper, I hope you'll give him a raise! (Went to the TPY Outlet)\n\n",
        "Kiam Chew Sim\n1 review\nRated 5.0 out of 5,\nLast Night went to here at 8.40pm with my boss and colleague.Meet a foot massage shifu call Jackson.He is really very knowleagable & well versed in this line.Know exactly where your body pain is while by massaging your foot.Highly recommended!\n\n",
        "Yiwen Gan\n1 review\nRated 5.0 out of 5,\nTried the foot and neck massage by Jackson. The massage is great, and my neck ache felt much better. Strength is good too, recommended !\n\n",
        "candy Lee\n1 review\nRated 5.0 out of 5,\nI suppose to feedback 2 to 3 weeks ago.\nI went to this place 4 times already . Each time the service is always good.  The last time I went is a Saturday with my sister. The lady that handle me is very good . At the end of the session I ask for her name. She told me she is Teresa, I was surprise as I knew the boss of this company is Ms Teresa . I am so lucky abs thank her for the services.\nThis place the staff is very good in massage . They have package but they never hard sales , this is the best part.\nI will continue to support this place. On the outside it look like a small place but they have 2nd level with lots of room.\nThe boss and staff all have good skill and the place is comfortable .\n\n",
        "Qi Lun Tan\nLocal Guide·20 reviews·85 photos\nRated 5.0 out of 5,\nTook combo 1 - 40 mins foot massage and 20 mins - neck and back massage. Overall is a good massage by Hong Mei and Joyce. Strength is adequate. Will visit again.\n\n",
        "Ong Xue Ting\nLocal Guide·19 reviews·27 photos\nRated 4.0 out of 5,\nGood service, felt the tension release with the massage strokes.\n\nPS - minused one star because they made customers input 5 stars for the review.\n\n",
        "C Ng\nLocal Guide·120 reviews·235 photos\nRated 1.0 out of 5,\nwhatsapp for appt..more than a day had past and did not receive any response. business so good until can't be bothered? saw gd reviews initially and thought of visiting but now my opinion changed. foc give me i also don't want.\n\n",
        "Victoria Huang\n5 reviews·2 photos\nRated 5.0 out of 5,\nHad the best reflexology here with my therapist, Albert. He really focused on the pain points of my feet, and spent time to fix them. Really rare for any reflexology session, which is usually more of an overall comforting massage. My foot and back feels so much looser and lighter now. Highly recommend!\n\n",
        "Sanskar D. Verma\n5 reviews\nRated 5.0 out of 5,\nUncle Richard is the best. He is 70 but is stronger than me. He is highly skilled and really loves his job. I felt renewed after coming out after foot, shoulder and neck massage. This place is highly recommended.\n\n",
        "Bryan Toy\n5 reviews·4 photos\nRated 5.0 out of 5,\nNice quaint establishment with great overall atmosphere.\nMasseur's skill (rani) was excellent - very experienced and able to press with a good amount of pressure to relieve pain points.\nService was great as well. Make sure to book an appointment beforehand, especially on weekends.\n\n",
        "Marites Cabildo\n1 review\nRated 5.0 out of 5,\nI come to this place to do my lower back pain...and i will feel so good..that my massage from jackson was excellent...\n\n",
        "Swister Yong\n2 reviews\nRated 5.0 out of 5,\nI went to their outlet in Toa Payoh many times. Each time was attended by different staff. Their skill are very good\n\nWent 3 weeks ago and was attended by a lady. Her skill is very good especially the back and head massage.\n\nAfter asking her name than I realized she is the boss of the place.\n\nThe outlet have 2 level and the 2nd level with lots of room. So far this is the place I like most with good skill abs environment is clean and comfortable. They also not hard sales their package.\n\nWill continue to support. You can book Thru  their webpage and will have some discount\n\n",
        "Raj Silvaraju\n1 review·1 photo\nRated 5.0 out of 5,\nThe entire session was good, the guy Jackson was very good. Worth money!! After so long had a good massage. Highly Recommended\n\n",
        "Andy Chua\n1 review\nRated 5.0 out of 5,\nThis  review come right after my first walkin experience.\nI have takeup a 2 hrs body treatment  section to treat knee achne n lower back pain. The experience Master Massage not only treated my pain also give heath advice /talk on  dos n don't .\n\nI will comeup for continual treatment.\n\nDo come n experience yourself.\n\nTump up Andy\n\n",
        "Galvin Pereira\n8 reviews·1 photo\nRated 5.0 out of 5,\nUncle Richard is one the best masseuse I have come across.  Extremely passionate about his job and knows the pressure points really well.  I highly recommend Precious foot reflexology.\n\n",
        "Mark Plunkett\nLocal Guide·58 reviews·120 photos\nRated 5.0 out of 5,\nFoot reflexology therapist Jackson is good! He uses thumb to relieve those knots and can help you to reduce those stressful knots on your neck and shoulders too. 👍\n\n",
        "Jia Li Lim\n2 reviews\nRated 5.0 out of 5,\nGood service by Mr Chong. Gives great input on my physical condition and tries to rectify any issuw\n\n",
        "Irene Zhuang\n1 review\nRated 5.0 out of 5,\nHave been coming to Theresa for a year plus for body treatments. The masseurs are really good and the admin staff are friendly, especially Evon.\n\n",
        "JULINN SIAH\n1 review\nRated 5.0 out of 5,\nFirst timer.. Great massage by mr cheong. Thank you\n\n",
        "W K\n11 reviews\nRated 5.0 out of 5,\nJust tried this uncle Mr Chong at TPY outlet. Very good if u like hard foot reflex.\n\n",
        "Zongting Peh\n1 review\nRated 5.0 out of 5,\nVery professional massage. Will return again. Staff are friendly\n\n",
        "naz edzy\n2 reviews\nRated 5.0 out of 5,\nI happened to look up on google regards to this place. Looking at the reviews,  was good,  so i went. It was clean,  friendly,  quiet place + the guy who massage,  was 👍👍👍👍👍👍!! Never get his name thou.\nThe price is affordable for all. Will return and confirm recommends this place to my friends!!  Thankz once again!!\n\n",
        "Bernard Chen\n2 reviews\nRated 5.0 out of 5,\nExcellent therapists. I enjoyed the foot reflexology very much.\n\n",
        "Carol Chan\n2 reviews\nRated 5.0 out of 5,\nvery satisfy with the massage done by Lynn, not able to find someone who can massage my pain points well👍🏻👍🏻SK also very friendly & professional. Thanks to them for being accommodating to my treatment.\nHigh recommended\n\n",
        "Celine Mama\n1 review\nRated 1.0 out of 5,\nFirst of all, I found this massage center through Google. I saw a lot of good reviews and decided to try out their Message skill.\n1) no hygiene\n2)They actually put on gloves to help me massage, you know that feeling is very uncomfortable\n\nI’m have quite bad experience with them and I really don’t know why they have so many good reviews. I’m not a fussy person And I Message at least once a week when I mentioned no hygiene means the environment is really kinda below the expectations, the towel have smell and not sure the towel is reuse or not , that kind of hygiene level I meant.\n\nMaybe there is some other good messuer but for me , my first visit is quite disappointing.\n\n",
        "Hugo\n7 reviews·10 photos\nRated 3.0 out of 5,\nThe price is a bit expensive. The massage environment is a bit noisy. Friendly staff.\n\n",
        "Sang Ju Lee\n4 reviews\nRated 5.0 out of 5,\nI saw the good review and decided to try. Riani was the masseur and he helped to relief the stiffness in my neck and back. Although it was slightly painful, the feeling afterwards was relieving. Recommend to try.\n\n",
        "Jason Rutkauskas\n2 reviews\nRated 5.0 out of 5,\nAs a Chiropractor, standing on my feet all day creates a lot of myofascial tension (not including old sports injuries). I've been coming here on and off for the past 2 years. Thankfully every person is phenomenal, has great \"feel\", strength, and knows how to ride the delicate balance between pain and pleasure. My most recent session was with Huang Lei, great service and treatment!\n\n",
        "maimonnesakhaom d/o abdul roof\n3 reviews·3 photos\nRated 5.0 out of 5,\nVery good I feel better after foot massage. My asthma better too. Thanks to Jackson.\n\n",
        "Nurul Norah\n3 reviews\nRated 5.0 out of 5,\nVery cosy! Very good skills! I should know, i am a therapist myself😅\n\n",
        "Khairul TrueStory\nLocal Guide·58 reviews·23 photos\nRated 5.0 out of 5,\nGreat massage. Fixed my back pain. Not just massage, gave advise also. Thanks Jackson.\n\n",
        "Evelyn Liang\n2 reviews\nRated 5.0 out of 5,\nUncle Chong very good! all my aches all he knows!\n\n",
        "Nico Wu\n5 reviews·1 photo\nRated 5.0 out of 5,\nMr Richard is really professional and provided the best experience for me in my quest to find the best foot reflexologist. Real and traditional foot reflexology techniques were implemented. Book yourself a session to find out!\n\n",
        "Frans Pranata\n1 review\nRated 5.0 out of 5,\nthe best spa and wellness in singapore.i recommended for who wants the foot or body massage to come here.the owner mrs theresa and evon served very well.5 star for the services.\n\n",
        "Yenni Kasim\nLocal Guide·105 reviews·71 photos\nRated 5.0 out of 5,\nWei wei's technique is great. Not very hard, but her energi goes deep while relaxing. This is the kind that I am looking for. She can find the problem n solve my neck ache. She can also find other problems that I did not mention.\nOne of the best in SG\n\n",
        "Cynthia Ng\n1 review\nRated 5.0 out of 5,\nExcellent service and great experience. Highly recommend Riani :)\n\n",
        "Vadi Veloo\n1 review\nRated 5.0 out of 5,\nVery good Massage place... Uncle Richard knows the points very well and really does the massage well. Will definitely recommend this place.\n\n",
        "Tan Catherine\n3 reviews·1 photo\nRated 5.0 out of 5,\nI have been going for massage sessions since 7 years old. Your staff, Jeffrey, is the best messeur I have ever tried so far. He is very skilful and capable in fixing my sprains from sport injuries/ backache. My weekly \"servicing\" by him allows me to continue playing my favourite sport. Jeffrey from Toa Payoh branch is really an asset to your organisation. He always aims to perfectly solve customers' sprains/ aching problems and he wont burge to give sloppy massage as he has a reputation to upkeep. Very professional instead! I have been going to the Toa Payoh branch for a few years and recommending my volleyball friends (at least 30+) to him too. Keep up the excellent service!\n\n",
        "shawn loh\n8 reviews\nRated 5.0 out of 5,\nNice cosy place. Went down with my wife and we both had a really good massage. Highly recommend Jeffrey and Riani for stiff neck and foot massage! Great job Precious Foot for the good experience. Will definitely be back again.\n\n",
        "Mean Han\n3 reviews\nRated 5.0 out of 5,\nThumbs up for Masseur Riani (TPY branch). Very good strength! Will definitely request for him next time!\n\n",
        "Choonsim Yap\n1 review\nRated 5.0 out of 5,\nGreat. my body relief fast. Thanks Jackson for great service. Definitely will come again.\n\n",
        "Starlight Whispers\nLocal Guide·15 reviews·20 photos\nRated 1.0 out of 5,\nSleazy place. Unprofessional masseur who did not allow me to request for a female masseuse before the foot reflexology session. Check out the place and observe if there is a decent number of staff. If not, an unprofessional experience will ensue\n\n",
        "Hazel Ferrer\n2 reviews·1 photo\nRated 5.0 out of 5,\nWas here 4 years back and loved the service. Now Imm back and still got the same good massage I had before. Worth trying! Recommended 👍🏻\n\n",
        "Sandra Koh\nLocal Guide·31 reviews·3 photos\nRated 5.0 out of 5,\nClean and convenient location. Just a stone throw from the mrt station. Been doing facial at theresa and tried the massage service at Precious foot. Friendly and highly skilled staffs. Jeffrey, Ong and even the ladies - Wang is very skilled. Always feel much better after a session with them.\n\n",
        "Guang Ren Loh\n9 reviews·1 photo\nRated 5.0 out of 5,\nI’ve been to many massage places in Singapore and I really find Precious foot to be one of the best. Very good knowledgeable masseurs and a nice cozy place. Highly recommend to massage lovers out there!\n\n",
        "Victor Lim\n16 reviews·6 photos\nRated 5.0 out of 5,\nRiani is an amazing massage therapist, highly recommended... i'm not a frequent patron of massage parlours, but 1 session with him makes me want to come back here every week!\n\n",
        "Gina O'Neill\n3 reviews\nRated 5.0 out of 5,\nHad the best massage and foot reflexology here.  Theresa was friendly and managed to did all my little spots that needed working on.\n\n",
        "MooMoo Dada\n6 reviews·3 photos\nRated 5.0 out of 5,\nFirst massage with staff Huang Lei, had an hour of  gua sha with oil massage. It was so good, the one hour felt like one and half hour massage. Definitely will go back again! Location is about 5 mins walk from TPY MRT.\n\n",
        "Brian Neo\nLocal Guide·53 reviews·79 photos\nRated 5.0 out of 5,\nHad a very good time! Service was very sincere and the massage is very comfortable.\n\n",
        "Johnny Koh\nLocal Guide·22 reviews·4 photos\nRated 5.0 out of 5,\nabsolutely love the location and ambience. most importantly, the massage was great and service was fantastic. However, please book in advance to avoid waiting. highly recommended !\n\n",
        "meiyun poon\n5 reviews\nRated 5.0 out of 5,\nVery good masseur (Huang lei). Very patient and good skills. The counter service is also very good and friendly.\n\n",
        "Stacey Ong\n10 reviews·10 photos\nRated 1.0 out of 5,\nNot sure why it was rated good. Deserted place. The person was using so much force on my foot on many occasions I felt he was going to twist my ankle or rip my toes off. It's not hitting the pressure points but pure strength. Look somewhere else\n\n",
        "viv loh\n2 reviews\nRated 5.0 out of 5,\nFriendly and warm reception by the staff. Professional skills by uncle Richard and sherry. Throughly enjoyed the session\n\n",
        "Desmond Sim\n13 reviews\nRated 5.0 out of 5,\nSo glad i found this place, the skill and strength of the masseur is sooooo good! Will definitely recommend and come back again\n\n",
        "Jo C\n2 reviews\nRated 5.0 out of 5,\nTried the body massage. Very good experienced masseur, great knowledge and skills. Place was nice and cozy. Appreciate the IPad with Netflix. Will definitely come back again!\n\n",
        "Jeslyn Lee\n2 reviews\nRated 1.0 out of 5,\nWorst female masseur ever! Being assigned to a massage therapist by the name of Hui Ling who has zero knowledge on foot massage and poor attitude. You will not benefit from her service. Just time wasted 👎\n\n",
        "Sam Tan\n2 reviews\nRated 5.0 out of 5,\nLynn was very awesome with her skills. Will highly recommend.\n\n",
        "Lory\nLocal Guide·111 reviews·435 photos\nRated 5.0 out of 5,\nMy go to place during migraine/shoulder pain attack, I always come out feeling better.\n\nProfessional and experienced massage therapist.\n\n",
        "Gavin Wong\n4 reviews\nRated 5.0 out of 5,\nVery good service and they are knowlegeable with what they do. Definitely a must try!\n\n",
        "Vicky\n3 reviews\nRated 4.0 out of 5,\nMy stiff neck feel much better after trying the neck and shoulder massage done by Mr. Ong (who is plump). Will do it again and opt for a 60 min package.\n\n",
        "Monica Lim\n3 reviews·2 photos\nRated 5.0 out of 5,\nRiani is really good! My neck and shoulders are relieved after just one session. His service convinced me to get a package here!!\n\n",
        "ong siew yian\n2 reviews·1 photo\nRated 5.0 out of 5,\nVery Good service, and comfort environment. Thanks manager SK Tan good recommendation, Stress release a lot. Have a Good sleep.\n\n",
        "ES LIM (Limes)\nLocal Guide·82 reviews·451 photos\nRated 5.0 out of 5,\nMassage was strong and powerful, felt great. Promotional package going on now is also very attractive. Not to mention Grabpay.\n\n",
        "Tan Elyn\n4 reviews\nRated 5.0 out of 5,\nThe foot massage service provided by Riani at Toa payoh was great !!! And the counter staff is friendly.i will go back to this place and consider take packages.\n\n",
        "Kat Koo\nLocal Guide·71 reviews·27 photos\nRated 4.0 out of 5,\nDid an hour massage. Thanks to Max for his expertise. My shoulders muscles are much 'loosen and relaxed'. Will visit again!\n\n",
        "Ong Siew Fen\n3 reviews\nRated 5.0 out of 5,\nMy always to go place for a really good massage experience from the team, manager Sk tan good service. ☺\n\n",
        "Alicia Tan Xin Ru\nLocal Guide·23 reviews·83 photos\nRated 5.0 out of 5,\nGreat leg massage. Release all my foot tension👍🏼👍🏼👍🏼\n\nGreat price for great service 👍🏼👍🏼👍🏼\n\n",
        "Ray Pang\n1 review\nRated 5.0 out of 5,\nHad Jackson, fantastic service, well controlled strength, and very experienced\n\n",
        "Karmen W\nLocal Guide·26 reviews·36 photos\nRated 5.0 out of 5,\nGreat therapists who actually know the points in the body and really know their stuff! Enjoyable :) second time here!\n\n",
        "Melvin Chang\n1 review\nRated 5.0 out of 5,\nAt Toa payoh branch, staffs are very polite, massage service is good, will come again next time! 👍👍👍\n\n",
        "Anil Menghani\n7 reviews\nRated 5.0 out of 5,\nGreat Experience and Riani was very good and ensured that body was bouncing back.\n\nGreat place recommended 👌\n\n",
        "kuganesh suppiah\n3 reviews\nRated 5.0 out of 5,\nPrompt reply from Staffs  S K Tan and good foot massage from Eileen....Will be back\n\n",
        "Brian Prabakar\n3 reviews\nRated 5.0 out of 5,\nVery very good service here at toa Payoh out let\nThe best ever. Will come again\nWill come back again\n\n",
        "jin xing lim\n5 reviews·1 photo\nRated 5.0 out of 5,\nMassage and service at the toa payoh branch is great!\n\n",
        "Mark\nLocal Guide·193 reviews·348 photos\nRated 5.0 out of 5,\n2nd visit here for Massage foot not bad....and body  Affordable price....if possible provide free wireless Internet..\n\n",
        "Jane Lee\n4 reviews\nRated 5.0 out of 5,\nThe foot reflexology and body massage are really good at this outlet! Always really happy with the service rendered!\n\n",
        "Bernie LAI\n1 review\nRated 5.0 out of 5,\nGreat service!! Feel relaxing after foot & body massage.\n\n",
        "GlennTan TC\n2 reviews\nRated 5.0 out of 5,\nServices here are very good. I strongly recommend this outlet in Toa Payoh.\n\n",
        "Quek Alice\n1 review\nRated 5.0 out of 5,\nI am very happy to be serviced by staff Jeffrey Tay for my hunchback issue. Within 10 sessions of treatment, my friends can see the improvement of my issue.\n\n",
        "Cheng Ling\n4 reviews\nRated 5.0 out of 5,\nGo for Raini if u want to unknot your aches. He has magic hands!\n\n",
        "Nurul Iman\n2 reviews\nRated 5.0 out of 5,\nRiani is great at foot reflex!\n\n",
        "Wak Jerr\n2 reviews\nRated 5.0 out of 5,\nmy always to go place for a really good massage experience from toa payoh(Mr jay) the team.\n\n",
        "Kochu Ma\n3 reviews\nRated 5.0 out of 5,\nFantastic service and great relief, would come back often\n\n",
        "Kevin\n3 reviews\nRated 5.0 out of 5,\nThe masseur did a great job , helping me relieving recurrent pain\n\n",
        "Evelyn Koh\nLocal Guide·19 reviews\nRated 3.0 out of 5,\nFoot reflex, maybe not. Their therapist is not trained for reflexology but I did get a good foot rub if that’s what it is.\n\n",
        "JL17 L\n6 reviews\nRated 5.0 out of 5,\nBeen to this site for years. Dedicated staff, professional. For people who likes strength, ask for their guy masseus!\n\n",
        "A Kw\n1 review\nRated 5.0 out of 5,\nGood massage by Rinai\n\n",
        "Tina Seah\n1 review\nRated 5.0 out of 5,\nThe massage is great and place is clean and comfortable!!! =)\n\n",
        "Joyoh Sharon\n1 review\nRated 5.0 out of 5,\nVery good and professional masseur. Nice and comfortable place. Definitely recommended!\n\n",
        "Shin Matsufuji\n12 reviews·5 photos\nRated 4.0 out of 5,\nGood, friendly, clean, reasonable price !\n\n",
        "Heah Kam Fong\n3 reviews\nRated 5.0 out of 5,\nGreat Experience with good hospitality. People are kind and treat well. Good service. Thank you Sktan.\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6354 1911\">6354 1911</span>",
    "Website": "http://www.preciousfoot.com.sg/"
}