{
    "Name": "Pure Foot Relaxology Pte Ltd",
    "Products": null,
    "Address": "207 Lavender St., Singapore 338765",
    "Opening Hours": "Saturday 10:30am–10:30pm\nSunday 10:30am–10:30pm\nMonday 10:30am–10:30pm\nTuesday 10:30am–10:30pm\nWednesday 10:30am–10:30pm\nThursday 10:30am–10:30pm\nFriday 10:30am–10:30pm\nSuggest new hours",
    "Rating": "4.8\n22 reviews",
    "Reviews": [
        "Wilfred Lim\n7 reviews\nRated 5.0 out of 5,\nFollowed the boss even before he open this shop. Great man with good service. Massage was good and relaxing till you can easily doze off. Bring couple of friend and all doze off at least once.\n\n",
        "Mandy Mandy\n1 review\nRated 5.0 out of 5,\nPerfect place to get some stress off your shoulders.Good price point,clean & authentic , value for money. Thank you and definitely i will come here to massage again.\n\n",
        "K A\n5 reviews\nRated 2.0 out of 5,\nWent there for foot reflexology+ back massage upon seeing the good reviews 2 weeks ago. So tot lets give it a shot. Service crew were very friendly and professional. However, the big toe on my right foot has been numb since my visit. Now im comtemplating should I go to the doctor or go back to have them checked what went wrong. My foot has been feeling weird since and I never had such sensation before ever. And Im beginning to feel worried if the nerve is damaged at that area.. Sigh..\n\n",
        "Wilfred Lim\n7 reviews\nRated 5.0 out of 5,\nFollowed the boss even before he open this shop. Great man with good service. Massage was good and relaxing till you can easily doze off. Bring couple of friend and all doze off at least once.\n\n",
        "Mandy Mandy\n1 review\nRated 5.0 out of 5,\nPerfect place to get some stress off your shoulders.Good price point,clean & authentic , value for money. Thank you and definitely i will come here to massage again.\n\n",
        "K A\n5 reviews\nRated 2.0 out of 5,\nWent there for foot reflexology+ back massage upon seeing the good reviews 2 weeks ago. So tot lets give it a shot. Service crew were very friendly and professional. However, the big toe on my right foot has been numb since my visit. Now im comtemplating should I go to the doctor or go back to have them checked what went wrong. My foot has been feeling weird since and I never had such sensation before ever. And Im beginning to feel worried if the nerve is damaged at that area.. Sigh..\n\n",
        "Christina Ang\n1 review\nRated 5.0 out of 5,\nlove the body massages here!\nhave always been having back issues from sitting too long and have been going for body massages for years.\nthis is by far the best body massage that i have had!  good strength control, precise in getting the right points and best of all, i walk out really refreshed and raring to go!\nthis will definitely be my go to place from now on!   and oh, the place is very clean and quiet too.....\n\n",
        "Arr Ann\n3 reviews\nRated 5.0 out of 5,\nGreat packages. Nice massage that makes me nearly fall asleep. Easy to book an appt too\n\n",
        "Colin Bemai Longman\n1 review\nRated 5.0 out of 5,\nWhat an amazing gem of a place! Was in the area passing by but had stopped to have a look inside as the place just screamed comfort! Massive comfy seats with a big LED TV screen whilst having a foot massage?! Had a try out of interest and boy was it a good idea. I highly recommend the deep tissue massage and the foot massage thereafter.\n\nI have been to many places like these before but the level of expertise and service from each member of staff was exceptionally good.\n\nI cannot stress how highly I would recommend to anyone to try and I assure you would be feeling as amazing as I did when I left.\n\n",
        "Gabriel Low\n7 reviews\nRated 5.0 out of 5,\nAmazing experience! I've been to many massage parlours but this has to be the best I've been to in Singapore so far. My masseur was really skilled (told me he's been doing it for more than 10 years in Singapore). Pretty new setup as they just opened at the start of 2020. If you choose a foot massage, you'll get plush comfy chairs with individual screen and wireless headset to watch movies. My friend who did it with me thoroughly enjoyed his experience too. Plus it's affordable and customer service is top-notch too. Cannot recommend this place enough!\n\n",
        "Christina Ang\n1 review·2 photos\nRated 5.0 out of 5,\nhad a tense week and needed a massage desperately. found this unassuming looking shop and popped in. totally glad that i did it as my masseur was very professional and thorough, eliminating all my knots and fatigue. i started with 1 hour, but increased another 30 mins halfway through my massage.   i felt like a brand new person when i stepped out!  and oh, the place was very clean and the massage chair was so so comfy!\n\n",
        "Ben Josh\n14 reviews·1 photo\nRated 5.0 out of 5,\nSuch an amazing place to get a foot massage.. Surprisingly affordable and highly skilled masseuses.  And you watch movies on the touchscreen panel in front you while you get massaged.\n\n",
        "chunging207 ling\n1 review·1 photo\nRated 5.0 out of 5,\nPURE FOOT's massage is like going to an aquarium, it feels very relaxing👍\n\n",
        "Rama Rama\n2 reviews\nRated 5.0 out of 5,\nReally awesome the service and also the staff are truly professional\n\n",
        "yew chai lai\n1 review·1 photo\nRated 5.0 out of 5,\nI just happened to be around the area and decided to check them out, i shd say what a great experience, everything about this place is perfect, service, unit layout, theme, ambience, comfy sofas, etc.will recommend to my friends and relatives. Thumbs Up👍👍👍\n\n",
        "Lyi Wong\n13 reviews·1 photo\nRated 5.0 out of 5,\nThe masseur is very good and professional, will come back again.\n\n",
        "朱思颖\n1 review\nRated 5.0 out of 5,\nThe staff in the store has a very good service attitude, kind and polite, the store environment is very good, there are free drinks and food, the overall feeling is not bad, next time I will go back with my friends.\n\n",
        "Catherine Chien\n17 reviews·1 photo\nRated 5.0 out of 5,\nGreat massage parlour; super clean and reasonable price.\n\n",
        "Jinghui Loh\nLocal Guide·30 reviews\nRated 5.0 out of 5,\nClean and hygiene place\n\n",
        "Gloria Wong\n1 review\nRated 5.0 out of 5,\nreally nice\n\n",
        "yang Lisa\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The foot massage is very professional and will come next time.\n\n(Original)\n足部按摩很专业，下次还会来。\n\n",
        "jobin\nLocal Guide·2 reviews·230 photos\nRated 5.0 out of 5,\n\n\n",
        "Kahironbe Mirah-Mohideen\n1 review\nRated 5.0 out of 5,\n\n\n",
        "xiaojun\nLocal Guide·19 reviews·21 photos\nRated 5.0 out of 5,\n\n\n",
        "Kevin Ng\nLocal Guide·6,689 photos\nRated 3.0 out of 5,\n\n\n"
    ],
    "Phone": "6298 2930",
    "Website": "http://www.purerelaxology.com/"
}