{
    "Name": "Sabaai Sabaai Traditional Thai Massage",
    "Products": {
        "Thai Tradition": "$55.00 – $135.00",
        "Thai Signature": "$85.00 – $145.00",
        "Thai Herb": "$95.00 – $145.00",
        "Head Neck Shoulder Massage": "$58.00 – $68.00",
        "Foot Massage": "$40.00 – $90.00",
        "Thai Traditional Massage": "$55.00 – $135.00",
        "Signature Thai Massage (90Mins)": "$115.00",
        "Signature Thai Massage (60Mins)": "$85.00"
    },
    "Address": "49A Boat Quay, Singapore 049838",
    "Opening Hours": "Saturday 11am–10pm\nSunday 11am–10pm\nMonday 11am–10pm\nTuesday 11am–10pm\nWednesday 11am–10pm\nThursday 11am–10pm\nFriday 11am–10pm\nSuggest new hours",
    "Rating": "4.7\n279 reviews",
    "Reviews": [
        "Melissa Eisner\nLocal Guide·873 reviews·1,296 photos\nRated 5.0 out of 5,\nAwesome place for a massage. I loved the ambiance and the staff was wonderful. Smelled lovely, great lighting and music to completely relax you. Had the foot, neck and shoulder massage and it did not disappoint. Can’t wait to go back!\n\n",
        "Lilian Tan\n7 reviews\nRated 5.0 out of 5,\nChanced upon this place while looking for massages nearby and picked it solely based on the high Google review ratings. Best decision made! Tried the Thai Aroma massage which has four scents to choose from, and the masseuse really worked hard on those knots in my back 😆 my whole body felt so relieved after 90 min! The staff were really friendly and the place was well decorated. Price is a bit higher than some other common massage parlours I think (?) but totally worth it. Already planning the next trip, and thinking of getting a package 🤭 looking forward to going back there soon!\n\n",
        "SL\n4 reviews·13 photos\nRated 5.0 out of 5,\nWas trawling through reddit for some good places to get a massage and chanced upon this gem. It was defs worth the price and the good reviews! Went for the Thai Signature with my partner and we both loved it. He commented that he would 100% recommend it and he found the massage comprehensive with excellent back manipulation 😍 Just as other commenters remarked, our masseuses managed to hit the right spots with just the right amount of pressure.\n\nMy masseuse (Sophia) was really strong and responsive to my verbal/non-verbal cues. We will definitely be back for more!\n\n",
        "Melissa Eisner\nLocal Guide·873 reviews·1,296 photos\nRated 5.0 out of 5,\nAwesome place for a massage. I loved the ambiance and the staff was wonderful. Smelled lovely, great lighting and music to completely relax you. Had the foot, neck and shoulder massage and it did not disappoint. Can’t wait to go back!\n\n",
        "Lilian Tan\n7 reviews\nRated 5.0 out of 5,\nChanced upon this place while looking for massages nearby and picked it solely based on the high Google review ratings. Best decision made! Tried the Thai Aroma massage which has four scents to choose from, and the masseuse really worked hard on those knots in my back 😆 my whole body felt so relieved after 90 min! The staff were really friendly and the place was well decorated. Price is a bit higher than some other common massage parlours I think (?) but totally worth it. Already planning the next trip, and thinking of getting a package 🤭 looking forward to going back there soon!\n\n",
        "SL\n4 reviews·13 photos\nRated 5.0 out of 5,\nWas trawling through reddit for some good places to get a massage and chanced upon this gem. It was defs worth the price and the good reviews! Went for the Thai Signature with my partner and we both loved it. He commented that he would 100% recommend it and he found the massage comprehensive with excellent back manipulation 😍 Just as other commenters remarked, our masseuses managed to hit the right spots with just the right amount of pressure.\n\nMy masseuse (Sophia) was really strong and responsive to my verbal/non-verbal cues. We will definitely be back for more!\n\n",
        "Chia Joel\nLocal Guide·282 reviews·4,421 photos\nRated 5.0 out of 5,\nOne of the best thai massage places you can find here in singapore.\n\nSuper clean place - nice robes for you to change into, toilet though a bit small was clean - had kirei kirei!\n\nThough prices are a little premium as compared to overseas or in JB. You really get a quality full body thai traditional Thai massage that will leave you wanting more.\n\nThey have a chop system as well as you can collect and get discounts if you are a loyal returning customer...\n\nDefinitely book a slot and try it for yourself!\n\n75 for an hour of Thai traditional massage!\n\nOnly bummer is that somehow their payment system doesn't accept contactless paywave options and you have to bring your physical credit card if you'll like to use your credit card to pay!\n\n",
        "Aer V\n4 reviews\nRated 5.0 out of 5,\nHighly recommended. The masseuse I had, Li Ping, was very skillful. She was very attentive and was able to find the accurate spots I was having problems with. I had 1hr Traditional Thai + 2hrs Aroma massage. Was a great combo to get rid of all body aches and stiffness. Will definitely return again.\n\n",
        "Weihoe Ow\nLocal Guide·18 reviews·36 photos\nRated 5.0 out of 5,\nFirst time doing Full body Thai massage, and Sabaai Sabaai Traditional Thai Massage provided an excellent experience.\n\nThe place is easy to miss, and you have to lookout for the sign. Overall a good experience!\n\n",
        "Jennifer MacGregor\nLocal Guide·20 reviews·233 photos\nRated 5.0 out of 5,\nSuch great expertise at a great price and a great location. Always friendly and helpful, there are two hour traditional Thai massage is the absolute best for a full body release and loosening.\n\n",
        "Richard Fahy\n60 reviews\nRated 5.0 out of 5,\nTried this place for first time today as my usual place was fully booked. Awesome thai massage, aches and pains gone. Highly recommended\n\n",
        "Kin Jun Lee (Iunius)\nLocal Guide·34 reviews·6 photos\nRated 5.0 out of 5,\nVery good massage service. Place is extremely clean. Nice music and relaxing atmosphere. Price is on higher range but definitely value for money! Highly recommended\n\n",
        "Ahmad Soltani\nLocal Guide·161 reviews·1,238 photos\nRated 5.0 out of 5,\nThe best traditional Thai massage place I've ever been to. Had a long term pain in neck.. gone! The masseuse know what they are doing and are absolutely professional. Every single time I come out of there thinking when is the next time I'll get to go. Highly recommend!\n\n",
        "Dalis Chan\n23 reviews·25 photos\nRated 5.0 out of 5,\nExtremely clean place. Pleasant smelling. Quite environment for body massage. Had the Thai Aroma massage.\n\n",
        "L S\n2 reviews\nRated 5.0 out of 5,\nClean & Professional.\nMy partner and I went for 90mins traditional thai massage and overall was great. Shout out to Cha Ling and she is very professional. Definitely comeback!\n\n",
        "Aviroop Sircar\nLocal Guide·22 reviews·216 photos\nRated 5.0 out of 5,\nAmazing experience. Feel relieved of all the back and neck issues. I would like to visit again and would recommend others looking for an amazing and relaxing massage ☺️\n\n",
        "Lawrence Tan\nLocal Guide·448 reviews·1,319 photos\nRated 5.0 out of 5,\nMe and my wife truly enjoyed our 90 mins massage it was money well spent! Will return!\n\n",
        "Asha Mahesha\n6 reviews\nRated 5.0 out of 5,\nGreat massage, strong and really stretched + cracked well. Masseuse did a great job with the gradual slow pressure that felt very relaxing.\n\n",
        "ChinRui Chew\n12 reviews·14 photos\nRated 5.0 out of 5,\nDid a 1 hour Traditional Thai Massage. A little bit on the expensive side but the service was excellent and the staff was very friendly.\n\n",
        "Kai Ling Koh\nLocal Guide·90 reviews·69 photos\nRated 4.0 out of 5,\nGotten the traditional thai massage. 45mins for $65. Not the cheapest in the area. Service was excellent. Massage is not too bad. Would come back if in the area\n\n",
        "CHAE U RI LEE\n2 reviews·2 photos\nRated 1.0 out of 5,\nI took “30 minutes/ foot massage. “\n\nI'd like to make a reservation at 8 pm. But at 7:13 pm the massage club called me and said “8 pm is full booking, so I have to come by 7:30 pm.”\n\nI called on time without being late. I visited at the time they wanted, hoping for better service. (If they had at least the average massage level, I wouldn't have written this review.)\n\nAt The first time it wasn't bad. (Greeting service, beverage service etc..)\nDesk staff were friendly and beverage service was good. And the tea was also good.\n—\n< Foot Massage started. >\n\n* massage\nThe first pressure to me for left foot massage was weak and insincere.\nI majored in art, knows a little bit of anatomy. Also Massage experience is a lot as well.\n\nUnfortunately, the pressure is too weak to a viable level for baby. (This is not a massage, just touching.)\n\nBut I did not say any compliments at first.\n\nBecause I thought there will be the therapist’s intention or purpose of the first time introduction stage and still believe.....\n\n15 minutes left. To be honest, At that time feel bad. (There’s no therapist’s intention or purpose. She just... It became apparent that the time was being spent by forcefully.)\n\nBut the therapist condition is good or thought there may be many other reasons.. So I told her\nsoftly, just “press more than the left foot.”\n\nThe right foot was better than the left touch level. I'm not satisfied with my right side, but I'm just touching my left foot.\n\nI thought I waste of money and time.\n\nNo difference whatsoever after the massage are tired of the foot and calf.\n\n< 5 minutes left. >\n\nI saw a new guest wash her by other therapist.\n\nSo I ask the my therapist.\n\n“Why I never wash my feet like her?”\nThen my therapist replied.\n“Because I am taking a half-hour massage. And\nthis massage is not included the washing feet service. So I took just wash your feet as a wet towel.\nIf you want to wash your feet service,\nYou have to pay an additional $ 10. Would you take a feet washing service?\n\nThe massage was only five minutes remaining in. (Also, If the foot service is not to be included in a 30-minute period, the massage club or therapist should have made the announcement beforehand.)\n\nWast time and money...\n\nIf I was satisfied with today, I would visit again tomorrow with my friend, but I never will. Never go.\n\n",
        "Aye Chan\n4 reviews·1 photo\nRated 5.0 out of 5,\nI had a THAI SIGNATURE massage and its very nice. Highly recommend! Staffs are very professional and the place is very pleasant and clean. Will Definitely go there again.\n\n",
        "WenD Tan\nLocal Guide·460 reviews·1,233 photos\nRated 5.0 out of 5,\nUpdate on 6/3/18 : price has increased to $80 for Thai massage. Didn’t inquire about massage. Still  reasonable pricing. Previous review: $68 for 60mins. Jasmine: recommend for females (medium strength) Great masseur, know what she's doing. Went for traditional Thai massage (no oil) and she helped relieved many knots which I didn't even know I had! Bought a package for $620 (10 times) 👍🏻\n\n",
        "Constance Yeo\n3 reviews·1 photo\nRated 5.0 out of 5,\nGreat place for Traditional Thai Massage. Went on a Sunday evening. Very serene and comfortable. My masseuse was Zhang Qin. I walked in with back aches and walked out with none. They are good at identifying the pressure points to release the pains.\n\n",
        "SP Gan\nLocal Guide·83 reviews·168 photos\nRated 4.0 out of 5,\nWent to try Thai Signature with my hubby.\n\nIt costs us SGD 85 for a 60- minute massage and I think it’s money well spent - worth every cent of it.\n\nI bought this for my hubby’s birthday and I am so glad that he likes the experience there.\n\nThe masseurs ( I didn’t have a chance to ask for their names ) are not Thais but their skills are quite good!\n\nThis is what my hubby said , “ the place looks small but the service is commendable, and the masseur has much better skills than other established spa in Singapore that we went to pamper ourselves in the past.\n\nWe are definitely considering coming back :)\n\n",
        "Padmashree R\nLocal Guide·57 reviews·168 photos\nRated 4.0 out of 5,\nThe therapist did an amazing job ! The pressure was perfect. Very clean and the aroma inside the room was perfect to fall asleep.  I would recommend a 2hours body massage with aroma oil for a relaxed Friday night.\n\n",
        "Stephanie Lim\n13 reviews·2 photos\nRated 5.0 out of 5,\nHad one of the most relaxing oil massage here at Sabaai Sabaai. I felt truly relaxed.\n\n",
        "Rom25Jan\n5 reviews\nRated 5.0 out of 5,\nAmazing experience at Sabaai Sabaai. First time here and I will definitely come back. Therapist Sophia provided a great Thai Aroma massage. Very relaxing. Highly recommended place at the heart of the city!\n\n",
        "Timothy Wong\n18 reviews·10 photos\nRated 5.0 out of 5,\nCame here on 2 separate occasions to try out both Thai Traditional and Thai Signature. Thai Traditional was quite the typical Thai massage but I personally prefer the Thai Signature because you'll be stretched in parts of your body that you didn't know could be stretched. It really helps to ease the tension and relieves the pressure. Came out feeling so much better. I didn't get the name of the masseur, and although she wasn't Thai, her massage was on point. Pressure was just perfect - Not too soft and not too painful. Prices are on the higher end but still affordable. I think 60-90 minutes is fine but 120 minutes would be too long.\n\n",
        "Selene\nLocal Guide·23 reviews·5 photos\nRated 5.0 out of 5,\nWent in for 2 times. The first one was Traditional massage and second for Aroma. The massage is good, but the lobby area is quite small. So it does affect the whole experience. A tiny cup of drink before and after was provided, which I do appreciate, but it does feel like a miniature version of the ritual.\n\n",
        "S Lee\nLocal Guide·90 reviews·1 photo\nRated 5.0 out of 5,\nReally enjoyed my Thai massage here as a gift from a friend. The service was good, space was clean, and masseurs were skilled. Nice to get something other than Javanese or Swedish massage!\n\n",
        "Sam Travel from SG\nLocal Guide·105 reviews·903 photos\nRated 5.0 out of 5,\nI give this place a 5 stars not because of the deco. The deco i grade them 3 stars but it is clean.\n\n5 stars for the massage, old traditional Thai method sequences massage which not many Thai massagers in today’s Thai massage place you can find in Singapore.\n\nHumble and thoughtful service people.\n\nNice ambiance music playing in the background.\n\n",
        "劉GS\nLocal Guide·81 reviews·39 photos\nRated 4.0 out of 5,\nVery good.\n\nAlthough, having been to authentic massage places in the rest of Southeast Asia, I wouldn't say this is the best experience I've ever had. 4 out of 5 stars is a fair rating in my opinion.\n\nFor the casual inexperienced customer, definitely do try out this place.\n\nFor the experienced customer, expect to be satisfied but not wowed or amazed or blown away.\n\nPrices are pretty standard, given the location. (Cheaper in Malls definitely.)\n\nDo try to call in advance to check if they have a slot, rather than turning up and just trying your luck -- especially if you're going in a group (more than one person).\n\n",
        "Dennis N\nLocal Guide·342 reviews·821 photos\nRated 5.0 out of 5,\nOne of the best Thai massage experience! My lady & I went for both the traditional and Signature 60mins and we both loved it. Warm, professional and hella relaxing.Definitely will be back!\n\n",
        "Imelda\n5 reviews\nRated 5.0 out of 5,\nWent for just 1 hour but it was thorough, detailed and on point. The masseuse put in alot of effort to make it worthwhile for the entire session and focused on areas that were stiff. Definitely recommended for people who like Thai style massage!\n\n",
        "Chia Chee Yang\nLocal Guide·11 reviews·616 photos\nRated 5.0 out of 5,\nSkillful masseurs 😊 strongly recommended for Thai Signature massage…!!!\n\n",
        "Fernando Er\n9 reviews\nRated 5.0 out of 5,\nI didn’t have the best experience in June 2018, but\n\n1) in receiving sincere responses from the proprietress about my then-experience (representative of the brand’s customer service: even after 2 years, the Thai receptionist still extends warm attention at entry and exit; though I see so much less of her now),\n\n2) the absence of the problem that had once been a big source of my then-discontent (as of late, I haven’t experienced any issue with extreme temperatures from the central air-conditioning), and\n\n3) in having since encountered a most competent, durable therapist who has always been diligent and consistent (from the 4 times I had the good fortune of scheduling her to my sessions) in expertly applying her massage techniques compatible with my bodily dispositions, I figured it’s high time to join the 5-star band wagon and revise my original, less than stellar review; it’s only\nright.\n\nA very good place for bone cracking and muscle relaxing relief; as always, the head/face massage still remains the cherry on top of the proverbial cake, but, now, with a trustworthy therapist to lend her hands, each individual aspect of the massage has since been elevated into a distinct, praiseworthy experience that accrues into a satisfying whole.\n\nI am not sure if the complimentary salt foot scrub is still limited only to bookings (i.e., not available to walk-ins); so best call and check. But it seems that the offers of the welcome lime-blue pea flower drink and exit ginger tea are still valid customary practices.\n\n",
        "YiYin Wang\n3 reviews\nRated 5.0 out of 5,\nThe most  therapeutic massage from my personal experience, thanks to masseuse Yan-Yan.\n\nI had a 90 mins aroma oil massage during the promotion period, and was very impressed by the whole journey of it.\n\nFrom the very first second I could tell Yan-Yan knows how to control the pressure, connecting points to points smoothly, I found it tremendously important when a massage is well choreographed, almost in sync with my breath, it wasn't only spot on, precise, it feels effortlessly perfect.\n\nThe only thing is that the lobby seems quite small, and possibly due to the busy appointments, I can feel staffs rushing in and out a bit, however the ambience is ok.\n\nAs for the massage space, it is charming and cozy, maybe authentic thai style? Despite can hear voices from customer next to you, I feel the sheet on the floor relaxing enough.\n\nThank you so much Sabaai Sabaai and Yan-Yan, it was a wonderful afternoon besides the quay. See you soon.\n\n",
        "Martin Santoso\nLocal Guide·225 reviews·445 photos\nRated 5.0 out of 5,\nAwesome massage place. Tried their non oil massage for 1 hour and was super relaxed after the treatment. The place is also super clean, and courteous staff. You'd be served welcome drink which is refreshing as well. The masseuse is also considerate and will ask the you the strength of the massage from to time. Felt asleep for some time, without realizing one hour went by. Will try their 1.5 hour next time. Recommended! Reservation is needed because is popular place.\n\n",
        "Shar C\nLocal Guide·593 reviews·505 photos\nRated 5.0 out of 5,\nFantastic Thai massage, will return!\n\n",
        "Amirah Rahmat\n7 reviews\nRated 5.0 out of 5,\nThai traditional ($75-60mins) vs Thai Signature ($85-60mins)\nI tried both massages to check out what makes a signature different from a traditional one. To me, the traditional one is normal/standard as you get which is great, but, holy cow the signature one is just out of this world. My body gets the best crack I've ever had in any massage place. Kudos to the thai masseuse who massaged me so well! I requested for medium-high level of massage.\n\n",
        "shrey arora\nLocal Guide·19 reviews·4 photos\nRated 4.0 out of 5,\nI went to sabaai sabaai multiple times in boat quay and had Thai oil massage for one hour and one hour 30 minutes.\nBefore massage they ask if you have pain in specific area so that they can spend more time on that specific area.\nI can say that it’s better to have one hour 30 minutes where you can have full massage of whole body including head.\nHere you will not find bed or dedicated room as they have mattress on the floor and covered with curtains.\n\n",
        "Cherin C\nLocal Guide·20 reviews·82 photos\nRated 5.0 out of 5,\nFound this place by chance through google map as it was nearby to where we are settling for a dinner. Booking of an appointment with them was a breeze through email, reply came promptly and communication was clear throughout, we booked 90mins for their thai aromatherapy 😊\n\nWe arrive early for our appointment, receptionist politely informed us to return when nearing our appointment time as there were safe distancing measures in place and there is not much space to accommodate too many people.\n\nWhen we return, we were directed to their sofa to fill up their health declaration form through our phone, took a quick 5mins to do so. Then they washed our feet and we waited for our turn to enter the room.\n\nThey do not have a couple room, the room is an open concept with curtains as a divider between each person like how they do so in Thailand.\n\nThe curtain was thick, lights were dimmed, there was a loose dress to change into, I have no idea how to tie it and the therapist helped me with it 🤣\n\nMassage was awesome 👏, I felt instantly relaxed that I almost went into deep sleep! Pricing is alittle high ($115 nett) but it was very worth it. I felt recharged and feel lighter after the massage, definitely a place that I would return 👍👍\n\nI love how skilful the therapist was, strength was good, relieved my tension on my shoulder and back, aroma oil used was nice smelling too 😌\n\nThe only down side is the sound of foot steps, I was situated near the entrance door, thus everyone who enter/leave I can hear them 🚶‍♀️🚶‍♀️, a little distracting but the massage always pull me back to relax 😆\n\n",
        "Max Collins\n235 reviews·1 photo\nRated 5.0 out of 5,\nReal Wat Po massage in Singapore. 1 hour is not enough.\n\n",
        "Mei Yan Foo\n9 reviews·13 photos\nRated 2.0 out of 5,\nWent for 60min foot neck shoulder massage.\nClean and friendly staff but poor, halfhearted massage. Not worth the time and money.\n\n",
        "Lynne\nLocal Guide·103 reviews·100 photos\nRated 5.0 out of 5,\nProfessional and well trained masseuse! Never needed a massage so badly and I am so glad I went for it. Didn't expect to see so many Singaporean names on the registration list as the massage prices are steep as compared to nearby SEA countries. I'd say it's worth it!\n\n",
        "Linan C\nLocal Guide·64 reviews·77 photos\nRated 2.0 out of 5,\nNot sure if it’s the particular masseuse, but the massage was mediocre at best. She pressed hard but not on the right spots so it just felt awkward and painful instead of relieving. Also felt like she did not have enough strength to pull me or lift me in assisted stretches. Paying $75 and picking a place with such great reviews, I had higher expectations before the massage, but it turns out to be much worse than a Thai massage you can get at a street corner in Bangkok.\n\n",
        "Sarah S.\n3 reviews·3 photos\nRated 5.0 out of 5,\nBeen coming here monthly for a few years and never fail to feel satisfied with each session! Therapists are dedicated and front staff are always polite (Sirina is an absolute treasure, I enjoy our small chats). My go-to massage spot in town. Expand to the first level please 😛 Keep up the good work!\n\n",
        "Stephanie Wong\nLocal Guide·391 reviews·1,298 photos\nRated 5.0 out of 5,\nOne of the best traditional Thai massage in Singapore. The therapists are skilled and use good pressure to relieve any muscle tension or knots.\n\n",
        "ELNIE S. MASHARI\nLocal Guide·31 reviews·65 photos\nRated 5.0 out of 5,\nEfficient. Clean. Friendly.  I was 30mins early of my appointment but the staff just swept off my feet and began my treat. Felt comfortable in the space and message given by Chan Ling was on-point! Thank you again for the experience and definitely gonna be a regular 💕\n\n",
        "K Obusan\nLocal Guide·38 reviews·18 photos\nRated 5.0 out of 5,\nAmazing, I felt reborn after a 90-min traditional Thai body massage. Never going for a massage in those chain massage places after discovering this gem.\n\n",
        "Lisa Ti\nLocal Guide·89 reviews·282 photos\nRated 5.0 out of 5,\nBEST THAI MASSAGE IN SINGAPORE! Absolutely love Sabaai Sabaai, I've been a regular customer for over a year now. Their massage is good and consistent, the rooms are clean and the staff are professional and friendly.\n\n",
        "Lisa jacob\n4 reviews\nRated 5.0 out of 5,\nHighly recommended. Clean and organised. Especially during this difficult time. Professional attention from booking system to arrival and service. Worth the travel from the east. Don't hv to worry about being disappointed nor need to travel to Thailand\n\n",
        "Vijay Jacob\nLocal Guide·87 reviews\nRated 5.0 out of 5,\nGreat place for Thai massage, of which I'm a big fan.  Clean place with professional staff. The masseuses know what they are doing and you definitely feel a lot better after you've gone through a session.\n\n",
        "marco koh\n16 reviews\nRated 4.0 out of 5,\nBeen here few time ,like the place so much . Very authentic Thai massage , masseurs here are experienced , skill levels is great . The environment and service are excellent , comfortable and relaxing .\n\n",
        "Mckenzie Dree\nLocal Guide·18 reviews·5 photos\nRated 5.0 out of 5,\nExcellent massage! This is definitely my favourite go to massage place, they are usually busy advisable to book in advance. Beautiful interior and place is always very clean. Love the foot scrub before the session starts. Never disappoint!\n\n",
        "Kristen Haddon\nLocal Guide·7 reviews·23 photos\nRated 5.0 out of 5,\nExceptionally clean and professional massage center. I highly recommend the foot massage and thai aroma massage. A foot wash/scrub and cool tea is a welcome treat upon arrival. After your service a hot ginger tea. A reservation is highly recommended as they are popular. I will definitely visit again next time in Sing!\n\n",
        "Santanu Bhattacharya\n11 reviews\nRated 5.0 out of 5,\nWe took the traditional Thai massage and everything was perfect from start to finish. Most important was the skill level of the masseuses which was excellent. The place was neat and tidy and well located. Much recommended\n\n",
        "Sean Gill\n2 reviews\nRated 5.0 out of 5,\nFirst time for Thai Massage and loved it.  Very different from Swedish or Deep Tissue massage that I'm used to.  This was almost like a guided stretching that is done to you.  It was great, we made reservations to go back before the end of our trip.\n\n",
        "Nisha Neurgaonkar\n1 review\nRated 5.0 out of 5,\nI decided to go for a traditional Thai massage at Sabaai Sabaai only because a very close friend of mine was visiting from India and she insisted that we should go. At first, I was reluctant because I didn't want to be covered in oil and then spend time in the shower getting that off me when I could rather spend that time doing something else. But I was completely wrong about that! This massage does not involve any oil. We were given a lose top and pyjamas to wear and led to relax in these cozy little tent like structures instead of a typical massage room. Not only was this massage extraordinarily good but it made me feel like I was floating in the air by the end of it. It felt like someone was doing yoga for me with my body, making me feel relaxed at the same time. The masseuse was very professional and paid special attention to the pain points, maintaining the pressure as per my instructions. The best part for me was right at the end when she had me in the bench pose fully supporting me from behind and applying pressure at the perfect places of my neck, back and shoulders, which entirely de-stressed my spinal cord. I would highly recommend Sabaai Sabaai to everyone. A truly soothing and blissful experience and appropriately priced too.\n\n",
        "Peter Peh\nLocal Guide·18 reviews\nRated 2.0 out of 5,\nWent for the 90mins Thai traditional massage. Normal standard, satisfaction is below the ones u have in Thailand or even JB.\n\n",
        "Sasha Bao\nLocal Guide·35 reviews·62 photos\nRated 5.0 out of 5,\nAlways a great experience here for the 1h Thai massage. In case you didn't know, Thai massages are done on a flat bed on the ground, and involves thumb and palm pressure, stretching and even body weight pressure. Although not the best for relieving knots, the acupressure and stretching style is very very relaxing and rejuvenating. Sgd 68 for 1h full body massage.\n\n",
        "Jimilee McCleskey\n2 reviews\nRated 5.0 out of 5,\nLoved the chair massage so much that I decided to give the Thai massage a try 2 days later! Friendly staff, clean, and she hit all the right spots. Plan on going back a 3rd time before I return to the US.\n\n",
        "Peace &Love\n1 review\nRated 2.0 out of 5,\nThe “Owner” Left a standard reply however,  did not give his/her proper name just a random email.   We don’t have time to advise you on how to run a proper facility and give value for the outrageous prices that are charged for such poor service.\n\nWe are still trying to figure out how this place has recieved such high reviews. - my partner and I recently visited for head , neck and shoulder massage.   The website says free foot scrub however it’s 10 more.   We were taken to an area where the AC was blasting on one side and warmer on another side we opted for the warmer part as we both had stiff necks from the AC at the hotel.  We still needed to request blankets as our feet were still exposed to the freezing cold blast of the AC.  not comfortable at all.\n\nThe massage area was a floor and thin mat ,for a head neck and shoulder appointment it felt odd right away however , we both figured they must have a special technicique  they didn’t, the  masseuse was completely out of tune to my needs and did her own thing.  She was rubbing the same spot on my head over and over for 10 min. I had to ask her several times to rub elsewhere however i don’t think she spoke English.  she left my head both numb and irreatated   I can honestly say I’ve had better massages on a Bangkok street corner for 10 bucks.  We left there 140 poorer and in worst shape than we arrived.  I would not recommend this place.\n\n",
        "Xinjia Li\n8 reviews\nRated 2.0 out of 5,\nMy 4th time at Sabaai Sabaai. Quality of massage is still good but the customer service from the staff at the front desk seem to have dipped. We called to book a 60min Thai massage for 2 and when we almost reached, someone called to say that there was only one bed hence only one person can do the full body massage and suggested the other to do a foot, neck and shoulder massage instead. Whilst this is not ideal (we really wanted a full body massage) , we accepted as we were almost at the destination. I decided to my husband go with the full massage instead. As I have plenty of neck and shoulder aches I asked if I could have more focus on these areas like 30 mins out of the 60mins massage if possible. But I was told quite unkindly by Sirina Nang at the reception that this is not possible, their time for the neck and shoulder portion is fixed at 15 mins and they can't do anymore than that. This is rather bewildering as most massage place could allow you to focus on certain areas. Again I asked OK how about 20mins surely 5 mins more would not make a difference. Sirina was like no, not possible. Literally “Not Possible”. I offered to pay a little more thinking that maybe it's the money then she said you can pay for 30 min shoulder massage for $48 and then 30 min foot massage for $50 if you want that. This comes up to $98 and the full body massage which I originally wanted and didn't get due to their mistake was only $75. I felt penalised for their mistake and to top it off Sirina was very unfriendly throughout. At this point I got rather upset and told her she had a poor attitude and I really don't see how that request of mine to allocate 5 mins more of the massage to the neck and shoulder was “not possible”.Then I added that I am ready to send feedback on this. Suddenly she changed track and was like 20mins is fine. Now it's suddenly possible. I feel indignant that they did not care about a simple customer request unless the customer was ready to escalate it.\n\nAgain to be fair, the massage was good but I gave a overall low score because it was a very unpleasant experience with Sirina. The most important thing of any spa is to leave feeling relaxed and I did not have that.\n\nPlease look into your front desk staff, dont let them be a disservice to your therapist.\n\n",
        "Claudio S.\nLocal Guide·45 reviews·116 photos\nRated 5.0 out of 5,\nVery skilled therapists, professional, cleniness is exemplary and they are super friendly. They also speak fluent English so it's easy to communicate your painpoints.\n\n",
        "XIAO HUANG\nLocal Guide·51 reviews·41 photos\nRated 5.0 out of 5,\nNice environment clean with calm scent and music. Pressure is just reasonable. Much relaxed after trying Thai Signature\n\n",
        "Ris Thevan\n2 reviews\nRated 5.0 out of 5,\nAmazing amazing service and massage. So professional and I relaxed the minute the massage started. It usually takes awhile for me to relax when a massage starts but this was sooo good. The massesues here know what they are doing. For once I'm getting my muscles worked on and not my bones. I came out feeling so calm and serene. Best place in SG!\n\n",
        "Shiya Zhang\nLocal Guide·62 reviews·66 photos\nRated 5.0 out of 5,\nThe best massage I’ve ever ever had!!! Thanks for fitting me in for my last-minute drop-by. The 30 mins Aroma massage was Zuper!!! Lavender oil help soothe your body & heart :))) Staffs are so warm, friendly and professional. People on the registration forms are from all over the world - we are all one :) The place locates on a very lively street. While waiting, there are so many things can do, 10 mins close by there is the movie lawn, and there’s all kinds of restaurants, cafes along the waterrr. #goodtodoforsolitudenight\n\n",
        "Jayaletchumi Anbalagan\n2 reviews\nRated 2.0 out of 5,\nDid 90mins of Traditional Thai massage, Head massage was done with my hair clip on. Thought it would be beyond my expectation or at least could have met cause of the reviews i read here before heading to this place. But it was a total disappointment for me as came from far.\n\n",
        "Stephen Hincks\n2 reviews\nRated 5.0 out of 5,\nDefinitely one of the top massage spots in Singapore.  The venue is clean and well presented, staff are great and the massage by Chris was second to none.  Have been a few times and no doubt a few more\n\n",
        "E Ngo\nLocal Guide·74 reviews·65 photos\nRated 5.0 out of 5,\nGreat massage with traditional Thai stretches. Massage was in a clean and well decorated environment. At one point, there was a misunderstanding on my credit card charge and I found the team to be cooperative and quick to resolve my concerns (the issue appeared to be to do with my bank rather than sabaai sabaai). I found the manager was responsive and respectful at all times.  Although I was already out of the country when this happened, the issue was addressed with top priority. Sabaai Sabaai is a massage place I can trust. Will definitely come back.\n\n",
        "Dominik\nLocal Guide·132 reviews·5 photos\nRated 5.0 out of 5,\nVery professional, I felt great after the massage. Second best in Singapore.\n\n",
        "Albert Mets\n53 reviews·6 photos\nRated 2.0 out of 5,\nI went there based on good reviews. When I did a walk-in visit, I was told I had to go to their 'other' branch. I askd the reception if it was the same outlet. She said it was, and I was accompanied to this next place. This turned out to be a very noisy massage place, I booked an hour but the chap was finished after 50 minutes, and disappeared as soon as he was done. The experience was not nice.\n\n",
        "Peerampa Janjumratsang\nLocal Guide·11 reviews·16 photos\nRated 5.0 out of 5,\nPretty amazing masseuse. My shoulder pain improved significantly from her help today! Thank you! My new go to massage place.\n\n",
        "Thye Boon Bok\nLocal Guide·22 reviews·2 photos\nRated 5.0 out of 5,\nGood. Professional massage service.\n\n",
        "lyzda Suzliman\n3 reviews\nRated 5.0 out of 5,\nCame for a massage after a year from my last visit and still by far the most recommended massage place to go to!\n\nMe and my Husband decided to go for a massage and I quickly call Sabai Sabai for a reservation at 9:30pm. As yesterday was raining heavily, we were late for our appt but Sabai Sabai staff was so accommodating that they push out appt to 10:30pm. We got caught up in the rain and as soon as we reached Sabai Sabai, a Malay staff ask me if I need a towel to warm myself up! How nice it was to be welcome like that. The massage was no doubt a good one. Definitely coming back again!\n\n",
        "james mitchell\n1 review\nRated 5.0 out of 5,\nGreat traditional Thai massage. Sweet pain, but the end result is I feel great.. really recommend\nYou leave feeling happy but no happy ending offer thank goodness..\n\n",
        "Desmond Foo (Aliva)\nLocal Guide·80 reviews·208 photos\nRated 5.0 out of 5,\nVery good massage place.\n\n",
        "Ildefonso Herraez\n14 reviews\nRated 5.0 out of 5,\nI am late as I was in Singapore some days ago. But I wanted to leave a positive note. I am no Thai massage expert. but it did work for me. meticulous protocol, good stretching positions. felt much better after\n\n",
        "Gaetan Maraite\n2 reviews\nRated 5.0 out of 5,\nClean , Excellent service , and amazing massage . Could be compared with a 5* spa . My wife and I had a 90 minutes traditional Thai massage and we will come back for sure .\n\n",
        "Osiimi\nLocal Guide·25 reviews·31 photos\nRated 5.0 out of 5,\nVery nice and comfy place, right by the bay. Everyone here are very cute.\n\n",
        "Marianne Khor\nLocal Guide·14 reviews·114 photos\nRated 5.0 out of 5,\nThe place is quiet and clean, and the staff is friendly. My masseuse is very skilled, and most tension in my body was gone after the massage.\n\n",
        "Renee Kida\nLocal Guide·110 reviews·245 photos\nRated 4.0 out of 5,\nReally great massage.  Only downside is they rush you a bit.  They could smooth out their service manners a bit more.  People are there to relax.\n\n",
        "Shang Gao\n11 reviews·1 photo\nRated 5.0 out of 5,\nVery good thai massage. All of their therapists are great. Make an appointment first. I had brought friends over and we all loved it.\n\n",
        "Mackenzie C\nLocal Guide·85 reviews·90 photos\nRated 4.0 out of 5,\nReally nice little massage place. Great location and super helpful staff. Massage was good the only thing that’s keeping from a 5th star is that it’s a little pricey for Singapore.\n\n",
        "Benjamin Gan\nLocal Guide·76 reviews·176 photos\nRated 5.0 out of 5,\nThe only massage place in SG that never fails. Standards of the masseuses are consistently high; always feeling invigorated and flexible again after a session.\n\n",
        "Chris Crowley\nLocal Guide·618 reviews·7,283 photos\nRated 5.0 out of 5,\nExcellent massage. Only complaint is the massage spaces aren't private, and there's noise bleed through so it is less relaxing than a private room.\n\n",
        "G Man\n13 reviews\nRated 5.0 out of 5,\nGreat massage, most authentic Thai style in Singapore. Clean and fresh set up, friendly and caring staff. I'll be back!\n\n",
        "Manali Debroy\n5 reviews\nRated 5.0 out of 5,\nAwesome experience. Would definitely come back.\n\n",
        "Geri Yan\nLocal Guide·136 reviews·167 photos\nRated 5.0 out of 5,\nBeen here twice and both experiences were great. The therapists are professional and very detailed. I especially like how clean the facility had been kept!!\n\n",
        "Riz Perreras\n10 reviews\nRated 5.0 out of 5,\nRelaxing. I feel so much better, definetely going back for more\n\n",
        "Linye Chen\nLocal Guide·23 reviews·3 photos\nRated 5.0 out of 5,\nMy Boyfriend and I both love it. Feel whole body lighter after stretching. reminds me of the neighbourhood massage I had back in Bangkok.\n\n",
        "anouk van den eijnde\nLocal Guide·210 reviews·174 photos\nRated 5.0 out of 5,\nEscape the crowds and head upstairs at this lovely massage spot. I had the foot, neck and shoulder in the main space and absolutely loved it, perfect after getting off a long flight.\n\n",
        "Ivy Lu\n2 reviews\nRated 5.0 out of 5,\nThis is definitely my to-go place for some self care - skillful therapists and super clean/relaxing environment!\n\n",
        "Jay Kovak\nLocal Guide·50 reviews\nRated 5.0 out of 5,\nThai massage, when is competently applied, it is one of the best therapeutic massage techniques in the world. Here it is competently applied. I love coming here.\n\n",
        "naveen mathew\nLocal Guide·18 reviews·28 photos\nRated 5.0 out of 5,\nMust try all sort of massages.very good customer service and professional masseurs.\n\n",
        "Luci Le\n3 reviews·2 photos\nRated 5.0 out of 5,\nGreat service. The 15mins was better than my 60 min at seasons. Although seasons are sweethearts too. This place is now my go to massage! Amazing!!!!!\n\n",
        "Ronard Wang\n11 reviews·1 photo\nRated 4.0 out of 5,\nAuthentic massage no hanky panky stuff. The staffs are friendly and nice, ambience is good. Just pure massage.\n\n",
        "Issy Ritz\n5 reviews\nRated 5.0 out of 5,\nAwesome couples massage by Liping and Mei Hui! Thanks.\n\n",
        "Xiaozhou YANG\nLocal Guide·130 reviews·494 photos\nRated 5.0 out of 5,\nHad a professional and effective Thai massage here. Love the interior design and service.\n\n",
        "Rina Chua\n2 reviews\nRated 5.0 out of 5,\nI wanted to give positive feedback to your Team.Customer service and massues always provide me with the best services and massage treatments it really helps out on my stiffness body. Cheers 👍🏻\n\n",
        "Sophie Lion\nLocal Guide·40 reviews\nRated 5.0 out of 5,\nVery good massage. Warm welcome. Very clean and safe. Loved it! People are really lovely.\n\n",
        "Rachel L\nLocal Guide·807 reviews·442 photos\nRated 5.0 out of 5,\nClean, polite, relaxing. I told the therapist my leg had some pains and she focused more on that area.\n\n",
        "Itzel Mora\n1 review\nRated 5.0 out of 5,\nIf you like massages, this place is a must go in Singapore! I will visit Singapore next week, and I am totally stopping by!\n\n",
        "Nowhere Man\nLocal Guide·45 reviews·52 photos\nRated 5.0 out of 5,\nProfessional and welcoming. This place is quite busy so make sure to do reservation in advance.\n\n",
        "Lily T\nLocal Guide·241 reviews·1,874 photos\nRated 5.0 out of 5,\nExcellent Thai masseurs in Singapore. Clean and professional. Good location at Boat Quay. Worth another visit.\n\n",
        "Mike Huynh\nLocal Guide·13 reviews·14 photos\nRated 5.0 out of 5,\nI have had Thai massage at lots of place geographically, and I have to say the best one I have ever had, even compared to 5-Star hotel Thai massages.\n\n",
        "Cristopher Landrito\n12 reviews·10 photos\nRated 5.0 out of 5,\nGood, reasonably priced (by SG standards) Thai massage in SG. Proper Thai massage beds. Friendly staff.\n\n",
        "Raymond Lam\nLocal Guide·37 reviews·621 photos\nRated 5.0 out of 5,\nGood ambience. Soothing music. Reasonable price. Centralized location. Most important excellent massage!\n\n",
        "Naveen Sk\n8 reviews\nRated 5.0 out of 5,\nGreat place with nice classy touches\n\n",
        "Boon Hian Tan\nLocal Guide·321 reviews·266 photos\nRated 5.0 out of 5,\nFound my replacement therapist after previous one went bk to Thailand due to cb period. Tks for fixing my bk tonite\n\n",
        "Grace L\nLocal Guide·90 reviews·70 photos\nRated 5.0 out of 5,\nSuper clean and cute spot on the Riverwalk to get a massage. Just what I needed after a long day walking around.\n\n",
        "Xiao Dong\n3 reviews\nRated 4.0 out of 5,\nReally good and authentic massage. Will come again. Thank you. Also convenient location\n\n",
        "Roger Magne\nLocal Guide·26 reviews·3 photos\nRated 5.0 out of 5,\nVery professional and pleasant staff operating in an agreeable environment. The relaxation begins the moment you step in and the prices are reasonable\n\n",
        "Mandar Dadegaonkar\nLocal Guide·60 reviews·362 photos\nRated 5.0 out of 5,\nExcellent massage. Massuese was very thorough and provided easy relief from pain\n\n",
        "Gp Tan\nLocal Guide·157 reviews·605 photos\nRated 5.0 out of 5,\nLove the massage there.  Authentic Thai massage at a great price\n\n",
        "Kim, Sun Kyeong\n1 review\nRated 5.0 out of 5,\nArai was super good\n\n",
        "Irene Ng\nLocal Guide·26 reviews·42 photos\nRated 5.0 out of 5,\nLove their newly renovated place it's clean and the massage was good too.\n\n",
        "Ann F\n19 reviews·1 photo\nRated 5.0 out of 5,\nMy go to place for the best thai massage ever since I came to Singapore.\n\n",
        "Needra Wick\n4 reviews\nRated 5.0 out of 5,\nExceptional massage by very kind and talented masseuse. Highly recommended\n\n",
        "Bhaagyalicious\nLocal Guide·19 reviews·12 photos\nRated 5.0 out of 5,\nawesome and authentic thai massage, but it is expensive\n\n",
        "Krista Campbell\nLocal Guide·7 reviews·3 photos\nRated 5.0 out of 5,\nOne of two favorite Thai massage places in Singapore (the other is the Yunomori japanese onsen)\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 9337 3715\">9337 3715</span>",
    "Website": "http://www.sabaaisabaai.com/"
}