{
    "Name": "Sante Wellness Pte Ltd",
    "Products": null,
    "Address": "Hougang Avenue 1 #01-1452, Block 124, 530124",
    "Opening Hours": "Saturday 10am–11pm\nSunday 10am–11pm\nMonday 10am–11pm\nTuesday 10am–11pm\nWednesday 10am–11pm\nThursday 10am–11pm\nFriday 10am–11pm\nSuggest new hours",
    "Rating": "4.9\n73 reviews",
    "Reviews": [
        "Sanjay\n6 reviews\nRated 5.0 out of 5,\nWent for my first full body massage here, for my hip pain. The masseuse was super professional, and focused on my hip tgt with the rest of my body. I have decided to frequent this wonderful place every 3 months from now. Thank you!\n\n",
        "Esther Clare Koh\n2 reviews·2 photos\nRated 5.0 out of 5,\nMe and my husband were served by Hua Ge and Andy. Service was superb and massage was excellent. 👍🏻👍🏻👍🏻👍🏻👍🏻\n\nHusband had 90 Minutes Foot Massage by Hua Ge and he loved every minute of it. Helped him to relax.\n\nI had 60 Minutes Foot Massage and 30 Minutes Back Massage from Andy. Really awesome and he helped me to release the tension I had on my back (which has been really bad for a week now).\n\nBoth Hua Ge and Andy are gems and definitely recommended   👍🏻👍🏻\n\nDo give Sante Wellness a try if you are in the area! 🤩\n\n",
        "Calvin Goh\n39 reviews\nRated 1.0 out of 5,\nBeen a long time patron of this outlet but today was totally disappointed with the service staff i believe her name is yuki. Sent a what app msg as per usual practice to book a session but was queried on detail duration of the massage of which i had provided as per usual standard booking request. Very annoyed thereafter no reply for more than a hour n when i again asked she said done?? i ask her why she did not reply n confirm she just said not her but her colleague?? i told her this is not the service std as in the past whether the therapist we ask for is or not available we always get a quick reply as we can then plan or reschedule our time. She just said thank u for yr feedback n conversation with her abruptly ended by her!!! i am amazed by her action!!!\n\n",
        "Sanjay\n6 reviews\nRated 5.0 out of 5,\nWent for my first full body massage here, for my hip pain. The masseuse was super professional, and focused on my hip tgt with the rest of my body. I have decided to frequent this wonderful place every 3 months from now. Thank you!\n\n",
        "Esther Clare Koh\n2 reviews·2 photos\nRated 5.0 out of 5,\nMe and my husband were served by Hua Ge and Andy. Service was superb and massage was excellent. 👍🏻👍🏻👍🏻👍🏻👍🏻\n\nHusband had 90 Minutes Foot Massage by Hua Ge and he loved every minute of it. Helped him to relax.\n\nI had 60 Minutes Foot Massage and 30 Minutes Back Massage from Andy. Really awesome and he helped me to release the tension I had on my back (which has been really bad for a week now).\n\nBoth Hua Ge and Andy are gems and definitely recommended   👍🏻👍🏻\n\nDo give Sante Wellness a try if you are in the area! 🤩\n\n",
        "Calvin Goh\n39 reviews\nRated 1.0 out of 5,\nBeen a long time patron of this outlet but today was totally disappointed with the service staff i believe her name is yuki. Sent a what app msg as per usual practice to book a session but was queried on detail duration of the massage of which i had provided as per usual standard booking request. Very annoyed thereafter no reply for more than a hour n when i again asked she said done?? i ask her why she did not reply n confirm she just said not her but her colleague?? i told her this is not the service std as in the past whether the therapist we ask for is or not available we always get a quick reply as we can then plan or reschedule our time. She just said thank u for yr feedback n conversation with her abruptly ended by her!!! i am amazed by her action!!!\n\n",
        "Christine Chandra\n1 review\nRated 5.0 out of 5,\nLove love love this massage place! Been a loyal customer and back almost every month..\nSpecial thank you to Alice, my favourite therapist!\n\n",
        "Jing Jing\n3 reviews\nRated 5.0 out of 5,\nEva therapist and Yuki are very nice and professional. Eva is very kind and professional for her massage skills. She is also very friendly and knowledgeable. Yuki is also very kind and knowledgeable. She gave a lot of advice and attend to the need of customer! Recommend Eva a lot!\n\n",
        "Jagjeet Singh Jr\n6 reviews\nRated 5.0 out of 5,\nTherapist Shan Shan was very good and helped me with the pain I was experiencing. Front desk Yuki also helped to explain what kind of massages I needed to ensure I get better. 10/10 would recommend to anyone! 👍🏼\n\n",
        "Jeremy Tan\nLocal Guide·20 reviews·34 photos\nRated 5.0 out of 5,\nHad a really good massage today done by 华-ge! He was very detail-oriented when it comes to the massage and shared with me on the different points that he was massaging and how each of them mattered.\n\nDefinitely would visit again and am already looking forward to my next visit.\n\n",
        "Martin Lin\n1 review\nRated 5.0 out of 5,\nHighly recommend to go for their massage.\nStaff Ting ting was very professional and using her strength to massage my aching back. Overall experience was great! Keep up the standard Sante wellness. 👍👍\n\n",
        "Aileen Tan\n2 reviews\nRated 5.0 out of 5,\nOur favourite massage place to revisit. Alice, Andy and Wah were highly skilled in their profession, with many years of experience. They are able to pinpoint our problem areas and provided practical advice. Very cosy and comfortable ambience as well.\n\n",
        "Ashley\n3 reviews·1 photo\nRated 5.0 out of 5,\nExcellent service! After experiencing injury on my lower back, Andy helped fix me up with acupuncture followed by sports massage which made me feel better! Excellent service by ting, recommended for the ladies\n\n",
        "Alfie Tjen\n15 reviews\nRated 5.0 out of 5,\nWent there a few times whenever I'm in the area. Really liked the ambience and service quality. Pricing is competitive and the massage is not too bad as well. Would really recommend.\n\n",
        "Vivien Yee\n3 reviews·11 photos\nRated 5.0 out of 5,\n1st time try for 90min lymphatic detoxification. !\nExcellent massage ! Done by Ting Ting 👍🏻👍🏻👍🏻\nHigh recommended !\n\n",
        "Siew wa Cham\n1 review·2 photos\nRated 5.0 out of 5,\nI've been going to Sante Wellness TCM Clinic for the past 3months to receive various TCM service like Tuina,Moxibustion, Acupuncture, Cupping,and Scrapping. Each service and therapy was done with care to focus on improving my healthy as I struggle with some issue of my lower back.I can't say enough good things about the trained therapist and Physicians.\nI especially want to mention Dr Ng for Acupuncture, Therapist Andy,Ting,Shan and Eva for very strong Tuina(Massage).and Wah and Alice for targeted Tuina to address body/muscle imbalance s.\nTo round it all out the management/reception team(Manager Yuki, Cecelia)is kind, passionate,and proactive.\nNot to mention fun and appropriately silly.\nIf you're looking for total care....look no further.\nGet an appointment.\nHighly recommended Sante Wellness TCM,🤗\n\n",
        "Carmen Lim\n6 reviews·1 photo\nRated 5.0 out of 5,\nWas recommended by my friend. Professional service. Was having a tensed shoulder due to bad seating posture due to work from home. Came for ginger massage and detox treatment. Feel totally relaxed after just an hour of massage.\n\n",
        "Linda Lim\n1 review\nRated 5.0 out of 5,\nAnna is very professional and her skills is great…  precise acupressure to the point .. felt relax after the session!\n\n",
        "sherlyn ng\nLocal Guide·18 reviews·5 photos\nRated 5.0 out of 5,\nat the starting is very pain but after that 30 minit,i slowly feel that my shoulder is slowly comfortable.she will ask you soft or hard during massage period,she also will chat with you and share about other customer experience how they feel and all.during this period,everyone stay at home siting down in-front computer,time to go there for relaxing!!!when you go over there can ask TING or Andy help you massage!!!!\n\n",
        "Jervis Ching\n6 reviews\nRated 3.0 out of 5,\nI asked them whether they are TCM registered so that I can claim the charges and they have confirmed twice that they are. But eventually they are not Singapore TCM registered and I whatsapp them with the screenshot and they never responded to me. Despite their poor knowledge and understanding of their business nature, the masseur is skillful though.\nWon't recommend if you need to claim the charges from insurance.\n\n",
        "Kenny Zhang\nLocal Guide·70 reviews·37 photos\nRated 5.0 out of 5,\nEffective massage to resolve aches and fatigue, reasonable price, good location with ample parking. Clean and tidy place is a bonus.\n\n",
        "Desmond Goh\n1 review\nRated 5.0 out of 5,\nHonest and Friendly staffs. Therapists are also proficient and competent in their skill sets. Definitely coming back again.\n\n",
        "Aaron Yeo\n1 review\nRated 5.0 out of 5,\nThe Therapist Hua, Andy the skills and knowledge very good 😊.\nHigh recommend\n\n",
        "cheng mui noy\n1 review\nRated 5.0 out of 5,\nTherapist Andy the skills and knowledge very professional.\nCounter service very friendly.\nHigh recommend\n\n",
        "pui hoon loh\n4 reviews·1 photo\nRated 5.0 out of 5,\nThe Thai massage by Eva was great. Comfortable yet effective massage.\n\n",
        "Linda Lee\n2 reviews\nRated 5.0 out of 5,\nI love the massage over there. Helped me solved the shoulder pain as well as my back injury.\n\n",
        "D H\nLocal Guide·59 reviews·238 photos\nRated 5.0 out of 5,\nFirst time here... Good experience and ah hua took great care of my back and neck. Will return!\n\n",
        "Jino Kuriakose\n3 reviews·3 photos\nRated 5.0 out of 5,\nI often do foot reflexology. Very good and professional service. Reasonable price as well.\n\n",
        "Faz\n4 reviews\nRated 5.0 out of 5,\nAwesome Massage. 1st class. By Anna and Ting Ting. Quality and Marvellous. Thanks 😊\n\n",
        "winny ho\n3 reviews\nRated 5.0 out of 5,\nI was attended by Shan Shan and this was my second experience here. One of the best masseur that I have seen in Singapore.   She has a strong knowledge in TCM and understand where is my issue and  incorporate other treatment with massage. Will definitely come back again.\n\n",
        "Elsa Chen\n1 review\nRated 5.0 out of 5,\nShan Shan and ting ting were very professional during the treatment. Able to give good advice.\n\n",
        "Denise Lee\n6 reviews·6 photos\nRated 5.0 out of 5,\nHighly recommended and best massage in the area! They are clean, honest and very reasonably priced. Masseurs are well-trained and are ever so attentive to your needs (you can tell them where to focus on, eg tired necks). I usually try to politely reject signing up for a package but I had to proactively enquire for a package after my first treatment. You get $50 extra credits when you buy $500 (essentially 10% off each session).\n\n",
        "Janelle Yap\n1 review\nRated 5.0 out of 5,\nI get to know this wellness center from my SIL. I have Shan Shan as my masseur today and the experience is excellent although it is super pain for me because I have very lethargic body that has not been massaged/cupping for very long and Shan Shan provided very good advice post masage/cupping. I am looking forward for next visit.\n\n",
        "Annie Lim\n5 reviews\nRated 5.0 out of 5,\nI went there for 30 mins foot and 30 mins body massage, it only cost me $45. Very affordable. And excellent service.\n\n",
        "Pollen Si Ni\n1 review\nRated 5.0 out of 5,\nHighly recommend. Their service are professional and advise what treatment is suitable for you👍👍👍\n\n",
        "Lee Thim Poh\n2 reviews\nRated 5.0 out of 5,\nCame here 2nd time for ginger massage.\nFelt very good and relex after the massage.\nStaffs are very friendly and massure is very professional and skillful\n\n",
        "Iris Chen\n1 review\nRated 5.0 out of 5,\nGood service and cozy environment,  Affordable Ovarian Care and body massage  Highly recommend!\n\n",
        "Jack Tan Kian Sian\n1 review\nRated 5.0 out of 5,\nMassage therapist was professional. Definitely worth to come back again.\n\n",
        "boomshakalakaboomshakalakaboomshakalaka\n1 review\nRated 5.0 out of 5,\ni always came here to have a massage with my family\noverall it’s nice and the staff were awesome and it’s affordable :))\n\nso recommend this place 👌👌👌\n\n",
        "e Sylver\n4 reviews\nRated 5.0 out of 5,\nGreat service , reasonable price. Clean environment.\nMasseur was professional and friendly..\n\n",
        "Ong Ee Ling Eeling\n2 reviews\nRated 5.0 out of 5,\nAndy is patient and professional,  Yuki and Ceceila are very friendly and well coming\n\n",
        "lum wai cheong\n1 review\nRated 4.0 out of 5,\nTherapist Andy , very skillful,, Yuki  friendly , .\n\n",
        "Jessy tara\nLocal Guide·11 reviews·12 photos\nRated 5.0 out of 5,\nVery good service.Massage was excellent.\n\n",
        "giggler than\n1 review\nRated 5.0 out of 5,\nMassagers are very good! I regularly come here for a good and relaxing massage. Shen shen is one of my fave☺️☺️☺️☺️☺️\n\n",
        "Dan\nLocal Guide·211 reviews·571 photos\nRated 5.0 out of 5,\nCompetent masseuses with competitive prices, I actively asked for a package after my first massage. That’s how confident I was. Now this is my go to massage place!\n\n",
        "Nicholas Poh\n8 reviews\nRated 5.0 out of 5,\nvery good massage, unlike other seedy places. 👍👍👍\n\n",
        "Kalayarasi Sundram\n1 review\nRated 5.0 out of 5,\nFeel relieved after massage\nRelaxed and juvenated\nRestful and light.\nThank you\n\n",
        "Jiayang Jonathan Ji\n1 review\nRated 5.0 out of 5,\nGreat TCM Massage place at good price.\n\n",
        "Emil Chen Zerong\n2 reviews\nRated 5.0 out of 5,\nGreat experience. Superb service from Andy\n\n",
        "Asmah Hanim\n1 review\nRated 5.0 out of 5,\nGood massage and affordable prices\n\n",
        "LouPeng狮城鹏友说\n1 review\nRated 5.0 out of 5,\nkidney care. experience very good， not expensive and very professional！\n\n",
        "dolores miguel\n2 reviews\nRated 5.0 out of 5,\nGood service. Place is clean. Ambience very calmly. Staff San San is very nice. Highly recommended 👌\n\n",
        "XINYI LIU\n1 review\nRated 5.0 out of 5,\nExcellent service with patient staff. Value for money. Will visit again.\n\n",
        "Johnson Ong\n3 reviews·1 photo\nRated 5.0 out of 5,\nExcellent service. Thumbs up. Cheers!\n\n",
        "Low Wei Min\nLocal Guide·27 reviews·3 photos\nRated 5.0 out of 5,\nAmazing place for foot reflexology and body massage. Affordable prices too!\n\n",
        "Low Wei Min\n7 reviews·7 photos\nRated 5.0 out of 5,\nAffordable foot and body massage! Perfect place to unwind on a weekend.\n\n",
        "EE Sze Seong\n1 review\nRated 5.0 out of 5,\nAndy Massage is very good\n\n",
        "Lynn Lee\n1 review\nRated 5.0 out of 5,\nAlice massge is very good\n\n",
        "Gilbert Tiew\n2 reviews\nRated 5.0 out of 5,\nStrong guy by @andy.\n\n",
        "seonghai phang\n3 reviews\nRated 5.0 out of 5,\nEva is good in thai massage\n\n",
        "Grace Koh\n15 reviews·1 photo\nRated 5.0 out of 5,\ngood massage\n\n",
        "Veronica choi\n1 review\nRated 5.0 out of 5,\n(Translated by Google) I did a lymphatic dredging project at his house. The master's technique is very professional. The process of passing the meridians is particularly painful. It is said that the more different the meridians, the more painful it will be.\n\n(Original)\n在他家做了淋巴疏通项目，师傅手法很专业👍，通经络的过程特别特别痛，据说经络越是不同就越是会痛，但是做完之后神清气爽，全身都很放松～\n\n",
        "Janice Liew\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Master Hua, thank you so much\nBecause of your professional service, my foot discomfort has been cured\n\n(Original)\n华师傅，太谢谢你了\n因为你专业的服务  我脚的不适治疗好了\n\n",
        "Karweng Wong\n1 review\nRated 5.0 out of 5,\n(Translated by Google) The massage technique is great, the service attitude is good, recommend 👍🏼👍🏼👍🏼\n\n(Original)\n按摩手法很棒，服务态度良好，推荐👍🏼👍🏼👍🏼\n\n",
        "Ng Winnie\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Good service attitude, I like it🤩\n\n(Original)\n服务态度好，喜欢🤩\n\n",
        "Peh Teck boon\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Very good service\n\n(Original)\n服务非常好\n\n",
        "sharon chan\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "林逦鋌\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "ertin Yuniarti\n2 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Jessica Thong\n1 review·2 photos\nRated 5.0 out of 5,\n\n\n",
        "Kelly\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Kim Chye Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Lola Wong\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Rebecca Lim\n21 reviews·31 photos\nRated 5.0 out of 5,\n\n\n",
        "Ian Lim\n1 review·4 photos\nRated 5.0 out of 5,\n\n\n",
        "Aida Tantg\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 9798 6726\">9798 6726</span>",
    "Website": "https://www.santewellness.online/"
}