{
    "Name": "SUNSHINE BEAUTY SPA",
    "Products": null,
    "Address": "BLK208 #01-673, New Upper Changi Rd, 460208",
    "Opening Hours": "Saturday 9:30am–9:30pm\nSunday 9:30am–9:30pm\nMonday 9:30am–9:30pm\nTuesday 9:30am–9:30pm\nWednesday 9:30am–9:30pm\nThursday 9:30am–9:30pm\nFriday 9:30am–9:30pm\nSuggest new hours",
    "Rating": "1.5\n30 reviews",
    "Reviews": [
        "Sheena Liew\n2 reviews·1 photo\nRated 1.0 out of 5,\nIf I could give negative star I would. Bought from fave and called in for 4pm appointment. They confirmed the time and got my details. Went to the shop on the dot, was met by reception who cannot speak english. Then a lady approached saying facial cannot be done due to they are busy. I said how long should i wait, they said they are not sure coz busy. Told them  i had an appointment, they acknowledged that the reception overlooked and the customer wanted to add a treatment and that i had to \"maybe\" wait for 2 hours. But is not sure. The experience was so stressful. Pls stay away from this place.\n\n",
        "Merliza Lim\n3 reviews\nRated 1.0 out of 5,\nI booked multiple appointments with them and they kept changing the timing. The final straw was when they changed my appointment for tomorrow because they double booked. And when I said cannot, they changed their narrative and told me one of their colleagues have COVID!\n\n",
        "jingjing zheng\n1 review\nRated 1.0 out of 5,\nThe attitude of the receptionist is very bad. I don't understand why such a shop can survive. I changed my reservation several times, and finally cancelled it directly for me\n\n",
        "Sheena Liew\n2 reviews·1 photo\nRated 1.0 out of 5,\nIf I could give negative star I would. Bought from fave and called in for 4pm appointment. They confirmed the time and got my details. Went to the shop on the dot, was met by reception who cannot speak english. Then a lady approached saying facial cannot be done due to they are busy. I said how long should i wait, they said they are not sure coz busy. Told them  i had an appointment, they acknowledged that the reception overlooked and the customer wanted to add a treatment and that i had to \"maybe\" wait for 2 hours. But is not sure. The experience was so stressful. Pls stay away from this place.\n\n",
        "Merliza Lim\n3 reviews\nRated 1.0 out of 5,\nI booked multiple appointments with them and they kept changing the timing. The final straw was when they changed my appointment for tomorrow because they double booked. And when I said cannot, they changed their narrative and told me one of their colleagues have COVID!\n\n",
        "jingjing zheng\n1 review\nRated 1.0 out of 5,\nThe attitude of the receptionist is very bad. I don't understand why such a shop can survive. I changed my reservation several times, and finally cancelled it directly for me\n\n",
        "Edison Cheng\n1 review·1 photo\nRated 1.0 out of 5,\npoor services, just now contact them for booking services, got one lady (xiaoyu) pick up the call,\nthe way she reply the attitude and behaviour is poor and very rude. Not recommend to coming this place!\n\n",
        "Lynn Lim\n6 reviews\nRated 1.0 out of 5,\nThis is the worst store that should really close down. Wonders why can such store still exist in the market.\nBought a voucher from Fave, massage for 2, AFTER I called them to make a reservation. On the day of reservation, they called few hours before to cancel on my husband and I and just tell us to change the date.\nWe were fine with it and then changed till today. But guess what, today they send us a message in the afternoon saying they have to cancel once again to change to another day and expect us to be fine with it.\nWhat ridiculously bad service is this?\nRequested for a refund, so I don't know how good their masseure is but I don't even want to step into the store.\nGood luck treating a paying customer like this.\n\n",
        "keat lin catherine lai\n3 reviews\nRated 1.0 out of 5,\nIf you looking for a relaxing good facial place, pls do not come over here!!!! All the staff taking and chatting like at home! When I'm inside the treatment room, I still can hear they laugh very load, say what have to put pork or seaweed to boil it. Also the reception lady is very  no manners!! When I use my card payment, she was return back my card, only use her 1 hand return back to me and pass it to me on the table not even looking at me!!! This is very rude!!! Will not coming back again!!! Ridiculous!!!\n\n",
        "Q Lee\n1 review\nRated 1.0 out of 5,\nWow.it’s a horrible experience. 0 stars!!! the receptionist is very rude and arrogant. The receptionist called me in total 6 times to check my appointment time and date, I am wandering how come the lady is so forgetful.but never mind. Then after that she told me my appointment can’t start at 2:00,need to wait at least 3:30 when I reach there.my husband and I take cab to rush there for punctuality. then I ask her what’s the solution to solve the problem.the receptionist is going to very rude, shout at me and roll her eyes many times.her attitude is very rude and arrogant.She shouted at me like a mad lady. Her customer services is very bad. I will not patronize this shop again.\n\n",
        "S\n3 reviews·1 photo\nRated 1.0 out of 5,\nWould give 0 star if possible. Called over 10 times and no one picked up my phone. When they finally called back, the lady over the phone asked if I was an “online” customer after asking if there was a slot for a massage session tonight. She said no and afterwards, she asked if I could share my AGE with her. What has that got to do my massage request?! What on earth is with the weird questions???\n\n",
        "Ana Katrina Aparicio\nLocal Guide·58 reviews·42 photos\nRated 3.0 out of 5,\nMassage skill of staff are good but if you're don't know how to speak Mandarin, better not go here because none of them speaks English. They rely on Google translate. Therefore, it results to misunderstanding.\n\n",
        "Wendeline Chong\n8 reviews·1 photo\nRated 1.0 out of 5,\nIt was a horrible experience. I came for a massage without an appointment and the lady said that there is a slot. Upon showing my card, she realised that i was an existing customer and guess what the smile was not there n she scrutinised my admission record as if im a criminal! Tsk ! My intention was to go for a simple relaxing massage n I got some PRC policing my record , my handwriting n my spelling! . Stop patronising them, these girls are there to earn the commission from first time walk in customers, they are not serious in serving existing customers at all. Totally absurb n a what I call a ‘hei’ shop !\n\n",
        "Indu Dand\n2 reviews\nRated 3.0 out of 5,\nThey don’t pick calls for appt booking, but as we purchased the deal in fave went to the spa center and directly got the massage done. Staff was good and service was also good, not pushy for packages. Offered us a couple room which was great.\n\n",
        "Yibin Teo\n25 reviews·3 photos\nRated 5.0 out of 5,\nSaw this place through Fave and decided to try the lymphatic massage at this place.\nFirst impression wasnt good. Upon reaching the place, the manager/receptionist was on the phone throughout. Someone only attended to me after 10mins.\n\nHowever!! The masseuse, Xin Xin, changed my impression. Her skill was impressive. She constantly checked if the pressure was ok for me. She let me try Gua sha, cupping and hot stone treatment even though Fave stated that only 1 treatment was inclusive.\n\nNot much hardselling. Which i was thankful. I still decided to sign a package with them since the deal was good.\n\nDont expect a 5 star spa hospitality and room when you are obviously paying lesser. This place is definately worth a try.\n\n",
        "Rachel Lee\n1 review\nRated 1.0 out of 5,\nBooked an appt with them on a saturday, at 4pm. When we were on our way to the place, the lady called and told us they had to change our appt to the following week and the reason being, “we have a regular customer who wants to extend his timing so we have to prioritise him first.” Seriously? Is that how you treat your customers? First time and also my last time engaging them. Thankfully we got vouchers from fave and was able to refund before the expiry date. Such customer service..I dont even know why it is good when they cant even handle basic customer service..\n\n",
        "CHIA SINSEAN\n5 reviews\nRated 1.0 out of 5,\nHorrible experience!! It doesn't deserve to have stars!! When did Singapore's service industry level and attitude become so bad. The receptionist was very rude, no manners and did not welcome me!! What kind of the service!? I think she can be so arrogant and arrogant if she is the lady boss or manager. This is the worst place I have ever been!!!!\n\n",
        "Derron W\n2 reviews\nRated 1.0 out of 5,\nDon't be tempted by their Fave deal. Terrible service, freaking hard sell.\n\n",
        "happy life\n2 reviews·1 photo\nRated 1.0 out of 5,\nVery bad service. Never ever try or buy any vouchers for their service.\n\n",
        "Anzuera Khatun\n1 review\nRated 1.0 out of 5,\nThis is the worse place I have ever been.The receptionist is very rude,careless and refused to redeem a fave voucher. Her name is Xue XIao Yu ,does not know how to speak in english. She is arrogant, I had worst experience in Singapore and this kind of shop should be shut down as it does not conform with Singapore standard.\n\n",
        "Cheryl K\n5 reviews\nRated 4.0 out of 5,\nAsk for Xinxin! Very friendly Chinese-speaking masseuse in a budget location. Great at massage and particularly good at explaining how to soothe aches in certain parts of your body. Will definitely come again.\n\n",
        "yachun hisiao\n7 reviews·2 photos\nRated 4.0 out of 5,\nThe service is good, massuse are friendly, and offer many type of Chinese therapy  massagew in a session. Value for money.\nThe down side is their English is not so good.\n\n",
        "Suzy Park\n3 reviews\nRated 1.0 out of 5,\nWARNING! DONT EVER PATRONISE THIS STORE. THEY CAN LAST MINUTE TELL YOU THEY DONT HAVE SLOT EVEN THOUGH YOU CONFIRMED WITH THEM A LOT OF TIMES TO BOOK FOR APPT. HOPE THEY CLOSE DOWN SRSLY.\n\n",
        "Chrystal Yeo\n1 review\nRated 1.0 out of 5,\nBad attitude and very rude when answering the phone.\n\n",
        "Baby Shark\n1 review\nRated 1.0 out of 5,\nBad attitude after sign package.\n\n",
        "Shariq Ahmed\nLocal Guide·15 reviews·6 photos\nRated 1.0 out of 5,\nNobody is answering the call. Not sure about their services.\n\n",
        "ALLEN KAN\n1 review\nRated 1.0 out of 5,\nBad service.\n\n",
        "YC Lee\nLocal Guide·23 reviews\nRated 1.0 out of 5,\nHorrible pick up lobby\nSo cramp\n\n",
        "Jessica Tee\n3 reviews\nRated 1.0 out of 5,\n(Translated by Google) Very bad attitude~especially the counter manager (Xiaoyu)\nWhen I went there for the first time~\nI just called~ I was not answering my question at all~\nThe tone of the answer is too bad~\nMainly come here to decompress~ On the contrary, come here to get angry\nIf you want a decompression massage~ this place is not recommended\n\n(Original)\n态度极差~特别是柜台经理 (小宇)\n第一次去的时候~就一直看戏敷衍\n刚刚打电话去~根本就没在回答我的问题~\n回答的语气态度太差了~\n主要是来这里解压~ 反倒是来这里受气\n如果想要解压按摩的人~不建议来此地方\n\n",
        "Joycelyn Ho\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "Isabelle Phou\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "nianchu lin\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "Kuby Chew\n1 review\nRated 1.0 out of 5,\n\n\n"
    ],
    "Phone": "6245 6396",
    "Website": "http://sunshinebeautyspa.com.sg/"
}