{
    "Name": "TD Spa ~ Traditional Thai Massage",
    "Products": null,
    "Address": "122 Bedok North Street 2, #01-132, Singapore 460122",
    "Opening Hours": "Saturday 10am–1:30am\nSunday 10am–1am\nMonday Closed\nTuesday 10am–12am\nWednesday 10am–12am\nThursday 10am–1am\nFriday 10am–1:30am\nUpdated by business 1 week ago\nSuggest new hours",
    "Rating": "4.4\n134 reviews",
    "Reviews": [
        "Felicia Prasetya\nLocal Guide·16 reviews·3 photos\nRated 5.0 out of 5,\nManaged to book a last min slot at this place. Good quality and authentic Thai massage. Similar to what you will get if you are in Thailand. Price is also reasonable. I was a bit worried at first since this is my first time trying but I really liked the massage.\n\nUncle at counter was also polite to clients.\n\n",
        "Mal C\nLocal Guide·37 reviews·29 photos\nRated 1.0 out of 5,\nThis is not authentic Thai massage. The women aren't trained. I asked for extra hard thai massage and was terribly let down. I wanted to walk out after 5 mins into the massage but was told that another massuse who could massage hard and well would be available in about 30mins. I waited as I had already prepaid. It was the most hyped up massage that left me disappointed and totally unrelieved. I felt more stiff after than I did walking in there. I asked for more pressure but received less pressure. I also asked for shoulders and traps but got my arms massaged instead. I asked for glutes and hamstrings but got my calves massaged instead. I then got told I should stretch everyday and that I worked on a keyboard that's why I have tight traps. Both comments were not relevant as I do stretch everyday and I dont use a keyboard ever. Its like the massuse was making it up as she went along. She was saying how she has massaged for over 20years but she was atrociously inaccurate in her diagnosis and inaccurate with her massage. Both massuses were terrible. I wasted $55 and 90mins of my life there.\nIn conclusion, this place is good for people who don't know what thai massage is and who want untrained women hitting your spine with their elbow and not knowing anything about the human body. How this place has over a 4 star rating is beyond me.\n\n",
        "Chong Shiun Hoong\nLocal Guide·102 reviews·2,550 photos\nRated 4.0 out of 5,\nOnline booking and confirmation immediately. Went over today,was massage by Kim. Even she is small size but she have a good strength and will concentrate on your request of where should get more attention. Overall very good session will visit again.\n\n",
        "Felicia Prasetya\nLocal Guide·16 reviews·3 photos\nRated 5.0 out of 5,\nManaged to book a last min slot at this place. Good quality and authentic Thai massage. Similar to what you will get if you are in Thailand. Price is also reasonable. I was a bit worried at first since this is my first time trying but I really liked the massage.\n\nUncle at counter was also polite to clients.\n\n",
        "Mal C\nLocal Guide·37 reviews·29 photos\nRated 1.0 out of 5,\nThis is not authentic Thai massage. The women aren't trained. I asked for extra hard thai massage and was terribly let down. I wanted to walk out after 5 mins into the massage but was told that another massuse who could massage hard and well would be available in about 30mins. I waited as I had already prepaid. It was the most hyped up massage that left me disappointed and totally unrelieved. I felt more stiff after than I did walking in there. I asked for more pressure but received less pressure. I also asked for shoulders and traps but got my arms massaged instead. I asked for glutes and hamstrings but got my calves massaged instead. I then got told I should stretch everyday and that I worked on a keyboard that's why I have tight traps. Both comments were not relevant as I do stretch everyday and I dont use a keyboard ever. Its like the massuse was making it up as she went along. She was saying how she has massaged for over 20years but she was atrociously inaccurate in her diagnosis and inaccurate with her massage. Both massuses were terrible. I wasted $55 and 90mins of my life there.\nIn conclusion, this place is good for people who don't know what thai massage is and who want untrained women hitting your spine with their elbow and not knowing anything about the human body. How this place has over a 4 star rating is beyond me.\n\n",
        "Chong Shiun Hoong\nLocal Guide·102 reviews·2,550 photos\nRated 4.0 out of 5,\nOnline booking and confirmation immediately. Went over today,was massage by Kim. Even she is small size but she have a good strength and will concentrate on your request of where should get more attention. Overall very good session will visit again.\n\n",
        "Fadz Lee\n1 review\nRated 5.0 out of 5,\nI would like to give compliment to a masseur named Kim. She has small fingers but strong pressure.Hence giving a very good deep point massage. i would highly recommend kim\n\n",
        "R. Perrie\nLocal Guide·25 reviews·11 photos\nRated 1.0 out of 5,\nEXTREMELY RUDE STAFF. DO NOT GO.\n\nFirst time going. Booked a session for my mum and me at 1050pm for 90mins. Told the lady I am looking forward to the massage as I heard good review- I am coming all the way from Tampines.\n\nArrived around 1030pm and sat at coffeeshop to drink water and got a call- hello can shift to 1120pm? I said I was already outside 1120 quite late what happened? Plus I booked for 90mins! Got no bus later. Mentioned that a customer came late. I said, oh dear should have told them to shorten as you have other customer- or inform me earlier. ( i don't think this is an unfair request- massage is  at least 1hour long- u inform me only 20mins before for a 30min++ delay??)\n\nMan started to yell me at me 'BOOKING IS A PREVILEGE! WE  NEVER EVEN TAKE MONEY FOR YOUR BOOKING! AT LEAST WE COURTESY CALL YOU!'\n\nTo which i hung up because no one should listen to such rudeness. Standards so low- apparently we must be happy they never ask money for booking and be grateful that they give a call when they the ones that screw up.\n\nThere are many other places in this times of covid that need business- this place apparently business too good so staff can afford to be so rude to customer! MUST AVOID. Not worth the time.\n\n",
        "Ashyikin\n1 review\nRated 5.0 out of 5,\nI had Ms Kim twice as my masseur and she is aaaamazing! She helped me with my backpain and joint stiffness and I went home feeling alive! She is attentive and very professional, def knows what she's doing.\n\n",
        "jewel lim\n1 review\nRated 5.0 out of 5,\nThe masseuse Lynn was really great, she knows all of my pressure points and was able to hit each and every one of them. Highly recommended!\n\n",
        "Jude T\n5 reviews·1 photo\nRated 5.0 out of 5,\nGood decent massage.  Professional and of good strength. Would go again if in the area.\n\n",
        "Shin\n6 reviews\nRated 2.0 out of 5,\nI was here due to the good reviews, but was terribly disappointed. My masseuse was inexperienced although she had a pretty good attitude, but the experience was unpleasant and non thai-like, where pressure applied on bones and wrists? light squeezes on arms, thighs and unusually long rubs on neck. Did not alleviate muscle soreness.\n\nI did overhear the next door customer complimenting the other masseuse, so I think experience varies with who you are allocated.\n\nAmendment: there was a mistake in my pricing comment, so I have redacted it.\n\n",
        "Nurhidayah Aziz\n2 reviews\nRated 5.0 out of 5,\nFor me its the best thai message I've ever experienced. At first I was skeptical as rarely do massage parlours have their massages on the floor. However, after going through the massage I think all massage parlours should do their massages on the floor. Only then can the massage be done with full effort and those hard to reach places like inner thighs can be stretched. I fully recommend this place.\n\n",
        "Azroy\n2 reviews\nRated 5.0 out of 5,\nFirst time been there, good massage by the thailand woman. She did well compare to other spa that i've been to. Clean enviroment no hanky panky feel much better after massage. Recommended!\n\n",
        "Ashton Chong\nLocal Guide·26 reviews·1 photo\nRated 5.0 out of 5,\nStrong authentic Thai massage, with the masseuse constantly asking you if the pressure is good enough. Indeed the pressure was good! For those who are wondering I'm 6ft tall and generally people who try to crack my back often lose balance and fall down, this lady steady can crack my back without losing balance. Not for the weak minded looking for a gentle backrub.\n\n",
        "Jeremiah Wee\nLocal Guide·21 reviews·1 photo\nRated 5.0 out of 5,\nWent down after having 5 days of bad neck sches, severe enough to prevent me from turning my head left to right fully. Had a solid 1hr massage and left being able to turn without pain again! I'll be making this a regular massage place for sure...\n\n",
        "Zack Goh\n7 reviews\nRated 5.0 out of 5,\nBest late night legit massage. A gem in Singapore. Kim is a very good massesue. Strongly recommend place to come. Thanks!\n\n",
        "Vishnu Suresh\nLocal Guide·18 reviews·5 photos\nRated 5.0 out of 5,\nCame here with a neck pain due to wrong sleeping prosture and body fatigue accumulated over running.\nThe Thai massage offered by Lily was amazing and helped me relieve the neck. Worth the price. Thanks.\n\n",
        "Urvashi Bhalode\nLocal Guide·22 reviews·13 photos\nRated 5.0 out of 5,\nOne of the best massages I've had in Singapore. Thanks a lot to the lady, Da, who was great with the back massage!\n\n",
        "zealous lim\n10 reviews·5 photos\nRated 3.0 out of 5,\nEdit: reduced to 3 stars due to an unpleasant visit on 23/12/20 after being a regular here for 3 years.\n\nA new hire was assigned who was inexperienced and had a big room for improvement. Better QC should have been in place to Ensure competency of masseuse.\n\nIt was so bad I had to stop the massage halfway approx 25 mins left. Shop offered refund $7 for my 25/60 mins ($55) massage left which left me confused. Rejected the refund and left an unhappy customer.\n\nPrevious review:\n\nExcellent authentic massage service in the heartlands. May wish to call for an appointment before heading down. Wendy is an excellent masseuse, never fails to knead those aches away. Price is reasonable and facilities are clean and comfortable.\n\n",
        "Alex “Gramsturn Null”\n13 reviews·1 photo\nRated 1.0 out of 5,\nHad at 90 mins body massage yesterday that was just dreadful. The masseuse was inexperienced and not using any kind of massage technic. All she was doing was pressing her hands and elbows into my skin repeatedly with her full body weight, this is not massage!. I came here because of the high reviews but the reviews do not match with the massage i received yesterday.\n\n",
        "Andy Low\nLocal Guide·121 reviews·11 photos\nRated 5.0 out of 5,\nReally cozy and clean Thai massage establishment in Bedok. A hidden gem. Very friendly reception service and masseuses. Also they are much more cheaper than the other establishments in the city area. I can't recommend this place enough.\n\n",
        "ben chin\n1 review\nRated 5.0 out of 5,\nIt was my first time over here and I had an amazing experience. The owner of this place is polite and answers your queries honestly. The interior of this establishment is clean and cozy. Therapists are experienced and know exactly what they are doing. Do not be afraid of Therapists using too much/little strength. There was clear communication between therapist and customer as well. Good location I must say for east siders! I will definitely recommend anyone, from having a relaxing massage, or to the fitness enthusiasts. This is the place to be 👍🏻\n\n",
        "Introvert With A Backpack\nLocal Guide·161 reviews·167 photos\nRated 5.0 out of 5,\nFirst time to try the spa since it’s a near our place. I had a very nice 90-min massage. Shoulders and back pain gone. A refreshing hot tea after the massage. Staff seems nice too. Would definitely recommend.\n\n",
        "Chee Ming Shum\n2 reviews\nRated 5.0 out of 5,\nI just had my first massage at TD Spa with my daughter. It was a great experience and we felt so refreshed after the massage. The staff were polite and attentive. I will definitely go back to have more massage.\n\n",
        "Joel Ng\n7 reviews\nRated 5.0 out of 5,\nHad a neck and shoulder ache. Went down for massage. I would say Kim is very experienced and the next morning all the ache was gone.\n\n",
        "Ari Nas (ary214)\n3 reviews·2 photos\nRated 5.0 out of 5,\nIt’s very hard to find a decent spa, especially in the east. TD Spa is not just decent. They are full out legit. The owner and masseuse are very polite. And the massage, bro, confirm won’t regret. You just tell her what’s aching. She’s do her best to remedy it. Power la. 5 stars. Terbaik.\n\n",
        "Melvin PP\nLocal Guide·38 reviews·2 photos\nRated 5.0 out of 5,\nI love thai massage and was giving this space a try. To my surprise it is the best thai massage Ive ever tried in Singapore. Im sure in Thailand too. Told the staff about my neck and shoulder problems. Previously, I only believed that a massage session is as good as it lasts. But this is the first place that took my pain away. Thank you. I will be there again. Please keep up the standards and the affordable pricing.\n\n",
        "Leon Lim\n5 reviews·6 photos\nRated 1.0 out of 5,\nLousy massage by Kim. Asked me any specific place need to massage, after telling her I have lower back pain she did not really focus on the lower back. So, what’s the point of asking?\n\n",
        "Elgin Lam\nLocal Guide·34 reviews·70 photos\nRated 5.0 out of 5,\nFantastic massage. A hidden gem in the east. My shoulder was hurting quite badly but the masseuse managed to reduce the pain significantly in just one session. She also knew which spots to press to relieve pain around the body. Thumbs up\n\n",
        "Sonia Fernandez\n4 reviews\nRated 1.0 out of 5,\nThe massage was just plain disappointing. The \"masseuse\" was extremely inexperienced and kept looking at the time. It was a full body massage but she only focused on my legs. What a waste of money.\n\n",
        "Yeo Vanessa\n4 reviews·1 photo\nRated 4.0 out of 5,\nTheir massage is really good. However, the management needs to improve in their service. We requested for 2 in a room way in advance but when we reach there, they told us we have to be separated as they have customers inside. This happened a few times despite us giving them feedback.\n\n",
        "Jay Jang (말레이녀석들)\nLocal Guide·43 reviews·169 photos\nRated 1.0 out of 5,\nYesterday was my last visiting this shop. The massager was not professional and doesn't know how to massage well. Even she spent over 20min for only one spot of my temple. Moreover she has finished 10min earlier of my 2hr massage. No worth anymore.\n\n",
        "Christopher Rodd\n2 reviews\nRated 4.0 out of 5,\nI had just arrived following a long journey from Europe . Before I left I found TD Spa in a google search and booked a 90 minute massage . it was well worth it . A superb masseur who clearly knew what she was doing . it was an excellent and very professional deep tissue massage . Well worth the very reasonable promotional price of  $68 .\nThe only down side was the fact that conditions were a bit cramped for the masseur , which was less than ideal  Absent that one criticism I would have given them 5 stars\n\n",
        "Stephanie Yeo\n4 reviews\nRated 1.0 out of 5,\nThe first time i came here, i had a great experience as they assigned a thai therapist to me. This time i came again, and they assigned a Chinese therapist who claimed she knew thai massage. For those who understand thai massage, it’s nothing like your swedish or aromatherapy massage with effleurages. She was trying to complete the one hour massage with just light touches and oil massage throughout. She used zero thai massage techniques and the pressure was completely soft and hard, and she could not tell the difference between bones and muscles. She had hands of a sandpaper. Just imagine being tortured throughout. I could tell she probably never graduated from a Thai massage school at all.\n\n",
        "adelyn CSL\n1 review\nRated 5.0 out of 5,\nworth every penny of my money.. cheap and good! my favourite therapist is nadia ive been here for many years.. she is very attentive and she is very experience.. her style of massage is different from others but really soothes the pain and aches away.. a must visit spa.. though its a small spa, the people here are very kind and friendly. They really make you feel welcome.. thumbs up!\n\n",
        "World Explorer\nLocal Guide·79 reviews·41 photos\nRated 5.0 out of 5,\nI went there on my second last day in Singapore, pretty impressed. I had my shoulder strained and after this Thai massage it went away immediately. Relaxed. Just few tips: Remember to mention how much pressure we want, else you may feel pain. Only cons here is, masseuse keep talking with each other. Bit noisy...\n\n",
        "G K\n2 reviews\nRated 5.0 out of 5,\njust finished massage therapy with Lisa.. very good masaage. less talk, concentrates only on work.. very much appreciate it. massage skill very good and know pressure points. Definatly will come back next month and so on and take service from her only. place nice..very clean. my neck and leg pain gone after massage.. really good skilld\nwill suggest to play light music too for mind refresh..\n\n",
        "mel\n4 reviews\nRated 5.0 out of 5,\nGoogle to see if there’s any decent massage near my area and glad I found this gem. The place is decent, clean and pricing is reasonable (please don’t expect JB pricing). Definitely will visit again!\n\n",
        "Dharma Fz\n4 reviews·1 photo\nRated 5.0 out of 5,\nTherapist Belle is amazing. Will always book her for my treatment. Very professional & will customised the massage and focus more on the pain areas. Authentic thai massage at affordable price.\n\n",
        "mayuresh mahajan\n4 reviews\nRated 5.0 out of 5,\nExperienced and professional massage staff. You can choose the staff from Thailand as well. I got all my pain relieved. Value for Money !  worth visiting.\nThanks TD Spa.\n\n",
        "Royston Wah\n6 reviews\nRated 5.0 out of 5,\nGood communication - before starting, masseuse asked where I felt \"pain\". The massage was enjoyable, and the pressure was good and strong.\n\n",
        "teresa khoo\n2 reviews\nRated 1.0 out of 5,\nLack of Business ethics.  My appointment for Husband and I was for an hour massage at 3.30pm. But when we texted to inform we would be 10 mins late due to traffic, we were informed to go at 4 pm because they gave allowed a customer to extend for 1/2 hour to 4 pm.  How could they do this when they have accepted advance appointments? Ridiculous!\n\n",
        "Leng Leng Kwek\n9 reviews\nRated 1.0 out of 5,\nWent on sat morn. Perhaps too early, The recept lady told me cant do foot, can only do body. The environment is clean, no unpleasant smell, plus point 2 toilets at the back. But the masseue did like 50/50 oil n acupoint massage throughout the 1.5hr. My body vy tense n hard yet she used a lot elbowing n crushing on my body. Makes my backpain worse. Dont find her professional enough.\n\n",
        "Vignesh Singh\n1 review\nRated 5.0 out of 5,\nI have had massages all over asia and even when I go on holiday visiting various places and different styles but nothing beats TD spa. A humble space but AMAZING service with only the best staff.\n\nEven if you live in Boon Lay, look no futher! Serious :))\n\n",
        "Vanessa Kwan\nLocal Guide·14 reviews·3 photos\nRated 5.0 out of 5,\n(i) Friendly and professional staff with good massage technique/skills;\n(ii) Answer calls for appointment promptly;\n(iii) Prices are reasonable;\n(iv) Extended operating hours is very good for late-night massage.\n\nRecommend this massage salon for a fuss-free massage after a long tiring day.\n\n",
        "Sufyan Maswan\n1 review\nRated 5.0 out of 5,\nWent through a couple of massage parlours in the East. I have to say this is the only one that is worth the money! Shout out to May/Mei as my body and I enjoyed it very much. It was calm and very relaxing. Will be going over again every month!\n\n",
        "Siti Ruhana\n1 review\nRated 5.0 out of 5,\nThis is my very first visit to TD SPA. I would say that this place is the best in Bedok, NO doubts. Belle is very humble and polite. Reception man are friendly. I took the promo $68nett for 90mins without think any further when I read lots of good review of few names mentioned. I would visit this place again at soonest! Kudos team TD SPA!\n\n",
        "LIM Fay\n5 reviews·1 photo\nRated 5.0 out of 5,\nExcellent massage from Angie. She has a professional massage skills to ease away my aches. I will definitely come back again!\n\n",
        "adrian Silva\n7 reviews\nRated 4.0 out of 5,\nBest ever. No regrets. Lady is so competent and experienced. Checks back to see if massage is to customer's standards . Tries to focus on resolving customers pain issues... exceeded my expectations... i'll be back...\n\n",
        "Harsh Vardhan\nLocal Guide·79 reviews\nRated 5.0 out of 5,\nVery Professional and liked it. I had requested my masseuse not  to apply too much pressure. She kept on ensuring if I am OK with the level of pressure. I feel invigorated now. Will go again!\n\n",
        "Zedrikk AZ\n1 review\nRated 5.0 out of 5,\nI’ve been to many massage spas and  TD SPA  has delivered service far beyond my expectation. Belle is my masseuse and will always look for her during my next appointments. Excellent service!\n\n",
        "varun pathak\n6 reviews·7 photos\nRated 5.0 out of 5,\nOne of the best massage I have received in Singapore. Friendly staff and very well trained masseuse. Totally worth it.\n\n",
        "Alson Ong\n3 reviews\nRated 5.0 out of 5,\nExperienced and skillful massuese who knows what she's doing. Was a real deep tissue massage which relieved all the muscle tightness. Great experience, definitely will be back again!\n\n",
        "CJ HAN\n2 reviews\nRated 4.0 out of 5,\nGood massage, clean & proper place. Friendly staff and overall A+. Too bad they can't operate after 1030pm, due to new Garmen law. However, Orchard & MBS can 24hrs, heartland why cannot..??? CaseTrust Accredited.\n\n",
        "J. W.\n1 review\nRated 5.0 out of 5,\nExcellent deep tissue massage. The masseuse found every knot without asking. Great price during the day and long opening hours. Friendly staff too!\n\n",
        "Nirmala Mel\n1 review\nRated 5.0 out of 5,\nFastatic massage services by Belle.\nshe use her magic hands to ease all my pain away..\nEXCELLENT PLACE AND SERVICE STAFFS..\nvery clean and professional..with affordable price..\nI will recommend and be back for more.. had a beautiful day..thank you\n\n",
        "SS K\n3 reviews\nRated 5.0 out of 5,\nGreat massage. The masseuses are very professional. Highly recommended for sportsperson with aching muscles and joints and for stress relief after long hours of work !\n\n",
        "Linda Fadz\n5 reviews\nRated 5.0 out of 5,\nMy personal favourite thai massage place for the past 8 years since i stayed in Bedok till i moved to Tampines. Professional massues with magic healing hands. Massue Nadia is highly recommended!!👍👍👍👍👍👍\n\n",
        "Alson Lee\n1 review\nRated 5.0 out of 5,\nAbsolutely sincere, pleasant service from reception to masseuse. The massage itself feels very authentic as well. thumbs up!\n\n",
        "Haley Reynolds\n1 review\nRated 5.0 out of 5,\nHad been my best massage in a long time. Highly skilled and professional masseurs. Highly recommended!!\n\n",
        "C JR\n1 review\nRated 5.0 out of 5,\nReasonable price for authentic Thai massage. Professional and friendly staff. Highly recommend for those that are working long hours.\n\n",
        "Alvin Ng\n2 reviews\nRated 5.0 out of 5,\nNice massage, friendly staffs and boss. Made a last minute appointment and they managed to let me through. Will go down again next week\n\n",
        "Jovin Yeo\n2 reviews·2 photos\nRated 5.0 out of 5,\nSuper good masseur that I have encounter. The masseur will massage the spot where your soreness is. I have a great experience here!\n\n",
        "Chan Xierra\nLocal Guide·71 reviews·67 photos\nRated 3.0 out of 5,\nHeard of them on google review but the original thai / oil massage is moderate.\n\n",
        "Summer Ye\n16 reviews·11 photos\nRated 5.0 out of 5,\nGood massage, very polite staff, pleasant and clean place. I already left the place but the staff came out to tell me I left my necklace behind :)\n\n",
        "Crystal Ang\n1 review\nRated 5.0 out of 5,\nMy first visit here with hubby. I have to say that the massage is really good. We will come back again.\n\n",
        "bb wendzzz\n1 review\nRated 5.0 out of 5,\nGreat excellent services ... excellent massage skill make full relax for a tired body and foot ... highly recommended .. definitely will visit again .. love the massage and friendly environment provided by the masseuses and the boss ...\n\n",
        "Rajesh P\n13 reviews\nRated 5.0 out of 5,\nVery good and clean massage\n\n",
        "Premi bholey Nath ka\n1 review·1 photo\nRated 5.0 out of 5,\nStaff is very polite and massage was awsm. Relaxed by stretching, pressure on muscles..great experience\n\n",
        "Roslan\n1 review\nRated 4.0 out of 5,\nThe massage was awesome and the staff are polite and professional ... highly recommended .. looking forward for my next visit.\n\n",
        "Rajnish Kumar Singh\n7 reviews\nRated 2.0 out of 5,\nAC doesn't work...towel and sheet are dated, though clean.\n\nmasseuse kept taking to other emoloyees while doing her job...would appreciate if this doesn't happen next time.\n\n",
        "Norhayati Othman\n1 review\nRated 4.0 out of 5,\nThey provide excellence and relaxing massage . really enjoyed my massage throughout ..😍\n\n",
        "Ja Xin\nLocal Guide·95 reviews·222 photos\nRated 5.0 out of 5,\nMassage better than most of the ones I had in Thailand. Clean and decent ambiance.\n\n",
        "mike ang\n2 reviews·1 photo\nRated 5.0 out of 5,\nWill visit 2 times every month to relax my body. Very good skills and no hankie pankie business. Highly recommend.\n\n",
        "Liyana Karsadi\n2 reviews\nRated 4.0 out of 5,\nVery good massage. Will definitely come back again if i need a good back massage.\n\n",
        "Paul Tan\n2 reviews\nRated 5.0 out of 5,\nGood massage at a reasonable price. Friendly and polite staff. Must try.\n\n",
        "maurizio chedid\n1 review\nRated 4.0 out of 5,\n....amazing place.....very traditional and clean massage center....and Na masseu is my favourite...:)\n\n",
        "Kelly Thong\n10 reviews·16 photos\nRated 5.0 out of 5,\nAwesome massage by experienced Thai ladies. Will definitely return again\n\n",
        "Lydiawati S.\n2 reviews\nRated 4.0 out of 5,\nGreat thai massage in bedok area.. closes late, feels energised after the massage.. very good service..\n\n",
        "Charlie Lim\n2 reviews·4 photos\nRated 5.0 out of 5,\nNice & professional massage. Very Good service by staff.\n\n",
        "Ito Kasho\n1 review\nRated 5.0 out of 5,\nGood massage and very professional, would definitely return again 👌🏻\n\n",
        "Hidhir Amir\n5 reviews\nRated 5.0 out of 5,\nVery Professional and Pleasant Place for Thai massage 💆 will return again\n\n",
        "Joseph Ng\n1 review\nRated 5.0 out of 5,\nFriendly boss and masseurs! They do good work and help me relax after a stressful week.\n\n",
        "yulin lim\n4 reviews·1 photo\nRated 5.0 out of 5,\nExcellent massage and service !! Will definitely visit again :)\n\n",
        "Alicia Khoo\n2 reviews\nRated 4.0 out of 5,\nFeel relaxed after the massage. Price is quite reasonable.\n\n",
        "Thomas Leong\n1 review\nRated 5.0 out of 5,\nVery good massage you could get at TD Spa.\n\n",
        "jacky foo\n2 reviews\nRated 5.0 out of 5,\nExcellent Massage.\n\n",
        "Cadalso YT\nLocal Guide·61 reviews·34 photos\nRated 5.0 out of 5,\nHello can i apply as a massage therapist? I am 10 years experience as a massage therapist\n\n",
        "Steve Tunstall\n1 review\nRated 5.0 out of 5,\nGreat massage, good value, will visit again\n\n",
        "Hasan Parvez\n1 review\nRated 5.0 out of 5,\nI m so happy to massage that spa.i m really fell good .\n\n",
        "maan schields\n1 review\nRated 5.0 out of 5,\nBelle is very good. Relaxing experience..Excellent customer service.. 😀\n\n",
        "YKM TEAM\n1 review\nRated 5.0 out of 5,\nGet full body massage at affordable price!\n\n",
        "Ben\n1 review\nRated 5.0 out of 5,\nVery good and friendly service provided! Recommended!\n\n",
        "Jack Wong\nLocal Guide·15 reviews·74 photos\nRated 5.0 out of 5,\nGood service n affordable price. Recomended.\n\n",
        "kamarudin maideen\n1 review\nRated 5.0 out of 5,\nI'm happy now I can  walk as per normal\n\n",
        "Jan N\n18 reviews\nRated 5.0 out of 5,\nVery good service and professional. That was nice !\n\n",
        "PIN CHUAN CHANG\nLocal Guide·83 reviews·27 photos\nRated 5.0 out of 5,\nVery authentic Thai massage\n\n",
        "Jess Lim\n4 reviews\nRated 4.0 out of 5,\nFriendly Boss & Staff with Reasonable Price ....\n\n",
        "Tee Bryan\n16 reviews·24 photos\nRated 5.0 out of 5,\nVery good massage skill\n\n",
        "SEAN HISATO TOH\n4 reviews·1 photo\nRated 5.0 out of 5,\nReasonable price and good service\n\n",
        "V. Teo\n55 reviews·50 photos\nRated 5.0 out of 5,\nGood massage. Relaxed!\n\n",
        "abhishek thakur\n1 review\nRated 5.0 out of 5,\nBest 👌👌\n\n",
        "Samson Lee\n4 reviews\nRated 5.0 out of 5,\nProfessional Thai massage!\n\n",
        "Vijey Muthukrishnan\n3 reviews\nRated 5.0 out of 5,\nProper, good massage\n\n",
        "Joshua Ong\nLocal Guide·8 reviews·19 photos\nRated 5.0 out of 5,\nGood masseuse\n\n",
        "Gine Gine\n7 reviews·3 photos\nRated 1.0 out of 5,\n(Translated by Google) Very disappointed that the masseuse just touched me all the time. She just said that she would not lose her temper if she couldn’t press it. The boss’s too bad attitude doesn’t make her feel wrong. She said that the …More\n\n",
        "소고기\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) Friendly and massage is very cool\nKindly people and nice massage! …More\n\n",
        "Ng Yanda\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ek\n7 reviews\nRated 5.0 out of 5,\n\n\n",
        "Genevia Lim\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Dozuro Fajiri\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Lim Toon Eng\n1 review\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6445 0466\">6445 0466</span>",
    "Website": "https://www.tdspacompany.com/"
}