{
    "Name": "The Outcall Spa",
    "Products": {
        "Swedish | Deep Tissue | Tui-Na | Prenatal Massage 90mins": "$198.00"
    },
    "Address": "73 Ubi Road 1 #06-58 Oxley Bizhub, 408733",
    "Opening Hours": "Saturday 2pm–1am\nSunday 2pm–1am\nMonday Closed\nTuesday 2pm–1am\nWednesday 2pm–1am\nThursday 2pm–1am\nFriday 2pm–1am\nSuggest new hours",
    "Rating": "4.8\n76 reviews",
    "Reviews": [
        "Alesia Chee\n1 review\nRated 5.0 out of 5,\nBooked a surprise massage for my hubby to relax his tired body. Was in the room throughout the massage and I must say the therapist is very good even my hubby mention her skill is good. Highly recommend outcall spa.\n\n",
        "Des Puey\n2 reviews·1 photo\nRated 5.0 out of 5,\nThis was my first experience with call in home services and it won’t be the last. Ange was helpful in assisting the booking when I ran into technical difficulties quickly and promptly. Appreciate that the therapists are female as I personally feel safer and more comfortable with a service provider of the same gender. My therapist was Yuki and she was not only professional but also attentive to my tight muscles. Highly recommend The Outcall Spa if anyone is still on the fence.\n\n",
        "Elton Li\n1 review\nRated 5.0 out of 5,\nThe lady arrived as to the agreed timing and with a friendly smile. Setting up was pretty speedy and within 10 mins I’m on the portable bed ready for the massage session. Overall experience was good and I’m glad I found the right one although the pricing seems rather on the high side. Hoping for more promotional update!\n\n",
        "Alesia Chee\n1 review\nRated 5.0 out of 5,\nBooked a surprise massage for my hubby to relax his tired body. Was in the room throughout the massage and I must say the therapist is very good even my hubby mention her skill is good. Highly recommend outcall spa.\n\n",
        "Des Puey\n2 reviews·1 photo\nRated 5.0 out of 5,\nThis was my first experience with call in home services and it won’t be the last. Ange was helpful in assisting the booking when I ran into technical difficulties quickly and promptly. Appreciate that the therapists are female as I personally feel safer and more comfortable with a service provider of the same gender. My therapist was Yuki and she was not only professional but also attentive to my tight muscles. Highly recommend The Outcall Spa if anyone is still on the fence.\n\n",
        "Elton Li\n1 review\nRated 5.0 out of 5,\nThe lady arrived as to the agreed timing and with a friendly smile. Setting up was pretty speedy and within 10 mins I’m on the portable bed ready for the massage session. Overall experience was good and I’m glad I found the right one although the pricing seems rather on the high side. Hoping for more promotional update!\n\n",
        "Kenji Y\n3 reviews·1 photo\nRated 5.0 out of 5,\nHave booked a birthday surprise massage for my wife. It was a last minute booking. All thanks to Ange from Outcall Spa for her professionalism in handling the arrangement. The masseur was good, nice setup with soothing music. Mobile bed is sturdy. Never expect such spa can be actualised at home. This is an underrated service at most affordable price. Well run company. Keep it up!\n\n",
        "Lin Changjie\n4 reviews\nRated 5.0 out of 5,\nWith the recent heightened alerts, le wife was resourceful and creative and engaged the Outcall Spa for me to have a massage at the comfort of our homes! Lovely surprise indeed - the masseuses were good and professional, mobile bed setup was sturdy and stable, it just felt like the having a massage at the shop! Thanks for the wonderful experience!\n\n",
        "Rasyida Sam\n1 review\nRated 5.0 out of 5,\nI had a therapist over at my house on June 10. The therapist arrived early, giving her time to set up the massage bed and towels, and had to fuss the whole time while I got ready for my massage. By the time I was ready, she had the spa music on, helping me relax. The massage was also relaxing, and she constantly checked if the pressure was okay especially when working on the knots on my stiff neck. I felt relaxed after the session. Overall, I recommend Outcall Spa, especially for busy working parents who have no time to visit a spa offsite.\n\n",
        "Qi Min Ho\n2 reviews\nRated 5.0 out of 5,\nMy massage therapist was Vinita. Had a really great experience with her service. Pressure was just nice and she was very polite. The booking system was also very fuss free. Highly recommend!\n\n",
        "Siti Zaharah\n1 review\nRated 5.0 out of 5,\nEnjoyed a day off with my partner for a couple massage. Masseuse was experienced and was helping me understand why my body was hurting at some areas and recommended things for me to do if it still hurts. My partner enjoyed himself as well. Table is really comfortable as well. Will recommend everyone to try it despite the price. It’s worth it!\n\n",
        "Zhenni Lee\n5 reviews\nRated 5.0 out of 5,\nFirst booking with them. Female masseur came to my house on time. She set-up the bed, massage oil selection and turn on spa music. Love her pressure point on my neck and back. I really enjoyed 90mins of massage! Thank you JJ!\n\n",
        "Chantel Ong\n4 reviews\nRated 5.0 out of 5,\nOutcall Spa is so awesome as you get to enjoy the massage within your own home. Outcall spa would first try to understand your preference, whether u prefer stronger or lighter massages before assigning you the right masseuse. I did a prenatal massage for 90mins with my masseuse, Olive. Was told that she is stronger which i sincerely appreciate! It was a wonderful 90mins as she educated me on why certain areas are aching more and why I am swelling, also taught me tips to prevent the recurrence. I love the experience so much I am actually considering signing up for the package and requesting for Olive. Hahahaha! Give it a try!\n\n",
        "Shafiyahtun Najak\n1 review\nRated 5.0 out of 5,\nMasseuse Ivy did my pre-natal, and she was good as well as professional.\n\n",
        "Alvin Chua\n1 review\nRated 5.0 out of 5,\nHad made a booking to surprise wife. Originally had wanted to get it over the long weekend but unfortunately the booking slots were full. Ange who took my enquires was helpful and secured the next available slot on Tuesday. Therapist was punctual and professional. Wife enjoyed a truly therapeutic n relaxing evening. Thank u!\n\n",
        "Sian-Tzu Casteels\n2 reviews\nRated 5.0 out of 5,\nSuper professional and lovely ladies who took great care of us! Will definitely do this again soon!\n\n",
        "Fenny Che\n1 review\nRated 4.0 out of 5,\nSatisfied! I arrange this for my hubby as a surprise gift and no doubt…He like it…his happy and satisfied with the service 😊\n\n",
        "Daniel Strauss\n2 reviews\nRated 5.0 out of 5,\nI ordered a massage for my wife's birthday and my wife said it was one of the best she's had. The masseuse, JJ, was very professional and we look forward to booking again.\n\n",
        "Ali Alredha\n4 reviews·2 photos\nRated 5.0 out of 5,\nExcellent service ! I am always worried that the majority of the outcall services won't be of high standards or professional, but this time I was definitely impressed. A great and professional service and I was left relaxed and stress free. I will definitely be using this service again. If you want a good professional massage with no funny business this is the one !\n\n",
        "Joanna Lim\n4 reviews\nRated 5.0 out of 5,\nHad a hectic work schedule and I was feeling so lethargic that I don’t wish to step out of house! Thank God for them, I had a good in-house massage time relive some stress and aches! Their service is great (:\n\n",
        "netmissy\n1 review\nRated 5.0 out of 5,\nExcellent service! Needed a massage badly and didn't disappoint me at all. Punctual and prompt service. Definitely exceeded my expectations. Will definite use their service again.\n\n",
        "Rebecca\n2 reviews\nRated 4.0 out of 5,\nThe therapist Yuki used just the right amount of pressure to release the tension on my back.\nSet up of equipment was fast, background music was soothing. I had a really good sleep.\n\n",
        "Matthew Smith\n8 reviews·1 photo\nRated 5.0 out of 5,\nI always buy a 90 min massage for my wife. Great staff and always on time. Best massage in Singapore.\n\n",
        "Wei Ting\n9 reviews·4 photos\nRated 5.0 out of 5,\nIt was my first home massage and I had a great experience, all thanks to my therapist JJ, who was very professional and skillful in targeting the tight knots in my neck and back. Will recommend for anyone to try out ! :)\n\n",
        "Sohini Sengupta\n10 reviews·1 photo\nRated 5.0 out of 5,\nOn time, experienced therapist and great experience. Highly recommended for those who can't fit massages into their schedule during regular spa business hours.\n\n",
        "Julia Pearson\n1 review\nRated 5.0 out of 5,\nExcellent service! I needed to get a manicure and pedicure but couldn’t be bothered to go to the salon. I was able to make an appointment the same day. A very friendly therapist arrived at my house on time and gave me a fantastic gel manicure and pedicure. I’m rather fussy and was very impressed with the results. Thank you very much!\n\n",
        "shikin kikin\n8 reviews\nRated 5.0 out of 5,\nTwo thumbs up! If I had more thumbs, I would gladly give it to The Outcall Spa! Service was beyond expectations. Staffs were very professional, engaging and friendly. They were also very knowledgeable and shared about the ailments and pressure points about our body. The portable massage table was also super sturdy to my surprise! I liked that they brought along their own music to give us a more relaxing and sensual experience. We will definitely recommend this to friends and family and even to you reading this review! Pick up the phone and book them to have a feel of what I am talking about. U won't regret! :D\n\n",
        "Stella Tan\n1 review\nRated 5.0 out of 5,\nAmazed by the therapeutic experience I received from The Outcall Spa. Love the bed, music and best part the ginger tea ! Awesome Swedish massage, had a good sleep right after.. Best one ever. Thumbs up !\n\n",
        "Cordelia Yang\nLocal Guide·19 reviews·10 photos\nRated 5.0 out of 5,\nBooking was effortless and fast, masseuse (Katherine) arrived early with all the equipment required to turn my home into a spa! The massage was awesome. Well worth the price.\n\n",
        "Red Sunny\n8 reviews\nRated 5.0 out of 5,\nAwesome experience. Can't be more pleased to be massaged in the comfort of my own home. They are only a phone call away. Keep up the good servces.\n\n",
        "Lincoln Anthony Fernandez\n21 reviews·1 photo\nRated 5.0 out of 5,\nIt was a good massage.\nThe masseuse was keen and to the detail.\nVery professional service from start to end.\n\n",
        "yuqing li\n6 reviews\nRated 5.0 out of 5,\nSuch a great idea to bring service to your doorstep. The staff is very friendly and accommodating. Great choice for working mom and stay at home mom.\n\n",
        "Per Xin Er\n2 reviews\nRated 5.0 out of 5,\nmy husband and i were very impressed with your professionalism and the little detail you guys have in placed; like the music, the portable lamp and ginger tea etc.. nothing less as compared to a retail outlet and most importantly at our comfort! both therapists are attentive to our needs and superb skilled, we felt relieved after the session!\n\n",
        "veron tang\n1 review\nRated 5.0 out of 5,\nThe masseurs who attended to us on Valentine's Day, made it an extra special experience with the complete package of a bouquet of roses and wine and the massage was professional and relaxing. It's definitely something worth trying considering the convenience ans excellent service.\n\n",
        "delia ho\n2 reviews\nRated 5.0 out of 5,\nSuperb massage at the comfort and convenience of one's own home. Highly recommended.\n\n",
        "Mavis Tay\n1 review\nRated 5.0 out of 5,\nExperienced and skillful therapist that goes straight to your home with all the spa experience. Thumbs up for creating the spa ambience and they were really quick to setup the massage bed, diffuser, music and towel. The tuina therapist was good and her strokes were all on point.\n\n",
        "June Lee\n1 review\nRated 5.0 out of 5,\nThe manicurist arrived on time and did a very professional and thorough job for me and my Daughter. We enjoyed the entire experience and will definitely engage in their other services too ! Thank you\n\n",
        "Trilly\n3 reviews\nRated 5.0 out of 5,\nHad an amazing experience with The Outcall Spa yesterday. I had no idea my body was so tensed and stiff but my masseur managed to release so many knots. I felt so fresh and rejuvenated after the massage. The set up was fast and quick. Once i shut my eyes, it felt like I wasn't at home! Thumbs up!\n\n",
        "karunakaran Oorathi Pathangi\n2 reviews\nRated 5.0 out of 5,\nFast, reliable and trustworthy. Booked session at 11:45 PM for deep tissue massage and got had relaxing session at home.\n\n",
        "Pamela Phor\n1 review\nRated 5.0 out of 5,\nHighly recommended! Especially for busy mothers like me who cannot afford much time to travel out of the house, what better way to pamper youself with a massage in the comforts of your own home at your convenience. Standard is nothing short of a professional spa massage with aromatherapy oils, relaxing music and hot tea served after. Thanks Amber for the wonderful gift! :)\n\n",
        "Qiu Xin\nLocal Guide·5 reviews\nRated 5.0 out of 5,\nOne of the most pleasent experience I ever had. They were really punctual, in fact they arrived earlier than schedule. I did the 4D eyelash extension which turns out to be really natural and the whole entire process was so comfortable that I fell asleep.  There is 100% not irritation to or discomfort. Will highly recommend them.\n\n",
        "Adrian Lee\n4 reviews·4 photos\nRated 5.0 out of 5,\nHave a very great experience with their services.\nFirstly they will try to cater with my timing. Made a advance appointment for Valentine's Day celebration.\nThey will come 10mins earlier to set the beds and equipment so as not to eat into my massage duration. Very punctual.\nTheir massages are very good, first time in my life I fell asleep like a baby during a massage.\nVery good experience to have a massage in the comfort of my home.\nHighly recommended to couples or individuals that wants a massage but dun wanna waste time travelling. Will definitely go for their service again the next time.\n\n",
        "Li Yuen Chong\n15 reviews·3 photos\nRated 5.0 out of 5,\nA real 5 star experience! They setup massage station in my home and switch on relaxing spa music while massaging me. Love their Deep Tissue Massage!\n\n",
        "UKay Cheung (Dronemania)\n1 review\nRated 5.0 out of 5,\nConvenient, professional, and probably the best way to end the evening after a hard week.. I just rolled into bed. It was a very comfortable experience. And my masseuse Lin gave me a very good massage that made me sleep like a baby after. Highly recommended!\n\n",
        "Angela Ng\nLocal Guide·96 reviews·62 photos\nRated 5.0 out of 5,\nVery professional set-up. My masseuse (Catherine) was conscientious, focused and kind. Loved that a proper massage table was provided (and efficiently assembled!) and that we ended with hot ginger tea. Definitely a splurge (prices aren't cheap) but worth it if you want to pamper yourself with a spa experience in the convenience of home.\n\nI didn't get music or candles like in the video though. Not a big deal. :)\n\n",
        "Zoann Tee\n2 reviews·1 photo\nRated 5.0 out of 5,\nI received a gift voucher for The Outcall spa from my gfs . It is great to be able to get massage at the comfort of your own home.  Service was gd , massuser was prompt and skill was gd . Nothing was compromise. They were well equipped with candle , music & Ginger tea.\n\n",
        "Michelle Chong\n2 reviews·1 photo\nRated 5.0 out of 5,\nTheir service is good with very experienced massue too. Their set up is very relaxing too. Am a many times return customer. Highly recommended.\n\n",
        "Isabella Lim\n2 reviews\nRated 5.0 out of 5,\nIt was a very pleasant first experience with the Outcall Spa. I was surprised that I was able to get a same-day appointment for a prenatal massage at the comfort of my own home easily. I must praise the good service/communication provided via WhatsApp that allowed me to clarify my queries and get the booking done so promptly. My therapist was Nurul, and she is very experienced and was careful in her massage strokes as I’m in the later term of my pregnancy. She also kept checking in with me if everything is fine and if the pressure is right. The whole home service included a massage bed, music, essential oil, lights, and ended with a nice warm ginger tea! Perhaps the only thing if I have to mention anything negative is that the price is on the higher side, but I guess the service and quality of the massage explains why.\n\n",
        "Fathima Maryam\n1 review\nRated 5.0 out of 5,\nMy therapist was jocelyn lydia. Pleasant massage experience. Recommended.\n\n",
        "Neeraj Mittal\nLocal Guide·64 reviews·70 photos\nRated 5.0 out of 5,\nI’d booked it for our anniversary during our trip to Singapore\nIt’s the best massage I’ve got in a long time. I would definitely recommend The Outcall Spa for a massage. It is very convenient as they carry their massage table, towel, candle light, music. I had a therapist called JJ. She was really good at it and made us feel comfortable. We were also offered amazing green tea post our session.\n\nThey are professional!\nI would definitely like to book it again\n\n",
        "Siti Nurliyana\n5 reviews\nRated 5.0 out of 5,\nKudos to the Outcall Spa Team for the awesome 5 star service! Tried the Postnatal massage by masseuse Katherine, she really knows where were my pain points and helps to pushup my uterus up! Once again thank u so much!! =)\n\n",
        "Jyoti Maan\n5 reviews·1 photo\nRated 2.0 out of 5,\nI had a bad experience. The towel stuff was not smooth and soft during massage ☺️ Towel was like piercing me so I was uncomfortable\n\n",
        "Debra A\n1 review\nRated 5.0 out of 5,\nVery prompt replies and fuss free. Masseuses were professional and informative. Would use the services again.\n\n",
        "Daprayer -\n6 reviews·1 photo\nRated 5.0 out of 5,\nHad an excellent massage session last night by The Outcall Spa! Our masseurs, Joanne and Ann, were great with the massages and when my boy refused to sleep during our session, they helped to keep an eye on him and entertained him while allowing my husband and I to have an enjoyable session. There were soft music, dim lights, comfy massage beds and even lemongrass drink after the massage - the full massage experience right in the comfort of our home!\n\n",
        "Shantanu Mukerji\n5 reviews\nRated 4.0 out of 5,\nThe therapist Ling Ling was very good. She was also patient and had a great attitude\n\n",
        "Jade Lee\nLocal Guide·34 reviews·30 photos\nRated 5.0 out of 5,\nLoved the experience. Highly recommend, even if it's only 1 time to pamper yourself.\n\n",
        "Emily Lim\n2 reviews\nRated 5.0 out of 5,\nTheir professionalism from start to finish was highly reassuring.  Planned a surprise birthday session for my sister and myself as a treat, and the entire process of booking till they were in our home was smooth and easy!  Prompt Confirmation of the appointment via text, excellent customer service to answer all queries, extremely punctual in arrival.  The masseuse Lynn was professional, friendly, and knew exactly what she was doing.  She gave an excellent Swedish massage!  The background music, comfortable bed, and hot ginger at the end of the session made the experience perfect.  I would not hesitate to recommend The Outcall Spa to any of my family and friends!\n\n",
        "NGUYEN THU\n4 reviews·2 photos\nRated 5.0 out of 5,\nTheir service is amazing.I have no hesitation recommending their services to any one else.\n\n",
        "Kelly Ang\n2 reviews\nRated 5.0 out of 5,\nSuper awesome!  Very relaxing can't wait for the next session (:\n\n",
        "Jie Ying Lam\n2 reviews\nRated 5.0 out of 5,\nVery efficient and good service! Saves the trouble of going out.\n\n",
        "Mohamad yusri Mohamed yusoff\n6 reviews·6 photos\nRated 5.0 out of 5,\nAwesome\n\n",
        "Areeya sappaisansuk\n5 reviews\nRated 5.0 out of 5,\nskillful and polite :)\nrecommend\n\n",
        "Sabrina Seah\n2 reviews\nRated 5.0 out of 5,\nMassage at the comfort of our own home.. with music playing at the background.. complete relaxation 👍🏻 After massage they served us hot ginger tea.. superb service.. masseuse is professional and well trained too.. definitely hope to have theoutcallspa massage at the comfort of my own home again!\n\n",
        "Mukta ARYA\n4 reviews\nRated 5.0 out of 5,\nExcellent service\n\n",
        "Woolee Beauty & Home\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Prateek Chandok\nLocal Guide·36 reviews·31 photos\nRated 5.0 out of 5,\n\n\n",
        "Jothinee D.A\n3 reviews·3 photos\nRated 4.0 out of 5,\n\n\n",
        "Kayden Lee Wai Kiat\n2 reviews·2 photos\nRated 1.0 out of 5,\n\n\n",
        "David Lallemant\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Shanty Chandra\n3 reviews\nRated 4.0 out of 5,\n\n\n",
        "MURUGA SATHIVELU\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jenny Mok\n1 review\nRated 5.0 out of 5,\n\n\n",
        "yae nomura\n1 review\nRated 5.0 out of 5,\n\n\n",
        "jyy yeu kok\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Sock Hoon Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Priscila\n4 reviews\nRated 5.0 out of 5,\n\n\n",
        "Zain Suharwardy\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Katharine Dixon\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "YuYI _KDL\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 8782 0561\">8782 0561</span>",
    "Website": "https://www.theoutcallspa.com/"
}