{
    "Name": "The Male Therapist - Male Massage Singapore",
    "Products": null,
    "Address": "190 Clemenceau Avenue #04-15, Singapore Shopping Centre, 239924",
    "Opening Hours": "Saturday 11am–7pm\nSunday 11am–6pm\nMonday 11am–7pm\nTuesday 11am–7pm\nWednesday 11am–7pm\nThursday 11am–7pm\nFriday 11am–7pm\nSuggest new hours",
    "Rating": "4.4\n27 reviews",
    "Reviews": [
        "Chung Tyan Soon\n1 review\nRated 5.0 out of 5,\nDavid is a professional, skillful and a really friendly person. I feel very welcomed from the moment I enter the shop. Overall the massage given was really relaxing and it was wonderful. He never rush throughout the session and takes his time in targeting sore muscles. Also had the body scrub, by removing dead skin on your body and combined with a brilliant massage it definitely makes you leaving feeling fresh and clean! I would recommend David for anyone who is looking for a great massage therapist in Singapore.\n\n",
        "Anthony Ong\n1 review\nRated 5.0 out of 5,\nExcellent service from David. The massage was firm and strong. Especially liked the stretches. The body scrub after the session made me felt clean.\n\nVery nice chap as well. Attentive and knowledgeable about his traits. Highly recommended!\n\n",
        "Hsu Vincent\nLocal Guide·41 reviews·156 photos\nRated 1.0 out of 5,\nReally bad experience. He just put the oil on your body and he doesn't use any energy to massage on you!\nEven worse, he just try waste the time and he prepared the tea for almost 10 mins! Can be calculated, I just get 45 mins massage, not 60 mins.\n\nAll the comments are really fake.\n\n",
        "Chung Tyan Soon\n1 review\nRated 5.0 out of 5,\nDavid is a professional, skillful and a really friendly person. I feel very welcomed from the moment I enter the shop. Overall the massage given was really relaxing and it was wonderful. He never rush throughout the session and takes his time in targeting sore muscles. Also had the body scrub, by removing dead skin on your body and combined with a brilliant massage it definitely makes you leaving feeling fresh and clean! I would recommend David for anyone who is looking for a great massage therapist in Singapore.\n\n",
        "Anthony Ong\n1 review\nRated 5.0 out of 5,\nExcellent service from David. The massage was firm and strong. Especially liked the stretches. The body scrub after the session made me felt clean.\n\nVery nice chap as well. Attentive and knowledgeable about his traits. Highly recommended!\n\n",
        "Hsu Vincent\nLocal Guide·41 reviews·156 photos\nRated 1.0 out of 5,\nReally bad experience. He just put the oil on your body and he doesn't use any energy to massage on you!\nEven worse, he just try waste the time and he prepared the tea for almost 10 mins! Can be calculated, I just get 45 mins massage, not 60 mins.\n\nAll the comments are really fake.\n\n",
        "lurkee123\n4 reviews\nRated 5.0 out of 5,\nTherapist David is very professional, friendly and makes you feel at home with his conversation. I have had both the 'Totality' and Swedish massages - former is more relaxing and latter is stronger - and both are very good. The place is clean, neat, with a shower and easily accessible. I went 5 times in the last 3 weeks so would hIghly recommend him.\n\n",
        "Ludwig Heide\n1 review\nRated 5.0 out of 5,\nJust had an amazing back massage by David. A true professional, he knows the « knots » and where your back needs to be worked. David was also super friendly -he makes you feel relaxed. Highly recommended.\n\n",
        "Mohamed BMH\n3 reviews\nRated 5.0 out of 5,\nHad a nice relaxing massage from David. Just wished I’d more time to take the massage and scrub package. Will try that next month for sure. Also wished I’d more time to take a longer massage session. Thanks David 👍🏼\n\n",
        "Wo Hou\n6 reviews·9 photos\nRated 5.0 out of 5,\nDavid’s massage skill is exceptional. Very nice guy too. The place is quiet which is great. It’s a generally pleasant experience. Would definitely recommend.\n\n",
        "Ben Built\n3 reviews\nRated 5.0 out of 5,\nExcellent service, one of the best massages I have ever received. David is a pure magician and very skilled. Firm grip, male attitude, just a wonderful  experience.\n\n",
        "handy Waluyo\nLocal Guide·62 reviews·180 photos\nRated 1.0 out of 5,\nI was there last 17th at 0920pm,  took body scrub treatment.  Its like... .  The receptionist n theraphist poor English. The quality of treatment terrible n  less then 50 minutes as mentioned at menu.  The spa product is a question mark.  Spent $80 Sg or more is not worthed to come here.  I was willing to meet with Manager,  but he wasbt in charge there.  I am working at hotel spa in Bali.  The price is cheaper then here,  but quality cant compare.\n\nNeed a lot of improve.\n\n",
        "Amir Saa\nLocal Guide·209 reviews·548 photos\nRated 5.0 out of 5,\nHi\nIt's wasn't my first massage I got, but it was  one of the best I ever had.\nDavid is proffesional messuer, polite and above all considerate.\nI loved his touch on the right points, he lmissed no bone on my body.\nThank you\nI'll be glad to come back\n\n",
        "Darren Ng\n1 review\nRated 5.0 out of 5,\nI have just had my massage with david and I must say that hands down , one of the best massage I've had for a very Long time. David is passionate and skilled in the art of massage. Highly recommended .\n\n",
        "D G\n1 review\nRated 5.0 out of 5,\nI have regularly visited David over the last 6 or 7 years.  His service is always very professional and good value.  I recommend him as a go to therapist in Singapore.\n\n",
        "Jarrod Ho\n3 reviews·1 photo\nRated 5.0 out of 5,\nHad a terrible stretched neck and back ache. Wife shoo me straight to David for the remedy. So glad I came as the firm pressure and stretching session untie the knots and I felt instant relief from the ache thereafter. Thanks, Dave! Will be back!\n\n",
        "simon sue\n2 reviews·5 photos\nRated 5.0 out of 5,\nExcellent therapy ! Did a swedish deep tissues massage and it was really great. The therapist also very humorous and chatty. very comfortable at this place.Highly recommend.\n\n",
        "Bruno\nLocal Guide·43 reviews·23 photos\nRated 5.0 out of 5,\nSkilled combination of techniques which are very relaxing. David is passionate about his job and it shows. I will be back next time I'm in town.\n\n",
        "benny tan\n1 review\nRated 5.0 out of 5,\nDavid is a professional, skillful and a really friendly person. Excellent Service. Highly recommend\n\n",
        "Steven Chong\n8 reviews\nRated 5.0 out of 5,\nDavid quite a professional therapist. The place quite clean and cozy. It's highly recommended..\n\n",
        "Ttt Sing\n1 review\nRated 5.0 out of 5,\nExcellent service! Patient and not in a hurry to finish the massage.  Manage to unknot the muscles.  Worth a revisit!\n\n",
        "Han\n5 reviews·6 photos\nRated 5.0 out of 5,\nThank you for the wonderful massage David.I highly recommend checking The Male Therapist out if you need a good massage.\n\n",
        "Jeremy Sp\n1 review\nRated 5.0 out of 5,\nExcellent experience, clean and very professional! Will be back!\n\n",
        "Rocky Dog\n1 review\nRated 1.0 out of 5,\nVery bad service. No really good. I regert one time there. Waste money\n\n",
        "Eugene Chua\n6 reviews·8 photos\nRated 5.0 out of 5,\nVery good massage by David. Definitely will come again.\n\n",
        "Teknews BD\n3 reviews·8 photos\nRated 3.0 out of 5,\nWhat a nice place it is\n\n",
        "Visada Optimistas\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Mean Lian Loh\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Chester Chuang\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Robert Frost\n4 reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6334 4525\">6334 4525</span>",
    "Website": "http://www.themaletherapist.com/"
}