{
    "Name": "Tree House Spa",
    "Products": null,
    "Address": "238 River Valley Rd, Singapore 238296",
    "Opening Hours": "Saturday 10am–10:30pm\nSunday 10am–10:30pm\nMonday 10am–10:30pm\nTuesday 10am–10:30pm\nWednesday 10am–10:30pm\nThursday 10am–10:30pm\nFriday 10am–10:30pm\nSuggest new hours",
    "Rating": "4.7\n85 reviews",
    "Reviews": [
        "Al\n1 review\nRated 5.0 out of 5,\nI always receive very good and consistently strong massages by the therapists here.  I first started coming for one hour massages but found it was a bit rushed and they could only focus on my back.  I now come for the 90 minute or 120 minute massage and now get a great relaxing massage, and feel completely refreshed afterwards.  Excellent place to enjoy a quality massage at a reasonable price.  Recommended for everyone…they also have a room for couples and I have come here together with my spouse as well.\n\n",
        "Kavita Devi\n9 reviews·1 photo\nRated 1.0 out of 5,\nProbably one of the worst massages I have had. The masseuse didn't speak English - which is the norm for cheap massage places because owners value profits over service to non-chinese in Singapore (but I will not expound on the hypocrisy of this in my supposedly harmonious racially diverse country), but that aside, the masseuse either did not use enough pressure or too much, with no in-between.  She also massaged my face with her bare hands, which demonstrates poor hygiene. Most professional places use towels placed over their customers' head and face. I had to tell the masseuse to stop touching my face. She then proceeded to 'massage' my head, but she spent most of her time scratching my scalp. This totally grossed me out and I ended the massage at that point.\n\nThere is also an inappropriate lack of privacy (see attached photo) . Anyone walking by your cubicle will be able to see you changing or getting massaged thanks to the clear glass panel in the door!\n\nSkip this place. You're better off paying a bit more for a more enjoyable, and professional experience\n\n",
        "Mani\nLocal Guide·116 reviews·63 photos\nRated 5.0 out of 5,\nWarm service, great massage at a reasonable price. Had the 90 mins deep tissue massage and enjoyed it and walked away refreshed.\n\n",
        "Al\n1 review\nRated 5.0 out of 5,\nI always receive very good and consistently strong massages by the therapists here.  I first started coming for one hour massages but found it was a bit rushed and they could only focus on my back.  I now come for the 90 minute or 120 minute massage and now get a great relaxing massage, and feel completely refreshed afterwards.  Excellent place to enjoy a quality massage at a reasonable price.  Recommended for everyone…they also have a room for couples and I have come here together with my spouse as well.\n\n",
        "Kavita Devi\n9 reviews·1 photo\nRated 1.0 out of 5,\nProbably one of the worst massages I have had. The masseuse didn't speak English - which is the norm for cheap massage places because owners value profits over service to non-chinese in Singapore (but I will not expound on the hypocrisy of this in my supposedly harmonious racially diverse country), but that aside, the masseuse either did not use enough pressure or too much, with no in-between.  She also massaged my face with her bare hands, which demonstrates poor hygiene. Most professional places use towels placed over their customers' head and face. I had to tell the masseuse to stop touching my face. She then proceeded to 'massage' my head, but she spent most of her time scratching my scalp. This totally grossed me out and I ended the massage at that point.\n\nThere is also an inappropriate lack of privacy (see attached photo) . Anyone walking by your cubicle will be able to see you changing or getting massaged thanks to the clear glass panel in the door!\n\nSkip this place. You're better off paying a bit more for a more enjoyable, and professional experience\n\n",
        "Mani\nLocal Guide·116 reviews·63 photos\nRated 5.0 out of 5,\nWarm service, great massage at a reasonable price. Had the 90 mins deep tissue massage and enjoyed it and walked away refreshed.\n\n",
        "Truong Nguyen\nLocal Guide·5 reviews·79 photos\nRated 5.0 out of 5,\nGood massage. Highly recommended. Price is reasonable. Will be back definitely!\n\n",
        "Elaine Zhang\n4 reviews\nRated 5.0 out of 5,\nI had a massage at Tree House Spa last weekend. The staff was very friendly and caring, the service was very professional and the environment was very clean, comfortable and quiet. Highly recommended!\n\n",
        "Joanne W.\n4 reviews·4 photos\nRated 4.0 out of 5,\nThe place was supposed to close at 10.30pm but we reached at 9.50pm and they were able to accommodate us for a 1-hr massage! Ladies did a great job. They were considerate to let us rest as much as we can. Was in my pants and was offered to change into disposable shorts too. Will visit again!\n\n",
        "D L\n41 reviews·23 photos\nRated 1.0 out of 5,\nIf you are looking for privacy - THIS IS NOT THE PLACE FOR YOU.\nHad very weird expirence which the messeur kept the door of the room half open.\nI've never been in a place which someone can pass by and see you easily during a massage.\nVery creepy and strange. I hope they will change  it for future customers.\n\n",
        "Jens Boegh-Nielsen\n2 reviews\nRated 5.0 out of 5,\nVery professional service. My shoulder pain and my back pain that I have had for 10+ years is almost completely gone. Jasmine is working wonders! Highly recommended.\n\n",
        "Fiona RQL\nLocal Guide·38 reviews·130 photos\nRated 5.0 out of 5,\nBeen there 1st time with my partner. Quite professional massage. The 60-minute oil massage was effective for our muscle pain relief. We would love to visit again.\n\n",
        "Ben Rush\nLocal Guide·27 reviews·7 photos\nRated 5.0 out of 5,\nNearby to where we live and work, so this is a convenient pop-in massage place when I suffer from tension headaches. The most important things for any massage parlour (to me anyway) is cleanliness and quality of massage. Tree House Spa ticks both of these boxes, its clean, and the massage is consistently good. I have been going here on and off for nearly 2 years now and would recommend it to others.\n\n",
        "Thara Amerin\nLocal Guide·66 reviews·181 photos\nRated 5.0 out of 5,\nCame across this place for an early night massage. My partner and I ordered a couples room, which we got with no problems. Staff were great and the massages were perfect and just what we needed. The facilities might seem a bit dated compared to high-end type places but price was much cheaper than most of the local spots around the Orchard Rd area (where we were staying). Good value for money.\n\n",
        "Alice Zou\nLocal Guide·21 reviews·20 photos\nRated 5.0 out of 5,\nThe BEST massage place in Singapore for only S$ 50 for FULL 60 mins. The rooms are clean, the massage beds and towels smell fresh and they also offer couple room. I have been a regular for just over a year now, I love how professional the ladies are. They are super experienced and knowledgable, I often go there with different complains, such as tension related headaches, shoulder aches from caring my baby or aching muscles from exercising. They would always know what to do to target those troubled areas. Excellent services!\n\n",
        "Feoh F\n10 reviews·1 photo\nRated 5.0 out of 5,\nVery good place. Came here spontaneous, cause of a pain in the neck. Had a 60 min Massage. It is a strong massage, but my back is so tensed that it desperately needed to be smoothed from tissue to top.\nFor sure I will have some muscle ache the coming days, but the tense already feels much better!\nWill come back!\n\n",
        "Tay John\nLocal Guide·41 reviews·48 photos\nRated 5.0 out of 5,\nVisited few times, I continued to enjoy the outstanding massages from different masseuse of this spa. Some maybe slightly better than others, but all rated 4 to 5 stars. Serious and genuine, most of them came with experience and knowledge in Chinese tui-na (推拿), so when combine with aromatheraphatic, the massage became fantastic. Especially the focusing on my back lower spine was excellent, erasing all pain and tiredness... the place may not be lavish, but clean and neat, and all rooms with attached bath. Most important is the price... very reasonable.\n\n",
        "Laura\n11 reviews·3 photos\nRated 1.0 out of 5,\nBooked a massage at 11.00am for this afternoon. Called 25mins before massage is due to say they can no longer do it as another customer extended their booking and to change the booking to Saturday. Poor service.\n\n",
        "Shaleyna Santiago\n3 reviews\nRated 5.0 out of 5,\ni did upper back for 30 mins with Tina today, Aug 2019. She knew i had tensed shoulder without me telling her and she did her best to loosen the tension in the muscles. Within that 30 mins i went in and out of sleep without me realizing. The best massage I've ever had in my 29 years in this planet. do look for her if you are visiting. I am not sure about others but she will be my go to person anytime. Thanks Tina!!\n\n",
        "SELENE CHANG\n9 reviews\nRated 1.0 out of 5,\nI’ve tried many times but the owner always talked so loud and nonstop, you could hear her even in the massage room. I need peace and tranquility, not women nagging. Natureland is way more classy.\n\n",
        "Yane Tay\n2 reviews·15 photos\nRated 5.0 out of 5,\nVisited this new spa along River Valley Road next to Oxley Edge/ opposite Aspen Heights a few times, probably the best around this area. Young and cheerful genuine experienced masseuse leading you into clean and cosy rooms with soft music, all with attached bath. Appreciate their efforts to keep the place organized and well lit. Importantly the masseuse is never rushing for time, even with a bit of overrun.\n\n",
        "Karine Hoi\n1 review\nRated 5.0 out of 5,\nwent an extra mile with great service.\nmassage is pretty good too! will definitely visit again.\n\n",
        "Béchir HELLAL\n2 reviews\nRated 5.0 out of 5,\nAmazing team. Clear, 5 stars service. Thank you all the team\n\n",
        "Shirley Ching\n1 review\nRated 5.0 out of 5,\nThe staff of Tree house spa is a very professional and  well train establishment . The shop is clean n hygienic with fresh towel n quality massage oil. Definitely coming back.\n\n",
        "SS Tan\nLocal Guide·463 reviews·1,356 photos\nRated 5.0 out of 5,\nThe leg massage was good and professional.\nValue for money as compared to other similar establishments.\nThe place was well renovated and clean.\n\n",
        "Joe Kiat Chong\n2 reviews\nRated 5.0 out of 5,\nGood clean massage at this joint compared to other spa in the area. Well recommended as the staff are all well trained!\n\n",
        "Sreekanth Reloaded\nLocal Guide·149 reviews·122 photos\nRated 5.0 out of 5,\nMy favourite spa in Singapore! They really take care of your body very happily 😍\n\n",
        "Yufang Wei\n1 review\nRated 5.0 out of 5,\nThis is a very formal massage parlors, massage professional formal, technical approach is good. Please do not believe in the slander of some people. I feel very formal.\n\n",
        "LZY\nLocal Guide·118 reviews\nRated 5.0 out of 5,\nVery skilled massage therapists. body is much more relaxed now.\n\n",
        "Mel Chua\n9 reviews\nRated 5.0 out of 5,\nReasonably priced and really superb massages! Mostly mandarin speaking and very service oriented.\n\n",
        "Lim Kim Liang\n1 review\nRated 5.0 out of 5,\nGood costumes service clean environment lady is friendly to chat with most importantly they are very skilled in massage.\n\n",
        "Sandy Soh\n4 reviews·9 photos\nRated 5.0 out of 5,\nGreat service, massage is not bad too\n\n",
        "James Z\n3 reviews\nRated 5.0 out of 5,\nProfessional service, nice talking with their boss, will come again.\n\n",
        "Mike Chia\nLocal Guide·49 reviews·341 photos\nRated 5.0 out of 5,\nA highly recommended TCM treatment place for anyone who needed to relieve those stiff joints & muscles. 加油 💪😊👍👍👍\n\n",
        "Yan Tong\n1 review\nRated 5.0 out of 5,\nGood massage technique and attitude. I'll come again\n\n",
        "Karl Smith\n1 review\nRated 5.0 out of 5,\nGreat service and friendly staffs, highly recommended!\n\n",
        "wsylovezx\n1 review\nRated 5.0 out of 5,\ncomforting and relaxing, highly recommended\n\n",
        "adam gerber\n3 reviews\nRated 5.0 out of 5,\nVery professional and and very effective.\n\n",
        "Jonathan Chan\nLocal Guide·66 reviews·35 photos\nRated 5.0 out of 5,\nGood and professional massage.\n\n",
        "Jfsdjts Gjdjd\n1 review\nRated 5.0 out of 5,\nMassage the attitude of a good Massage better!\n\n",
        "Max G G\n1 review\nRated 2.0 out of 5,\nBad\n\n",
        "siong lim\n1 review\nRated 1.0 out of 5,\nBoss bad attitude....\n\n",
        "Yan Wang\n2 reviews\nRated 5.0 out of 5,\nGood Service\n\n",
        "A Bay\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Tree house spa is a gem in big city. I dropped by without expecting but it was made me chill and relaxed a lot. 40 SGD for one hour foot massage is reasonable but I guarantee the experience you get will be more than that price!\nIt passed by and happened to enter, but it was wider and beautiful than expected! The staff's skill was good, and I slowly pushed firmly one by one, and I fell into sleep immediately. It was good to receive the service more than the price!\n\n(Original)\nTree house spa is a gem in big city. I dropped by without expecting but it made me chill and relaxed a lot. 40 SGD for one hour foot massage is reasonable but I guarantee the experience you get will be more than that price!\n通りかかってたまたま入りましたが、予想以上に広くて綺麗でした！スタッフの技術がよくて、ゆっくりしっかりツボを一つ一つ押していて、すぐ眠りに落ちてしまいました。価格以上のサービスを受けれてよかったです！\n\n",
        "Akira F\n16 reviews·2 photos\nRated 5.0 out of 5,\n(Translated by Google) I visit here almost every weekend since I think here is the best massage place in Asia. They do finger pressured and oil treatment at the same time. Both ways are nice. And the massagers are well trained. You no need to digignate one. Doing Great. / I go every weekend. Because it's very good. With the combination of acupressure and oil, the oil is applied for a longer time, but it works pinpointly. The quality is good for all treatments.\n\n(Original)\nI visit here almost every weekend since I think here is the best massage place in Asia. They do finger pressured and oil treatment at the same time. Both ways are nice. And the massagers are well trained. You no need to digignate one. Doing Great.  / 毎週末行ってます。なぜなら、とても良いから。指圧とオイルのコンビネーションで、オイルのほうが時間的に長く当てられているけど、ピンポイントで効く。どの施術しにあたっても品質が良い。\n\n",
        "susu zhao\n1 review\nRated 5.0 out of 5,\n(Translated by Google) Hello @sam wong! I am YOYO, I don't know if you can read Chinese characters. I want to ask you one thing. When did you come to the tree house spa massage? Under what circumstances did I ask you that question? I asked myself if I haven't done these things. Because you were a comment made last week. And I also checked the registration in our store and didn't see your record. I am a regular massage. I want to work long hours instead of doing it. I will return to China in a few days. Because I can't talk, I rarely talk to guests when I work. In addition to asking if I want to add a clock, I haven't been very fluent in English for a long time. If it is not the boss, ask me. I still don't understand these. Or do you say that I am offending you, our store is a regular massage, or we will not be affirmed!\n\n(Original)\n@sam wong您好！我是YOYO不知道您能不能看的懂华语字，，我想问您一件事情，请问您是什么时候来tree house spa 按摩的？我是在什么情况下问您那个问题的？我自问没有做过这些事情.因为您是上周发的评论.而且我也查看了我们店里的登记没有看到您的记录，我都是规规矩矩的按摩我是要长期做工的不是做几天就回国的.因为我不会说话所以我做工的时候是很少和客人聊天.除了问要不要加钟，这么久了英文问加钟都不是很流利的.如果不是老板来问我我都还是不懂这些的.还是说我是在哪里得罪您，我们的店是老字号正规按摩的，要不然我们也不会被消协肯定！\n\n",
        "梁可馨\n1 review\nRated 5.0 out of 5,\n(Translated by Google) I like the environment very much, and the massage staff are also very good. Some parts are very painful and then uncomfortable. This is very comfortable to press, and the whole body is relaxed.\n\n(Original)\n很喜欢这边环境，按摩人员也很厉害，有些地方按到很痛然后很难受，这个按着很舒服，全身轻松\n\n",
        "张多多\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) The technique is very professional, the formal massage is refreshing\n\n(Original)\n手法很专业 正规按摩 身心舒畅\n\n",
        "hongxiafr zheng\n1 review\nRated 5.0 out of 5,\n👍👍👍👍👍\n\n",
        "Kelly Ke\nLocal Guide·1 review·8 photos\nRated 5.0 out of 5,\n\n\n",
        "boris yeo\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Fei Gao\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "BK Tan\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Dan Yu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Chee Chin Tan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Lilian Liu\n1 review·9 photos\nRated 5.0 out of 5,\n\n\n",
        "chengfei qiu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Samantha Y\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Cui Yali\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Tao Xu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ds Yeo\n1 review\nRated 5.0 out of 5,\n\n\n",
        "张美华\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Bing Hu\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "qian chen\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Carlos Quimson\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Mingdan Cai\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Chun Seng Lim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Haha Haha\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "DIXUN DAI\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jasmine\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Deying Zhang\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Richard Chiam\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "XQ Liu\n9 reviews·11 photos\nRated 5.0 out of 5,\n\n\n",
        "T Kimura\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "岳爽\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "amanda\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "蔡帆\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Enona Pandit\nLocal Guide·53 reviews·48 photos\nRated 5.0 out of 5,\n\n\n",
        "chee weng\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Qadilah Nisha\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Lin lin\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Wanghong Kan\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "任艳敏\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "regan wan\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "kingston lim\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "郑Amy\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "lanlan zou\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "LI LI\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6235 6233\">6235 6233</span>",
    "Website": "https://treehousespa.com.sg/"
}