{
    "Name": "Urban Spa",
    "Products": null,
    "Address": "5 Coleman Street, Peninsula.Excelsior Hotel #03-09, Excelsior Shopping Centre, 179805",
    "Opening Hours": "Saturday 10am–9:30pm\nSunday 10am–9:30pm\nMonday 10am–9:30pm\nTuesday 10am–9:30pm\nWednesday 10am–9:30pm\nThursday 10am–9:30pm\nFriday 10am–9:30pm\nUpdated by business 7 days ago\nSuggest new hours",
    "Rating": "4.8\n152 reviews",
    "Reviews": [
        "L P\n12 reviews·4 photos\nRated 5.0 out of 5,\nWhere shall I start? Jenny’s (the owner) hospitality is second to none other. She not only provides a service based on your needs but also provides guidance and food the soul in wisdom, kindness and recommendations. I chose Urban Spa based on the reviews and I am not disappointed. Coco was my therapist. She was very attentive, applied the perfect amount of pressure and spent an excellent amount of time on my most tense areas. They even offered me ginger tea, dessert and water after the treatment. If you are ever in the area I highly recommend Urban Spa. Thank you ladies!!!\n\n",
        "Lim Ferlyna\n1 review\nRated 5.0 out of 5,\nI love how everything was explained nicely to us before the start of our massage. From the types of massages they offered to the smell of the essential oils and scrubs. Got to give it to my massuer Winter for being attentive and gentle yet strength applied on point at the same time (told them beforehand that my pain tolerance is very low).\nMostly importantly, no hard selling at all. Smart move because they know that customers will be back again if they are satisfied with their service.\nWent on Christmas day and they even had a small deco in the couple room to welcome us! Thank you lady boss Jenny and team for the warm hospitality :)\n\n",
        "Grace Teo\n2 reviews\nRated 5.0 out of 5,\nI have been here for a massage a few times. Each time was with a different person but each time was a great experience. A few days ago I went again and meet Jenny. She was super accommodating and attentive. Skin felt great after. Highly recommend\n\n",
        "L P\n12 reviews·4 photos\nRated 5.0 out of 5,\nWhere shall I start? Jenny’s (the owner) hospitality is second to none other. She not only provides a service based on your needs but also provides guidance and food the soul in wisdom, kindness and recommendations. I chose Urban Spa based on the reviews and I am not disappointed. Coco was my therapist. She was very attentive, applied the perfect amount of pressure and spent an excellent amount of time on my most tense areas. They even offered me ginger tea, dessert and water after the treatment. If you are ever in the area I highly recommend Urban Spa. Thank you ladies!!!\n\n",
        "Lim Ferlyna\n1 review\nRated 5.0 out of 5,\nI love how everything was explained nicely to us before the start of our massage. From the types of massages they offered to the smell of the essential oils and scrubs. Got to give it to my massuer Winter for being attentive and gentle yet strength applied on point at the same time (told them beforehand that my pain tolerance is very low).\nMostly importantly, no hard selling at all. Smart move because they know that customers will be back again if they are satisfied with their service.\nWent on Christmas day and they even had a small deco in the couple room to welcome us! Thank you lady boss Jenny and team for the warm hospitality :)\n\n",
        "Grace Teo\n2 reviews\nRated 5.0 out of 5,\nI have been here for a massage a few times. Each time was with a different person but each time was a great experience. A few days ago I went again and meet Jenny. She was super accommodating and attentive. Skin felt great after. Highly recommend\n\n",
        "Victor Lum\n3 reviews·3 photos\nRated 5.0 out of 5,\nCame by for a couple massage with my wife for her birthday and really enjoyed the session.\n- The team is very professional and hospitable. Jenny (the spa owner I believe) took the time to sit down with us and go through the various massage options including types of massage, focus areas, usage of oils. She even demonstrates the level of pressure which is very useful to help customers decide!\nAny administrative requirements (eg providing ID) were clearly explained which really showed professional due diligence.\nOur masseurs were Elva and Coco, who were very pleasant and responsive to our physical cues to ensure that our massage was a comfortable experience.\n- The interior/facilities may not be the most posh/up to date, however it's clear that there is a lot of pride in keeping the premises clean and well maintained. Blankets/towels all smelt fresh and I was very pleasantly surprised while using the male washroom, which was spotless.\n- Finally, what really ties it all together are all the little touches:\nThere was some cute decor done to celebrate my wife's birthday\nWarm water/hot ginger tea promptly served before/after the massage\nBeds are heated/warmed and the customer is always kept cosy with warm towels and blankets.\n\n",
        "Wendy Teh\n3 reviews·3 photos\nRated 5.0 out of 5,\nFirst time to explore body & foot massage at Urban .\nJenny is very patient & well explained to us with differences of massage available . She tried to understand our needs first and advise which one suit to us.\nCompliment to both therapist Elva & Coco . Very polite , and good communication . They always ensure the strength applied are comfortable to us.\nMe and my friend very impressed with the services and happy to return in future . Highly recommended .\n\n",
        "Lydia Ng\n4 reviews·5 photos\nRated 5.0 out of 5,\nBrought my grandma to this place for couple massage, consecutively for 2 days. Experience 4 different masseuse. They are all polite, each have their own unique techniques. We like them all, but it still depends alot on personal preference. Have to try to know. They also have a caring and friendly front desk lady boss, shared with us some important points about massage. Appreciate the time she spend on sharing her knowledge. Can feel her love for people and passion for massage    Will definitely come back again. Thank you ❤\n\n",
        "Emily Fang\n6 reviews·7 photos\nRated 5.0 out of 5,\nMy new favorite place for foot massages! I’m on my feet a lot, whether it’s running or walking around Singapore. I’ve been feeling tired lately and went to Urban Spa for a massage—they have great ratings online and I decided to give it a chance. Im glad I did bc the service is A+. It’s clean, professional, and has great customer service. I was greeted with ginger tea and later ended the massage with green bean soup and hot water. I feel like it’s the little things that really matter when it comes to my customer loyalty, which they’ve won. Jenny and Coco are great in their service and I’m definitely recommending them to my friends!!\n\n",
        "Xueyin Peh\n3 reviews·1 photo\nRated 5.0 out of 5,\nIt was a very positive experience! The environment is clean and comfortable. Staff are professional, friendly and their price is reasonable as well. Urban Spa went an extra mile to surprise us for our anniversary. :)\n\n",
        "Anant Damle\nLocal Guide·137 reviews·224 photos\nRated 5.0 out of 5,\nCalled up last moment to get a foot massage as my regular joint was fully booked.\nThe team was quite warm when I called as well as when I arrived.\n\nThe massage therapist Elva performed a relaxing foot reflexology, the pressure was balanced.\nOverall quite a good experience, I will return for sure.\n\n",
        "Janet Tan\n4 reviews·4 photos\nRated 5.0 out of 5,\nExcellent service and good massage. The pressure was good and consistent! Definitely will recommend to my friends and family :) birthday surprise decoration was catered too! Thank you for the hospitality!\n\n",
        "Kwa Jimmy\n3 reviews\nRated 5.0 out of 5,\nWas amazed by the service hospitality rendered. Specially thanks to Jenny for the detailed explanation on different types of massage. She has even shared with us with her experience on 養身之道, giving us a ‘home liked’ feeling.\nNot forgetting to mention on my masseur, Elva for her good quality massage.\n\n",
        "Farra Anuar\n1 review\nRated 5.0 out of 5,\nWe visited Urban Spa on 8th October 2021. It was our first time here and we had such a delightful experience. My partner and I were very happy with the massage and service. Jenny was super informative and really helpful. All the staffs were really friendly and nice. They set up the couple massage room with a special birthday occasion for my partner's birthday. It was really nice. We will definitely come back to this amazing spa! HIGHLY RECOMMENDED! =)\n\n",
        "Nur Ain\n3 reviews·1 photo\nRated 5.0 out of 5,\nWent here for my wedding anniversary last week with my husband. His first time going for spa retreat and he enjoyed it alot. The therapists was very nice and accommodating.  Looking forward to visit there again☺️\n\n",
        "Marimar Baluyut\n3 reviews\nRated 5.0 out of 5,\nI have booked at Urban Spa as a gift to my bestie for her birthday, Urban Spa even made a little surprise for her. The massage was perfect! The Elva was very attentive. They also don’t do hard sell after the session which is a major plus. Thank you so much! We will definitely come back! ☺️💕\n\n",
        "Tempest Tsukuri\n1 review\nRated 5.0 out of 5,\nOne of the better quality affordable ones I've been to! It's convenient to go to, spacious place and clean. Also can shower before AND after massage!\n\nPrices are reasonable but the best thing is no package, no hard sell BUT there's a loyalty program. After 5 normal price purchase, you get 3 free!!\n\n",
        "Ash\n6 reviews\nRated 5.0 out of 5,\nGreat service. Went here for a bday retreat with my partner. I was impressed with the top service provided. They even arranged a surprise couple room and decorated it with Birthday decorations.\nBefore the massage started, Jenny, explained the types of massage and services to us. No hard sell at all, very friendly and polite. Masseuse was professional, gentle and patient. For once i did not feel like it was “rushed”. Was also given an option to shower in room which was great to just fully relax and unwind. Overall great experience, prices are very affordable esp in town area. looking forward to be back.\n\n",
        "Norfarihin Mohd Noor\n1 review\nRated 5.0 out of 5,\nJenny took time to  communicate about the treatments i’ve selected & offers recommendations to change your treatments accordingly.\n\nEmphasis on communicating clearly to our masseuse on our preferences and needs during treatments.\n\nIt’s not a fancy spa but it’s clean & neat! I’m pleasantly surprised by my masseuse.  Coco was professional & experienced, allowing me  to relax & enjoy my treatments!\n\nWill return to try their onsen facility  & other treatments in future! 😘❤️\n\n",
        "james greene\n1 review\nRated 5.0 out of 5,\nJenny and the crew were great at Urban Spa. They were very welcoming and made me feel comfortable the second I got there. I spent over 3 hours there! Great massage and facial.\n\n",
        "Seanz Young\n8 reviews·3 photos\nRated 5.0 out of 5,\nFriendly staffs (Jenny, Coco & Elva) and knowledgable. Jenny is the one attended to us and explained about the different type of massage that suit what we needed and get feedback from us end of the massage.\nMassuer Coco & Elva are very polite, skillful and caring. They will always make sure u feel comfortable during massaging.\nOverall highly recommended.\n\n",
        "Astra One\n3 reviews\nRated 5.0 out of 5,\nOne of the most amazing experience I have encounter, both the staff and bosses are so friendly and helpful. It was my first time here and will definitely be back. The masseuse is very professional and skillful, providing the just right amount of strength and stroke. Highly recommended\n\n",
        "bekez 0220\n2 reviews\nRated 5.0 out of 5,\nA hidden  spa gem at Excelsior Shopping Centre. I found this place online and booked a 90mins message. The staff were professional, the place was clean and the service quality for great. The massage therapist ELVA was very polite and and provided very good massage for my tight muscles. Well recommended and will definitely visit again.\n\n",
        "Wen Di\n2 reviews\nRated 5.0 out of 5,\nThey showed their professionalism throughout the massage session and the ambience was great as well. Before a massage session is commenced, they will share and recommend what type of essential oil is good and what kind of scrub is best suit for individual.\n\n",
        "Alvin Voon\nLocal Guide·2 reviews·43 photos\nRated 5.0 out of 5,\nI have been visiting Urban Spa for a few years, and the quality has been consistently good. Jenny the boss and the therapists are always friendly and professional. The prices under the packages are very reasonable too. Highly recommended!\n\n",
        "shariffah dalila\n2 reviews\nRated 5.0 out of 5,\nwent here for my bf’s birthday and they made a small decoration as a surprise which was rlly nice! staffs were also rlly nice and attentive. communicated with us and wants to know if pressure is too hard or not enough. no hard-selling or anything so we both rlly enjoyed ourselves. would come back here again for another massage!\n\n",
        "shini segaran\n1 review\nRated 5.0 out of 5,\nMe and my mom definitely enjoyed our time/massage here. The therapists are very professional, friendly staff. I personally love the receptionist. She is kind and taught my mom some easy massages to do at home. Excellent hospitality. The place is clean and cozy. Highly recommended. We will come back again for sure.\n\n",
        "Celestine Lee\n5 reviews\nRated 5.0 out of 5,\nRelaxing massage with no selling except for a $10 top up for essential oils, didn't feel obligated to sign a package immediately. Booked the couple massage and was thrilled to find a shower in the room to wash off the massage oil, left the place feeling rejuvenated and fresh!\n\n",
        "hakasson\n3 reviews·1 photo\nRated 5.0 out of 5,\nIt was a pleasant first visit.\nJenny explained on the various types of messages, oil etc and also recommended the flow.\nProcess/actions were communicated very clearly at the start.\nWill return back for subsequent visits.\n\n",
        "Jiahui Cheong\n5 reviews·2 photos\nRated 5.0 out of 5,\nThe experience was great from start to finish. Staff were really thoughtful, even offering to decorate the room as it was my partner's birthday. The massage with Coco was amazing too. It was my second time doing a full body massage here, and I drifted off both times -- it was that relaxing. Unfortunately due to Covid, they weren't able to serve any drinks or dessert, but I will definitely come back again.\n\n",
        "Vasellia Subhash\n1 review\nRated 5.0 out of 5,\nThoroughly enjoyed my massage here! Spa owner, Jenny, was very hospitable and that in itself made the entire experience memorable. She found my friend and I slots for an hour's massage each, despite it being a busy Saturday night. She also proceeded to send me very precise photo directions to the spa. The spa is extremely clean and sanitary, with rooms that come with en-suite shower. The therapist who attended to me was very attentive to the pain points on my body. Quality is assured and I'll definitely be back for their other services!\n\n",
        "Rui yi\n7 reviews·3 photos\nRated 5.0 out of 5,\nMy bf and I had a comfortable massage in the couple room (thank you therapists Coco and Winter). Service was great, right from the booking to the massage to post-massage. Thank you Urban Spa :)\n\n",
        "Jonathan Tai\nLocal Guide·425 reviews·851 photos\nRated 5.0 out of 5,\nWe did the 90min couple massage (Aroma Relax Massage and Body Scrub). Massage was good and it was a very relaxing experience.\n\n",
        "Zainah Rosli\n2 reviews·1 photo\nRated 5.0 out of 5,\nThe staff were very helpful and friendly. The masseuses were very good and cared a lot for us (asking us if it’s too hard, if it hurts a lot). We felt very pampered and well taken care of. It felt like going to a 5 star resort spa. Location was very convenient and making an appointment was hassle-free. I feel very lucky to have discovered this place. Can’t wait to go back for more!\n\n",
        "Nicholas Teng\n1 review·1 photo\nRated 5.0 out of 5,\nBooked a couple massage package. Staff were friendly. Masseurs were skillful. Overall experience was relaxing\n\n",
        "Bridget Tianna\n7 reviews·1 photo\nRated 5.0 out of 5,\nUnlike many spas I've been which try to hard sell their packages, Urban Spa was truly a relaxing experience. The massage was comfortable and the ambience was tranquil. I went once with my husband and booked it again for my in-laws. Bonus is that they throw in free drinks and a dessert! Mine was a black glutinous rice dessert! Price is also very affordable.\n\n",
        "Desmond Dass\n2 reviews\nRated 5.0 out of 5,\nI always have a pleasant experience when I go for a massage at Urban Spa.\nThe room is neat, clean n comfortable.\n\nMiss Winter , the masseuse gives me a great\nrelaxing massage ( can fall asleep also)!\n\nMiss Hana, the spa's receptionist is very professional. There are texts from her to remind n confirm with me for my massage appointment.\n\nShe also patiently explained to me about the sauna , jacuzzi n dipping pool when I enquired about the cost, time n usage of the facilities.\n\nWhen paying for the massage , the staff are very careful n there is another senior person which makes sure all the money/card payment is done correctly n accurately.\nVery important this arrangement !\n\nAll in all , a very good experience in a professional place.\n\nIn future will try the sauna facilities.\n\nThanks dear ladies ✴️✴️✴️👍\n\n",
        "BIBI Totanee\n1 review\nRated 5.0 out of 5,\nMy husband and I tried the 90 Minutes Couple Swedish Massage and add on the scrub massage.The price is reasonable & transparent,no hidden cost.There are also a lot of varieties to choose from.The shop manager,Ms Jenny and her crew were very professional,patient and friendly to explain the msssage package to you.There is no hidden cost,credit package or hard sell.No matter,you are individuals,looking to relax or couple like us,you will surely have a value for money relaxation.Looking forward to my next trip,thank you Urban Spa for the warm hospitality.\n\n",
        "David Tay\n2 reviews\nRated 5.0 out of 5,\nWent for a massage treatment at Urban Spa on 9 November 2020 and I was really blown away by their fantastic service and warm hospitality from both staff and boss. From my booking to the actual consultation, the entire process with Urban Spa was hassle free. Their foot reflexology with back massage was very professional, extremely soothing and therapeutic. After a good massage, I was served with good ginger tea and local desserts such as green bean soup which is healthy and enriching. The spa facility is extremely clean and well maintained. As a first time customer, the promotion prices were very attractive and affordable. Special thanks and appreciation to Jenny who was very friendly, passionate and informative about various spa/massage knowledge. A very underrated spa I would say. There should be more hype and many people talking about it! Will definitely come back again with friends and family in the near future! Highly recommended. Keep up with the great services. Thank you :)\n\n",
        "Anna Yeo\n13 reviews·2 photos\nRated 4.0 out of 5,\nVery polite and service oriented spa but some aspects made me minus 1 star - kept rushing us to change and whether we wanna bathe after massage cos they were rushing to clear the room for the next couple... i think they shld have put more buffer time when scheduling guests. Also, my masseuse was inconsistent in pressure, oftentimes rubbing oil on my limbs many times... she didnt massage my Toes and Fingers too!!! While the other masseuse did it for my partner... so inconsistent. She tried to unknot some knots several times to no avail and finally pressed real hard and then moved on to other areas. Hmmm could have given slightly more effort there.\nFor the price I would say its okay. Comes with ginger tea and a chinese dessert at the end! $120 for 2 pax 1 hour. Good to try out! U may like it!\n\n",
        "JINNELLE Siew\n6 reviews\nRated 5.0 out of 5,\nVery professional. Love the massage.\nNo hard selling from them. Would totally  come back again. Thank you Urban Spa\n\n",
        "Huiyuan Zheng\nLocal Guide·3 reviews·46 photos\nRated 5.0 out of 5,\nCoco was my therapist and it was clear that she's very experienced. She could get to all those acupoints and the sore spots easily. The entire massage was relaxing with just the right amount of strength used. The receptionist was also personable and helpful. Such a hidden gem!\n\n",
        "Sherrey Ang\n1 review\nRated 5.0 out of 5,\nI love the place! Jenny were very friendly and patient to explain with me the whole process massage. Elva massage was professional. The most i like was they will always serve any dessert of the day to us after our massage was done. Definitely I will recommend this spa to everyone. No hard selling at all. Highly recommended!\n\n",
        "Lim Jacqueline\n3 reviews\nRated 5.0 out of 5,\nDouble thumbs up for all the staffs at Urban Spa for their great hospitality and friendliness. Love the cosy ambience and relaxing atmosphere at Urban Spa. Thanks Jenny & Hana for the arrangement of our massage appts for two of my friends and myself. Greatly appreciated for the birthday surprises for the two of us too. Enjoyed my 90mins massage by therapist CoCo. She is very experienced and I can feel that she's trying her best to meet my needs too. 👍🏻👍🏻👍🏻\nHighly recommended!!!\n\n",
        "feliza low\n1 review\nRated 5.0 out of 5,\nTruly a hidden gem in Singapore. I always had experiences exploring Singapore spas and this has the best customer service I ever encountered . The receptionist was extremely patient with the numerous phone calls I make and the staffs were all very welcoming when I arrived on short notice . The spa owner , Jenny was the highlight of my spa experience. She was very enthusiastic when getting to know me and informative on various massage knowledge . Moreover,  the masseuse was very professional and attentive to the pressure she was applying on me . Overall, I would say their foot reflexology with back massage was very relaxing and  therapeutic!\n\n",
        "Zul\n2 reviews\nRated 5.0 out of 5,\nA legitimate massage establishment located at the heart of Singapore! Impeccable service from Elva and Jenny!\n\n",
        "Zana Ahmad\n1 review\nRated 5.0 out of 5,\nThank you to Urban Spa. It was mine and hubby's 1st time there. It was a pleasant experience all the way from the reception counter staff Hana to our masseuse Coco and Elva. Massage was very good and the ambience was good. And thank you to Jenny for answering my inquiry. Will definitely come again.😁\n\n",
        "Katherine King\n2 reviews·5 photos\nRated 5.0 out of 5,\nWe had relaxing massage and can't wait to book for our next appointment. No hard selling.\n\n",
        "nurasyikin sazman\n1 review\nRated 5.0 out of 5,\nIts our first time to urban spa. And i’ve decided to celebrate my husband birthday by giving him a SPA treat. Urban SPA staff was so kind to decorate the couple room for us... it was a such great experience with them. My husband even enjoy the facilities like jacuzzi and sauna... thank u urban spa for the great and kind service given... definitely will come again for the 2nd time😊😊...\n\n",
        "Marcel Cybon\nLocal Guide·173 reviews·2,333 photos\nRated 5.0 out of 5,\nVery great place, a tiny bit hidden in an old mall attached to the Peninsula hotel, but easy to find actually near the back entrance of Funan mall. A super good Swedish massage we got this weekend at this clean and cozy place. The therapists are very professional, very friendly staff at the reception. Jenny provides outstanding booking service and interesting pricing. Highly to recommend. We will come back.\n\n",
        "Ru Ying, Janelle Ng\n6 reviews·2 photos\nRated 5.0 out of 5,\ncame here multiple times over the years, and every time the customer service and massage were excellent! prices are also v reasonable and no hard selling. they were also very kind to set up a mini bday decoration for my mum :) highly recommended!\n\n",
        "Sany D Poe\nLocal Guide·44 reviews·97 photos\nRated 3.0 out of 5,\nWent for the first time on the new year after our staycay. Quite impressive greetings and able to arrange suitable time. Also each customer will be given a piece of form and asked on requested focus area to concentrate on.\n\nThe foot massage was okay but not the best because regardless of informing them on the form that I prefer more focus on my calf, not much time were spent there. More time were spent on the feet itself. So, not sure if the information were passed down or customer need to say it again. Which would be redundant.\n\nCan't recall much about my body massage because I was too hung up on how my foot massage was.\n\nAlso were asked if I wanted dessert but I left without having it because it was not served. Meh.\n\nPlace has a smoking room while waiting for your turn.\n\nOverall, it's just okay. Not too sure if it's worth recommending though. Perhaps you might want to reiterate about what goes on the form.\n\n",
        "San San Cha\n5 reviews·1 photo\nRated 5.0 out of 5,\nBooked the promotion package, $90 for 60 mins body massage and 30mins foot massage, was worth it as the massage was so good by Coco and Elva. Added $38 for the spa facilities and it was so nice! Clean and staff was friendly. They even prepare a birthday deco for my friend too! Thats a surprise and thank you all of them for going the extra mile.\n\n",
        "Hanie Alkaff\n1 review\nRated 2.0 out of 5,\nWent to urban spa for the first time with my friend recently and the service was nice with welcome drink being served and friendly staff. We chose 90mins swedish massage and i can say that the massage was nice but rushing at the same time. We didn’t bother that much but thought of giving a feedback to them for improvement.\n\nA guy came and i assumed its their boss and we gave our feedback but it seems that he just didn’t want to listen to us and walked off just like that. It’s unacceptable to treat a customer rudely. Upset with the overall and definitely won’t comeback again\n\n",
        "veronique ng\n1 review\nRated 5.0 out of 5,\nHana was patient and professional to explain to me the difference between swiss massage and lympathic drainage massage & the different type of essential oils.\nMy therapist was skillful in her massge, the pressure she applied was just nice for me.\n\n",
        "Diwanand Davar\n1 review\nRated 5.0 out of 5,\nHad a great massage and the therapists were very obliging and considerate. Will definitely be back.\n\n",
        "Siti-Norshahida Selamat\n2 reviews\nRated 5.0 out of 5,\nMs Hana was the one attending to us upon arrival. She was polite when talking to us. Hubby and I enjoyed the Couple Aromatherapy massage. They were so sweet and did a customised birthday message for hubby. 😍\n\n",
        "Tio YeeJen\n9 reviews·1 photo\nRated 5.0 out of 5,\nLove the massage here! Tried 60 mins trial with Coco, it was very soothing and therapeutic. Added on for essential oil. They served drinks before and after the massage. With black glutinous rice and tangyuan!\n\n",
        "Warda Mohammed\n10 reviews·5 photos\nRated 5.0 out of 5,\nWe had a bacholerette reservation and they were so nice to accomodate us at the last minute during the second day of CNY! They even personalised our experience! We had a really good time and the massage was wonderful too! Great experience. Definitely going to come back.\n\n",
        "JolineJ Lim\n1 review\nRated 5.0 out of 5,\nThe service experience was top notch from the moment of booking. The therapist Elva was friendly, professional, skilled and respectful.\n\nDon’t let the run down building put you off, Urban Spa is worth the value.\n\n",
        "Gaeul Lee\n5 reviews\nRated 5.0 out of 5,\nSuper friendly staffs who always look for feedback to improve, even though it was a so great service! The lady who brought us in made us feel at home straightaway. Definitely want to comeback, and the price was very reasonable too.\n\n",
        "Dinie Jamz\nLocal Guide·83 reviews·42 photos\nRated 4.0 out of 5,\nIt was a good first experience. However, it would be great if they had followed through on the 'survey' 'questions' that were asked upon arrival. Mentioned a specific area that needed focusing but during massage, it wasn't followed through. At the end of massage, they offered dessert and drinks, opted for it, yet none was given so I just left. Lol\n\n",
        "Zing Yang\n2 reviews\nRated 5.0 out of 5,\nGreat attentive massage by Coco, nice strength with warm ginger tea served before and after the massage. Also love the dessert soup at the end - ours was red bean soup and it changes daily.\n\n",
        "Hannah Tan\n10 reviews·6 photos\nRated 5.0 out of 5,\nAmazing experience at this shop nestled in Excelsior Tower (make sure you pass BOTH the hotel and Excelsior Shopping Centre to get there; googlemaps has their info wrong). The place is in a old building but it has a nice spa ambience that is most importantly, kept pristine and in great condition. The staff are friendly and my therapist, Winter, was brilliant. She was professional, and meticulous as well as check up on me if the pressure was to my liking.\nThe cherry on top was that they don't incessantly try to sell you packages and disrupt your experience because they don't do packages! They work off a loyalty system where you buy your sessions as you visit and they reward you after a certain number of visits with more sessions. It's perfect for people like me who are trying to stop buying packages that I don't use enough. Will definitely come again!\n\n",
        "CLARICE CHIA\n1 review\nRated 5.0 out of 5,\nHad a very relaxing full body massage with a scrub. One of the best massage places in singapore I’ve been at. No hard selling at all... I wanted to get a package but they don’t even have one! What a gem of a place urban spa is. Highly recommended!  Very clean, massage was professional and well worth the money. Will be back to try the facial!\n\n",
        "Julia Wu\n1 review\nRated 5.0 out of 5,\nI am greatly satisfied with Judy’s massage. Very good service and the location is very convenient too. Lady boss Jenny even share her experiences as how to practise massage in daily life.   So happy to know her and look forward to go for massage again in the future.  Highly recommend Urban Spa to all my friends and relatives.  Thumbs Up and Keep Up please! 👍🏻\n\n",
        "Shanny\n2 reviews\nRated 5.0 out of 5,\nFirst time here to have our couple massage, the environment is very relaxing and we enjoy our session very well.  Was recommended by a friend to here, will definitely come again!!\n\n",
        "Eunice Thong\n5 reviews\nRated 5.0 out of 5,\nA fantastic experience at Urban Spa. This establishment is really well managed, the service was excellent, the premises was spotlessly clean and most of all, the massage technique was really good too! Didn’t expect to find such an awesome (and well-priced) spa in Singapore. This place is definitely my go-to for a good full body massage.\n\n",
        "Vida Rodriguez\n5 reviews\nRated 5.0 out of 5,\nMy friend and I thoroughly enjoyed the Swedish massage. Just what we needed after a long flight. Staff friendly and professional. Staff happy to cater to the  strength of massage technique requested. Will absolutely book in on our way back. Vida & Robin (Australia)  \n\n",
        "victorinawoon\n1 review\nRated 4.0 out of 5,\n1st time to this place after seeing the promotion available for couples. Great customer service by all the staffs. Had a wonderful overall experience especially with Ms Hanna ensuring that we are well taken care of.\n\n",
        "Georgi Georgiev\nLocal Guide·90 reviews·14 photos\nRated 5.0 out of 5,\nGreat spot. Has a cold bath and great sauna.\n\n",
        "R CA\nLocal Guide·73 reviews·25 photos\nRated 5.0 out of 5,\nFrom start to finish it was a wonderful experience. Warm greeting on entering by Jenny. We discussed which treatment might work best for me. After landing on the one, Judy did an amazing job. Highly recommend. I will be going back.\n\nClean, comfortable and professional.\n\n",
        "Eden Seah\nLocal Guide·23 reviews·97 photos\nRated 4.0 out of 5,\nEnjoyed the massage throughly with my wife. The staff are really kind and there's no hard selling. The pressure points were exact to relief the tension. The ambience can be improved. But I enjoyed it overall.\n\n",
        "Sachin Jawale\n6 reviews\nRated 5.0 out of 5,\nIt was one of the best massage experiences I had in last few years. The therepist \"Coco\" was aware of best of the massage points and that was relaxing my most of tired muscles. HIGHLY RECOMMENDED.\n\n",
        "Ramya Viswanathan\n1 review\nRated 1.0 out of 5,\nmost definitely the worse massage ever received. i went home feeling very oily all over. im sure the masseuse was even falling asleep while giving me a head \"massage\" which was nothing close to a massage she was petting my head. other than the back, no effort and strength was put into the legs, arms , head for sure. also, they did the back srub first instead of last. front counter very friendly and not pushy. but overall not even worth the $30 spent as fave voucher. i dont understand why there are so many good reviews here. and fave doesnt show the bad reviews..\n\n",
        "Ryan Tan\n3 reviews·1 photo\nRated 5.0 out of 5,\nI am a long term customer with them. They provide very good service. Beyond me expectations. Their bosses are also very kind and friendly. They will try to arrange to your request.\n\nReally recommend everyone to try....\n\n",
        "Zezex S\n1 review\nRated 5.0 out of 5,\nIst time came here.The staff & the hospitality were excellent.The massage were good & I luv the scrub.My husband & I were happy  with the service :) highly recommended!\n\n",
        "Min1920\n4 reviews\nRated 5.0 out of 5,\nHighly recommend for those who looking for a good quality kind of massage!! Worth for moneyy!! Thank you Ms Winter and Elva for the good skills and services!\n\n",
        "Marion Picard\n2 reviews\nRated 5.0 out of 5,\nGreat experience with a friendly and qualified staff! I will certainly go again!\n\n",
        "Goodold Wiseman\n6 reviews\nRated 5.0 out of 5,\nIts a nice place, it have what you need to relax. I got a good massage and facilities if you need them. The price to me,k its just affordable in such a location. Highly recommended booking in advance to get a good time.\n\n",
        "Dasha Nur\n1 review\nRated 5.0 out of 5,\nI love the place and the staff were very friendly and professional in their services... the most i like was they will always serve any dessert of the day to us after our massage was done. Definitely I will recommend this spa to everyone. Good Job!!!\n\n",
        "Will\nLocal Guide·123 reviews·18 photos\nRated 5.0 out of 5,\nFabulous service. From the time we entered the premises, the manager was friendly and informative. She recommended the different treatments available to our needs. The Ginger tea was refreshing. The massage we got was great.\n\n",
        "JJ XF\n2 reviews\nRated 5.0 out of 5,\nFantastic service! They serve you with tea and snacks before and after massage. Even provide you with shorts to change into if you are doing their foot reflexology. No hardselling at all. Nice and comfortable ambience.\n\n",
        "joe lim\n7 reviews\nRated 5.0 out of 5,\nCosy place.Served by Elva,very attentive and friendly.will definitely return for massage\n\n",
        "Aldeena Teh\n20 reviews·1 photo\nRated 5.0 out of 5,\nAttentive and excellent skill portrayed by masseur. Clean environment and good ambience,  friendly staff and owner,  even offered tips to my mum for home massage on fingers n knee cap\n\n",
        "Wee Pammie\n5 reviews\nRated 5.0 out of 5,\nIt’s clean and well organised spa. Very friendly environment. Great place for relaxation and will return again soon. 😊\n\n",
        "Grace Tan\nLocal Guide·48 reviews·112 photos\nRated 5.0 out of 5,\nDid hot stone massage and coco was good! No hardselling which I really appreciated. Clean and easily accessible\n\n",
        "Ruki yann\nLocal Guide·226 reviews·199 photos\nRated 3.0 out of 5,\nJust so so. CS at counter is very friendly. Massagers are not that professional nor awesome.\n\n",
        "Hsbs Nsnd\nLocal Guide·91 reviews·3,403 photos\nRated 5.0 out of 5,\nGood services, they have massage,  ipl for male and female, facial service they got beautician can do facial massage therapy and also do ipl together... very nice beautician skillful and will attend to your every need...tip is acceptable here after good service...\n\n",
        "Karina Nielsen\n17 reviews\nRated 5.0 out of 5,\nI had a 1hr foot massage and 15min shoulder massage from Groupon - was a really nice massage, the premises have a relaxed vibe, proper reclining chairs, the service was super friendly even as a Groupon customer!!!\n\n",
        "KellyJ F\n2 reviews\nRated 4.0 out of 5,\nGood service and the place is quite clean.\n\n",
        "Clara Cheong\n5 reviews\nRated 5.0 out of 5,\nDid a feet treatment and had a fantastic experience. Will return and recommend to others\n\n",
        "Cat T\nLocal Guide·193 reviews·442 photos\nRated 4.0 out of 5,\nClean and comfortable massage rooms. Good and experienced therapists, led by a cheerful manager.\n\n",
        "Min Si\nLocal Guide·54 reviews·41 photos\nRated 5.0 out of 5,\ngreat customer service and spa experience! the green bean soup dessert was also very delicious\n\n",
        "Fennie Tay\nLocal Guide·26 reviews·17 photos\nRated 5.0 out of 5,\nVery good service offering not only drinks but also dessert after massage. No hard selling of their packages\n\n",
        "Benny Ong\n12 reviews·9 photos\nRated 4.0 out of 5,\nGood 👍\n\n",
        "Serene Hu\nLocal Guide·52 reviews·32 photos\nRated 1.0 out of 5,\nI cannot believe there were several high ratings for this spa. It is the worst I have ever experienced in Singapore - terrible service and rude staff.\n\n",
        "Lian Mei L\nLocal Guide·216 reviews·335 photos\nRated 4.0 out of 5,\nClean and quiet place. Service staff was polite and professional. Went there on a promo which was pretty worth it. They seem to have some GSS sale going on right now too.\n\n",
        "Xue Wen Xuan\n3 reviews·3 photos\nRated 5.0 out of 5,\nGreat experience with great massage, ambience and helpful staff!!!\n\n",
        "Safuha Roslan\n3 reviews\nRated 5.0 out of 5,\nHana and therapist gave an excellent customer service.\n\n",
        "Kishore Rochey\nLocal Guide·110 reviews·75 photos\nRated 5.0 out of 5,\nGreat message. Owner was there. Was very friendly. Makes one feel very much like being at home. Nice atmosphere.\n\n",
        "Francis Kee\n1 review\nRated 5.0 out of 5,\nVery good massage and very clean place\n\n",
        "Eileen Ng\n2 reviews\nRated 5.0 out of 5,\nFriendly staff and good massage\n\n",
        "Robert Taylor\n4 reviews\nRated 5.0 out of 5,\nEverybody is friendly, caring, and attentive. I would consider it at the top for cleanliness and that is very important to me.\n\n",
        "Lin\n4 reviews\nRated 5.0 out of 5,\nGood environment, friendly and professional staffs. Good experience!\n\n",
        "Tan Jiajun\n3 reviews·1 photo\nRated 5.0 out of 5,\nDefinitely coming back here again!! Service was 💯\n\n",
        "Visha Rajoo\n1 review\nRated 5.0 out of 5,\nThank you urban spa. Feel good after the  massage. The staff ( coco ) who was assistance me on my back pain which I was suffering for a month ago. I feel relief and enjoyed with her massage. Definitely, Will come again .. thanks to Ms. Hana …More\n\n",
        "Junkai Zhang\n3 reviews\nRated 4.0 out of 5,\nMy therapist was very attentive to my needs throughout the session. She made sure I was comfortable with the pressure applied and even picked up my sudden itchiness at my foot and helped me to scratch so that I can be as relaxed as possible.\n\n",
        "Siddharth Singh\nLocal Guide·36 reviews·1 photo\nRated 5.0 out of 5,\nBrilliant foot massage and great service.\n\n",
        "Shernis Kweh\n1 review\nRated 5.0 out of 5,\nGreat service & nice staff.\n\n",
        "Lai KaiMing\nLocal Guide·34 reviews\nRated 5.0 out of 5,\nPeaceful ambience with professional and skilled therapists\n\n",
        "Kingsley Foo\nLocal Guide·106 reviews·558 photos\nRated 5.0 out of 5,\nNo hard pushing for package. Friendly staff.\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6337 6377\">6337 6377</span>",
    "Website": "http://www.urbanspa.sg/"
}