{
    "Name": "Wan Lin Healthcare Centre",
    "Products": null,
    "Address": "149 Rochor Road #02-07/13/14/15/16/17 Fu Lu Shou Complex, 188425",
    "Opening Hours": "Saturday 10:30am–9pm\nSunday 10:30am–9pm\nMonday 10:30am–9pm\nTuesday 10:30am–9pm\nWednesday 10:30am–9pm\nThursday 10:30am–9pm\nFriday 10:30am–9pm\nSuggest new hours",
    "Rating": "4.7\n129 reviews",
    "Reviews": [
        "Leon T.\n7 reviews·2 photos\nRated 5.0 out of 5,\nAuthentic and professional massage.\nThe masseur was really skillful and able to effectively relieve the tensions in my muscles, especially the tension knots around my neck and shoulders. Also, the environment was really clean and gives off a really relaxing and comfortable vibe.\n\nOverall, a truly enjoyable massage experience. Highly recommend!\n\n",
        "Sihui Loke\n2 reviews·4 photos\nRated 5.0 out of 5,\nAwesome massage experience at WanLin. I wear heels and go to the gym often and was experiencing aching on my soles. I also have stiff neck as a result of poor ergonomics during WFH.\n\nThe masseuse really eased the knots in my body. Appreciated the fact that the place was really easy to locate and environment is relaxing with lots of antiques as well.\n\nPlus point is that I can charge my phone there while I enjoy the foot massage.\n\nHighly recommended :) !\n\n",
        "Hui Ming Chiak\n3 reviews·7 photos\nRated 5.0 out of 5,\nI had a lot of muscle knots and stiffness in my back and shoulders which the masseuse was able to rub them out. Been to quite a few massage places before but many of them weren’t able to fully rub them out for me. For once, I didn’t even have to ask the masseuse to use strength and he was able to rub them out properly with the right amount of strength. He was able to isolate and pin point my affected areas without even telling him about it. Sadly, I didn't get his name as I had to rush off. Overall, I wasn't expecting anything but I think I’ve found my new go-to massage place now :) The service was great and the masseuse kept asking me if the strength was okay. 10/10 recommend\n\n",
        "Leon T.\n7 reviews·2 photos\nRated 5.0 out of 5,\nAuthentic and professional massage.\nThe masseur was really skillful and able to effectively relieve the tensions in my muscles, especially the tension knots around my neck and shoulders. Also, the environment was really clean and gives off a really relaxing and comfortable vibe.\n\nOverall, a truly enjoyable massage experience. Highly recommend!\n\n",
        "Sihui Loke\n2 reviews·4 photos\nRated 5.0 out of 5,\nAwesome massage experience at WanLin. I wear heels and go to the gym often and was experiencing aching on my soles. I also have stiff neck as a result of poor ergonomics during WFH.\n\nThe masseuse really eased the knots in my body. Appreciated the fact that the place was really easy to locate and environment is relaxing with lots of antiques as well.\n\nPlus point is that I can charge my phone there while I enjoy the foot massage.\n\nHighly recommended :) !\n\n",
        "Hui Ming Chiak\n3 reviews·7 photos\nRated 5.0 out of 5,\nI had a lot of muscle knots and stiffness in my back and shoulders which the masseuse was able to rub them out. Been to quite a few massage places before but many of them weren’t able to fully rub them out for me. For once, I didn’t even have to ask the masseuse to use strength and he was able to rub them out properly with the right amount of strength. He was able to isolate and pin point my affected areas without even telling him about it. Sadly, I didn't get his name as I had to rush off. Overall, I wasn't expecting anything but I think I’ve found my new go-to massage place now :) The service was great and the masseuse kept asking me if the strength was okay. 10/10 recommend\n\n",
        "Phyll Y.\nLocal Guide·354 reviews·54 photos\nRated 4.0 out of 5,\nWe did 40-min foot reflexology and 20-min shoulder + back massage with 2 female masseuses and it was amazing, relieving us of our feet, neck and shoulder aches. The environment is clean and comfortable too and I foresee returning for regular sessions. That said, my friend and I realised that our masseuses both appeared exhausted working through the evening, and one mentioned they didn't have time to go for proper meals that day. As much as I like the ease of having multiple time slots to book online, it'd be nice to see well-rested masseuses with sufficient break and meal times. Perhaps the management could look into improving the welfare of their masseuses. Happy workers, happy vibes for customers too.\n\n",
        "Alvin L (JustBringIt)\n2 reviews\nRated 5.0 out of 5,\nTook a 60min full body massage and was assigned a masseur. Masseur was knowledgeable, hands were strong, technique was good as well. Masseur focused more on my neck as I have a very stiff neck and shoulder. Will be back next time to focus on my lower back. Highly recommended!\n\n",
        "Jasmine Wong\n16 reviews·15 photos\nRated 5.0 out of 5,\nVery good masseur can be found here, had a 1 hour body massage with Lin. She is so good and experience, and helped to relieve for all the tension i believe i had in my muscles or whole body. She can literally pinpoint the areas that need more attention in after i mentioned the pains i had during massage. Had a very good sleep thereafter. Highly recommended. Thank you Lin =)\n\n",
        "Charlene Koh\nLocal Guide·12 reviews·7 photos\nRated 5.0 out of 5,\nMy go-to massage place. My mom is a regular here and was the one who introduced me to this joint after some of my bad experiences at some other local massage chains. I go to school nearby and came here one day after a horrible 4-hour headache that left me in agony throughout my entire lecture-filled day. A quick 1-hour session with a request for the auntie who did my massage to focus on my tense back and neck did MAGIC. I swear.\n\nI come here now with my bf who is a chef and on his feet all day, and he feels rejuvenated after a quick hour rubdown. I'd honestly give more stars if I could. Reasonable prices and skilled therapists and super convenient location as well.\n\n",
        "Mandi Cheung\nLocal Guide·11 reviews·6 photos\nRated 5.0 out of 5,\nOverall, I had a seamless experience! I also found the pricing to be very reasonable, shop was easy to locate as well.\n\nFirstly, I was received by the staff with a warm welcome! The environment was clean and comfortable. I had a 40min foot massage + 20min shoulder massage - my masseuse (Esther) was warm, skilled and adjusted pressure to my preference.\n\nThere’s just one part I felt could be improved, I had to walk on the mall’s floor barefoot after taking off my shoes, into the shop. Maybe some carpets/slippers could be placed at the entrance to enhance this experience. That would make everything perfect!\n\n",
        "Michelle Ho\n6 reviews\nRated 5.0 out of 5,\nDid a 40mins foot + 20mins shoulder massage today and its awesome!! I usually dont do foot massage as my pain tolerance is not that high. The masseur adjusted his pressure to my comfort and i even fell asleep! Will definitely come back again, thanks!\n\n",
        "Leon Chua\n1 review\nRated 5.0 out of 5,\nJackson is an excellent masseur. He is very dedicate and great at capturing the poins when i has my body message. Highly recommended.\n\n",
        "Kok Jacqueline\n27 reviews·35 photos\nRated 5.0 out of 5,\nMy friend n I went today . we had deep tissue massage. They are skillful. The price is economic. Recommended place to go for massage.\n\n",
        "Ruth Chong\n2 reviews\nRated 1.0 out of 5,\nWent for full body massage, told the masseuse I had neck and back injury before hence the muscles there were stiff. And told her to apply light pressure to these areas.\n\nAll went well with my back. She applied light pressure and loosened out the knots just fine.\n\nBut for my neck, she went crazy. The first thing she did was take one finger and jab it very hard into the back of my neck (the area between neck and head). The pain was intense. It radiated to the back of my eye and side of my head. The whole night, my neck, head and eye, were aching. Today is the 2nd day, and these areas are still painful. I hope she did not do lasting damage to any nerves.\n\nWhile she probably meant well, I think she needs to pay better attention to her customers needs. And learn how to massage properly instead of just jabbing really hard.\n\n",
        "Nicole Alano\n1 review·2 photos\nRated 5.0 out of 5,\nMy first time going for this kind of massage and it was really amazing.\nZi Co massaged me and I experienced the foot and shoulder massage which lasted for 1 hour.\nI have back pain and when I mentioned it to him, he was able to help me out and ease my muscle tension.\nI also saw there are a lot of foreign customers that came and they mentioned that they are regulars here when they come to Singapore.\n\nReally relaxing. Thank you!\n\n",
        "Wei Teck\n2 reviews\nRated 5.0 out of 5,\nHad a very pleasant experience over at Wan Lin. Masseuse was very friendly and good at his craft. The environment is very relaxing as well. You can change into their clothes so don’t worry about wearing long sleeve and jeans. Definitely will recommend if you’re looking for a good local massage place.\n\n",
        "Shanice (shaniceaneo)\n7 reviews·5 photos\nRated 5.0 out of 5,\nBooked in advance and did a 40 min foot massage and 20 min shoulder massage. The location was convenient and in town. I like how it is efficient, no waiting time and staffs are friendly. The masseuse asked me for my preference of the degree of pressure for the massage. Love it and will definitely recommend to my friends!\n\n",
        "bimbu chen\n4 reviews·3 photos\nRated 5.0 out of 5,\nWent there for a session on the 03 June 2019 at 1945hrs. Booking through the website was seamless and the massage store is clean and professional. I went for the package which consist of 40 minutes foot massage and 20 minutes shoulder massage. Jenny was my masseuse and she was very experienced and skilful with the blood circulation points (血道) which provided me with a very relaxing experience. Before the session, my leg felt extremely tensed and heavy but after the session, it felt more relaxed and “light”. Amazing experience here and the only thing that i regretted for the session is not opting for a longer session!\n\nThank you Wan Lin for the wonderful experience!\n\nCheers,\nShixin :)\n\n",
        "Jordan Chong\n4 reviews\nRated 5.0 out of 5,\nI had a 60-minute full body massage done by Tina. Her technique was really good, she pressed at all the right points and with just the right amount of strength. All my aches just disappeared afterwards. Honestly, it was better than most of the massages I have gotten in Thailand, especially in terms of technique. The ambiance was relaxing and the price is very affordable too! Would definitely go back for more. Tip for others is to book a slot on their website early because the place is usually quite packed.\n\n",
        "Choo Zhe Jun\n1 review·8 photos\nRated 5.0 out of 5,\nWan Lin has the best masseurs and masseuses in Singapore. I had a pleasant half-body massage session, where the masseuse knew where my hardened knots and pains are, and automatically massaged these parts more. She even explained the causes, and recommended some of the poor habits that resulted in body aches. I suggest this healthcare centre to everyone needing a massage, as my whole body relieved after my session!\n\n",
        "Jermane Tan\n4 reviews·2 photos\nRated 5.0 out of 5,\nWent there for a session on the 03 June 2019 at 1945hrs with my boyfriend after a long day at work where my body and legs are sore.\n\nI went for the package which consist of 40 minutes foot massage and 20 minutes shoulder massage together with my boyfriend and June was assigned to me. June was extremely patient and experienced while providing me with the massage and i appreciate her effort for constantly checking with me if the pressure applied was fine. The entire session was extremely soothing and relaxing and June was extremely great with the pressure points with my foot and shoulders. After the session, all the soreness was gone and i felt extremely relieved. The shop in general is very clean and well-equipped with entertainment facilities such as TVs and hot towels to clean your feet. I definitely will recommend you guys to come try it out after a long day of shopping at Bugis Street!\n\nThank you Wan Lin for the wonderful experience!\n\nWith love,\nJermane\n\n",
        "Jacky Poea\nLocal Guide·18 reviews·74 photos\nRated 5.0 out of 5,\nI had really bad muscle aches on my legs. Tried to search for foot massage around the vicinity and saw quite a number of good review. Decided to try and I was really amazed by the masseur's massage skill. Kenny really knows what he is doing and my legs feel so much better. 38 dollars for 60 mins. Reasonable price. Will definitely come back again when I need another fix for my legs. :)\n\n",
        "ABISHEK SURESH\n2 reviews\nRated 5.0 out of 5,\nEverything was excellent! The staff were very welcoming; the beds were soft; the masseuse (Jenny) was strong and pressed at all the right pressure points and even the payment was convenient since they accept paynow. It was a much needed massage after a stressful week at work. It really helped me to de-stress and relax my muscles. I got the full body massage for 60 minutes and it was surprisingly very affordable. I would highly recommend making a booking early especially if you have a particular masseuse in mind. It was very convenient to do the booking on my phone and I could even choose the masseuse I wanted. Jenny’s schedule can be quite packed so I suggest booking early.\n\n",
        "Tony Ma\n18 reviews\nRated 5.0 out of 5,\nBest massage in the city & I’ve tried many places here. Therapists actually understand what they’re doing and put in significant effort during the session. Love it\n\n",
        "Jolyn Chua\n2 reviews\nRated 5.0 out of 5,\nCame for a massage and booked online in advance with Max at 3pm for foot & shoulder massage.\n\nPlace is popular, constantly packed with customers and sat around for 10 minutes and only got in at 3:10pm.\n\nThe counter and massuers here all seem busy rushing with back to back schedules and were moving around for toilet breaks / short bites or preparing the place for massage.\n\nMassage was quite a painful experience, but definitely a therapeutic one. The Massuer put in efforts in massaging and is hardworking.\n\nPlace is well kept and furnished, with fresh towels.\n\nFor this price range in Singapore, it is a good place with great standards.\nHighly recommended! 👍\n\n",
        "Ida\n11 reviews·13 photos\nRated 5.0 out of 5,\nExcellent quality and value reflexology in a humble but clean and comfortable setting... Never had an issue getting a same day appointment in the day and early evening so far...\n\n",
        "Yi Ting Koh\n6 reviews·1 photo\nRated 5.0 out of 5,\nVisited this place due to the good Google reviews. Made a reservation and had Jenny for my full body massage and she was really impressive ! She knew exactly where are the spots that requires more attention. Kenny is really great too as bf was impressed with his strength and skills. Did have some communication blunder when me and my bf came for our booking, was assign to foot massage at first which confuses us. However, the issue was resolved after double checking with the Staffs. Improvement can be made to communications at the reception side  where customers can be provided with clearer instructions and asked for their reservation/preference of massage. Overall, the experience is great. No doubt would visit them again!\n\n",
        "andrew l\n2 reviews\nRated 1.0 out of 5,\nMost painful massage ever, i was clenching my teeth the whole time and i was done i couldn't stand up straight and my back hurt so bad\n\n",
        "Osh Kosh2\n3 reviews\nRated 1.0 out of 5,\n1st time here, came because of the high review rating. Total disappointment, wasted time and money. did 90 minutes foot massage. assigned an old uncle who is just wasting time touching and rubbing my skin with lotion, hardly using any bit of strength, wondering if he could even afford more strength to begin with. I didn't request for no oldie/younger upfront because i didn't expect they will assign such an old uncle who barely has any strength, will be very rude to reject when he is in front of me. repeated request for more strength also make me feel bad. i suggest you have to make request upfront no old uncle. if you are fine to be supportive and spend money, no issue or perhaps just donate. if you come with a need for massage just have to request no oldies.\n\n",
        "Jack Yiak\n32 reviews·2 photos\nRated 1.0 out of 5,\nWent for 30min upper body massage. Total waste of money, masseuse was untrained and had no idea what she was doing, no concept of what is muscle, tendon, bone etc, started putting her elbow on my kidneys are, i mean for what?! Just press with her elbows. Came once before and had a guy who was quite good. The problem is there is no consistency in training and technique. Won't go again, just not professional. p/s: It was yesterday (sunday) afternoon, I'd rather not name. Please train your staff and test them properly, there are also other complaints below, if you need to re-test your staff, please do.\n\n",
        "Vivian Ang\nLocal Guide·28 reviews\nRated 5.0 out of 5,\nReally enjoyed the foot and shoulder massage! My masseur was friendly, experienced and really strong. He made me feel very comfortable and so relieved after the massage. Despite being there during a non-peak period, there was still a lot of customers. So I think it is advisable to book an appointment before heading down! The masseur also customized the massage according to my body’s needs and reaction. Would definitely come back and recommend my friend!\n\n",
        "Bhagyashree L\n4 reviews\nRated 4.0 out of 5,\nHi\nThis was my first time getting reflexology done . Frankly, it was quite painful. I never expected the foot massage this way. But my masseur assured me that I'll feel better after massage. He (Sam) is quite experienced fellow and he's been doing it for quite some time.\nAfter completing the massage, my feet were feeling very light and numb.\nAs it was my first time, i can't compare it or  call it good or bad.\nThe ambience was good, the staff was friendly. I went without prior appointment. But there was no waiting period.\n\n",
        "Sean Sean\n22 reviews·90 photos\nRated 2.0 out of 5,\nVery bad first and probably only experience. With appointment, I have wait for 20min before a masseur is available. Instead of calling it fingerpresss massage, it's more appropriate to call elbow massage. For some reason, 80% of therapy, the masseur elbows you. Highly unpleasant.\n\n",
        "Celine Wong\n1 review\nRated 5.0 out of 5,\nreally pleasant experience at wan lin. went for the full body 45 minutes massage and the lady really hit the sore knots and really made me feel very comfortable and relaxed. she used just the right amount of strength to make me feel both more relieved but at the same time not too painful as well. i almost fell asleep towards the end as it was so comfortable. 10/10 would recommend the oil massage for ppl looking to get relieved and relax.\n\n",
        "Aaron Wong\n1 review\nRated 5.0 out of 5,\nNeeded a good massage after a long day at work.  Popped by at Wan Lin to give it a try,\n1st timer. Went for a 40min foot massage and 20min shoulder/back massage. Learnt a lot about my body as to why it hurts and which points are for which part of the body. Time to take good care of my body!  Good and experienced masseur whom explained to me each point he was massaging and what to watch out for like my diet etc. Good experience overall.\n\n",
        "Amelia Wong\n22 reviews·4 photos\nRated 5.0 out of 5,\nHas been going to few massage centres for my back pains but nothing worked until I visited Wan Lin Healthcare.\n\nThe staff were very friendly and my masseuse Jenny knows all the places to press with the right amount of strength.\n\nShe made sure to ask if I was okay and gave concern when I rubbed my head after the massaged assuming that I had an headache.\n\nLocation is convenient and price is definitely affordable and worth it.\nWill definitely come back !\n\n",
        "joycelene ying\n1 review\nRated 5.0 out of 5,\nWent for a 40min foot and 20min shoulder massage, like the ambience there, quite calm and clean. The strength was okay and they managed to hit the sore knots, staff were quite friendly! Affordable and would come again!:)\n\n",
        "nicnicxun\n8 reviews\nRated 5.0 out of 5,\nTried foot massage at wanlin today, it has been a totally new experience for me! The therapist his name is Wong he can be very quiet, start and end without telling you. However you can tell he is very experienced, he kept on asking me to relax my feet but I couldn’t as it was so painful. But nothing wrong with him I think my body as a lot of aches and problem that’s why causing the pain over the foot. Good try for today, thank you uncle wong but I don’t think I’m going to do foot massage anymore no matter which shop is that. Haha low pain tolerance.\n\n",
        "Eric Kwok\nLocal Guide·37 reviews·492 photos\nRated 2.0 out of 5,\nOrdered a 1.5 hours of massage. The first 1 hour was fine. Although it was a bit forceful, but I told the masseuse to be softer and the force was alright. At the last thirty minutes she just kept rubbing my neck and my face. The amount of force she pressed in my neck was almost the same force as she would applied on my leg. It was quite uncomfortable and she kept using the same rubbing technique on my neck over and over again. It felt very abrasive on the and I told her to massage other areas instead.\nOverall the massage is quite clean. The only problem is that it feels like it is just brute force pushing all over the body and lacks a little technique. Didn't feel too good afterwards.. a bit of shoulder pain for a few days after the massage.\n\n",
        "Wilson Teo\n2 reviews\nRated 5.0 out of 5,\nWent to Wan Lin to get a quick massage fix on a Sunday afternoon. Did a 45mins upper body massage without much expectations. But boy was I surprised at the level of knowledge my masseur know. After a few minutes my masseur knew exactly what was my problem due to me sitting and staring at the computer for long hours. My masseur had real strength which really helped me unknot all my tension on my shoulders and neck. She does check in on me regularly to ensure that I wasn’t in pain. Overall a really pleasant experience and would recommend them to anyone!\n\n",
        "Mark Azzopardi\nLocal Guide·174 reviews·1,297 photos\nRated 5.0 out of 5,\nPerfect! If you’re looking for something soothing or you need that professional remedial massage, this is the team for you!\n\nThe best massage I’ve had in Singapore at an affordable price range.\n\nThe team is fantastic and really listen to what you want and I always walk out satisfied. I have a shoulder and neck muscle always causing me hassle and they fix it every time.\n\n",
        "Lui Kang Wei\n7 reviews\nRated 5.0 out of 5,\nWow, best foot massage I ever experienced. My feet been aching for ages and one 30 mins massage helped relived years of pain. Highly recommende.\n\n",
        "L.J.\nLocal Guide·65 reviews·9 photos\nRated 5.0 out of 5,\nWent there twice for a quick fix as I was experiencing shoulder pains. First time I went, it was a male masseuse. Felt much better after. Second time I went, they assigned me another male masseuse, but because I'd opted for cupping of my back and shoulders, he asked me to change out of my clothing and after sensing I was not comfortable with it, he asked another lady to take over. The lady was good too, released the knots in my shoulders, though still in pain but I'm feeling a lot better compared to before the massage. Price is affordable considering the location.\n\n",
        "Michelle Tang\n6 reviews\nRated 5.0 out of 5,\nHad a great time here with the friendly masseuse! Came here for a foot and shoulder+neck massage. The masseuse could tell that I exercised often and she also pointed out stiffness in other parts of my body while massaging different parts of my feet. Location is convenient too, will definitely be back!\n\n",
        "Calvin Gwee\n5 reviews\nRated 5.0 out of 5,\nWent for a 45min full body massage, and it was a great relief to my constant neck and shoulder stiffness! You know whether a masseuse is good when he or she managed to knead into the exact point with the right pressure, strongly recommend Tina when you are there!\n\n",
        "Goh Kwee Shan\n3 reviews\nRated 5.0 out of 5,\nIvy and Ah Hao are both really good therapists. My parents are their regulars. They are very skillful and nice. I have also tried both their massage and honestly think their skills are one of the best I have tried.\n\n",
        "Stefanie Leong\n11 reviews·37 photos\nRated 5.0 out of 5,\nJust went to Wan Lin for a massage and must say that it's really good. Esther was the one who massaged for me and she was really profession and focused on pressing the right points. Felt so much better and probably one of the best massage places in SG – And value for money with the packages that they have! :)\n\nDid the 40min foot + 20min shoulders combi\n\n",
        "Stephanie Ler\n4 reviews·12 photos\nRated 5.0 out of 5,\nFirst time here, and I did the 45-minute upper body massage ($45) with Lily as my masseur. Was very impressed at how she was able to identify which areas are tight and focussed on lessening the knots there. Felt really relaxed after the session\n\n",
        "Grace Michella\n10 reviews·1 photo\nRated 5.0 out of 5,\nWent for a 45min full body massage, and it was a great relief to my constant neck and shoulder stiffness! The masseuse was good and the ambience is great for relaxing after a hectic week.\n\n",
        "Siti Nurbalkis\n7 reviews\nRated 5.0 out of 5,\nGot Sharon and Ivy for my mom and i. Experience was amazing. Hurts but was worth it. We were the only malay customers so attention was more on us. Appreciate that they went over the mile to go to a more isolated room for the leg massage cause my mom wears the hijab. Will defo go there again.\n\n",
        "Suzanne Ho\nLocal Guide·50 reviews·1 photo\nRated 4.0 out of 5,\nHad the 40 minute foot and 20 minute shoulder massage session and found it very good personally. The message therapist got the right points with the right pressure to relieve my aching muscles.\n\nThis place will suit you if you prefer remedial massages. If you’re after a western relaxation spa type treatment. This is not the place for you.\n\nThe price was pretty reasonable too. $45 SGD for 1 hour in total.\n\n",
        "Florence Leung\nLocal Guide·37 reviews·11 photos\nRated 5.0 out of 5,\nA pleasant surprise, fantastic masseuse (Sharon) was very experienced and had a healing touch. I enjoyed a 30 minute foot massage ($23) and 60 minute full body massage ($55) and both were excellent. Thank you!\n\n",
        "Samsudin Kamis\nLocal Guide·24 reviews·144 photos\nRated 5.0 out of 5,\nI will come to Wan Lin each time I visits Singapore for work or vacation. I have been to Wan Lin since 2001 when I used to work at Bugis and know the owner very well. It has best and affordable foot massage and you should always combo with body massage. It is painful but worth it since your leg will feel so much better.\n\n",
        "HweeYi Chang\n3 reviews·4 photos\nRated 5.0 out of 5,\nHad a pleasant massage + shoulder session. Staff knows where are the exact knots and pains and explained why i’m always having aches. It was indeed a relaxation and my whole body felt relieved after my session.\n\n",
        "Zahid Abbas\n1 review\nRated 5.0 out of 5,\nWow. This is traditional Chinese massage, which was just what I needed after a work shift. They are professional, friendly, and I walked out feeling like jello. Thanks for a great experience, if I ever find myself in the area again, I would definitely return, and recommend.\n\n",
        "JC\nLocal Guide·54 reviews·394 photos\nRated 5.0 out of 5,\n1st time here. Super Effective massage. Had a 40 mins foot and shoulder massage at $35. Worth every dollar.  My whole body feels so relaxed and loose now. Will come back again.\n\n",
        "Melissa Eisner\nLocal Guide·873 reviews·1,296 photos\nRated 5.0 out of 5,\nI mean ... Wow. I had Miss Ma as my reflexology person, and she was fantastic. A great 30 minute foot session and then a 10 minute shoulder massage. Go to this place and no other.\n\n",
        "Jenny Chung\n4 reviews\nRated 4.0 out of 5,\nI come here since it’s easy to book on the weekend and massage is decent but quite often I will still have to wait for over 15 minutes for a room or a masseuse even with the booking since they are quite busy. Foot massage here is better than body massage.\n\n",
        "Lance Ng\n2 reviews·1 photo\nRated 5.0 out of 5,\nSuper reliable. I can trust them to provide my feet with the relief they sorely need. They make the effort to create a nice, clean and comfortable place. Almost all of the therapists are good and one in particular; Ah Hao; has the best foot reflexology technique for my usual ailment. Keep it up.\n\n",
        "Kureesa DLN\n6 reviews\nRated 5.0 out of 5,\nI highly recommended Massuer (Ms.) Jenny, have force but its relaxing.. This is my first time to Wan Lin and Ill surely come back.. 🙂\n\n",
        "Terence\n45 reviews·16 photos\nRated 5.0 out of 5,\nFirst time to this place, clean ambience with  excellent massage skills from Kelvin. Tried 60mins foot massage and eventually add on 45mins half body massage.\n\n",
        "Woshi Yapyap\n3 reviews\nRated 4.0 out of 5,\nValued for money service.\n\nFoot and shoulder massage was excellent.\n\nHowever it will be good if a foot bath can be provided to customers,  instead of just wiping with a hot towel.\n\n",
        "Brandon Lock\n3 reviews\nRated 5.0 out of 5,\nI went there to get a full body massage and I got a much needed back relief. Masseurs are strong and really give you the full experience. Very value for money.\n\n",
        "Sam K\nLocal Guide·491 reviews·3,436 photos\nRated 5.0 out of 5,\nOne of the best and cheap and very good foot massage place in the city. Usually very crowded on weekend so try weekend for less people. the staff are very friendly and will try to accommodate your request. Still the best massage in the city\n\n",
        "Silvia The\n11 reviews\nRated 5.0 out of 5,\nAffordable rate plus best massage therapist, Jenny. recommended.\n\n",
        "_ ywe\n2 reviews\nRated 5.0 out of 5,\nmasseur is experienced and able to let me know what my pains represents etc. good massage, better than thai massage as they focus pressing the knots\n\n",
        "Dr Jeanel Goh\n5 reviews\nRated 5.0 out of 5,\nExcellent foot and shoulder massage at Wanlin, located conveniently at Fu Lu Shou complex. The area was clean, there was no waiting time, and the staff were professional in delivering their services. Had a great experience and very reasonably priced!\n\n",
        "Hock Tee Er\n2 reviews·1 photo\nRated 5.0 out of 5,\nThe strength applied is just nice. After the foot massage feel like floating in the air.My stiff shoulder become better. Highly recommend.\n\n",
        "jackson chen\n1 review\nRated 5.0 out of 5,\nService is nice always come every week for the foot reflexology n shoulder. 1st time came. Feel dam painful n the person said is my body parts rusty Liao. But after few times of trying. Feeling great n excellent service.\n\n",
        "Sharon Xiiao\n1 review\nRated 5.0 out of 5,\nRelaxing ambience, staffs are friendly and helpful, great services at reasonable price.\n\n",
        "ton katsu\n1 review\nRated 5.0 out of 5,\nThe service was quick so almost no waiting time and the masseur was really professional! Skilfully targeting all the pain points, leaving me with a satisfied and relaxing experience :-)))\n\n",
        "Jennifer Goh\n1 review\nRated 1.0 out of 5,\nNot willing to look into customers feedback, instead write untrue and nasty stuff about customer when feedback was given, instead of investigating the matter thoroughly. Protect its own employee and customer is the wrong party when feedback is given. Unprofessional and rude  counter staffs.\n\n",
        "Kelvin Leong\n7 reviews\nRated 5.0 out of 5,\nHad a fantastic foot reflexology session here. The therapist applied the correct pressure and was very precise with the application of it on my feet such that it made me feel very relaxed. Would like to go back again.\n\n",
        "Orangetree 17\n4 reviews·1 photo\nRated 5.0 out of 5,\nI did 1 hr foot massage today\nGood therapist and the sofa is comfortable\nWill go for body massage later\n\n",
        "Melissa Chan\n2 reviews\nRated 5.0 out of 5,\nThank you Google reviews for leading me to this place. Went in with a massively stiff neck and shoulder and the lady addressed all of the right pressure points with optimal amount of pressure. After just 30 mins half body ($35), my aches and tension were relieved !\n\n",
        "steven lim\n4 reviews·1 photo\nRated 5.0 out of 5,\nWill recommend all my friends and family to zenson\n\n",
        "Siti Nur Habibah\n2 reviews\nRated 5.0 out of 5,\nI’m amazed with their skilled staffs that shared with me the nerve points and the tension points on my body. Totally love their Foot & Shoulder Massage and I leave feeling relax and refreshed!\n\n",
        "young hyun kim\n14 reviews·13 photos\nRated 5.0 out of 5,\nReally good. I chose 40min foot+ 30 min upper body massages after a long flight. I could forget the flight fatigue. I definitely recommend here.\n\n",
        "Janessa Woon\n1 review\nRated 5.0 out of 5,\nOne of the best massages I’ve been too. The service was great and the massage was good as well. Would definitely visit again.\n\n",
        "Wayne Sim\nLocal Guide·68 reviews·100 photos\nRated 5.0 out of 5,\nVery reasonably priced massages. I have gone for 3 2-hour massages and the therapists have been consistently of high standard.\n\n",
        "B w\n2 reviews\nRated 5.0 out of 5,\nVery good massage place. Highly recommemded. Massage centres are clean and the masseuses are skillful and provides excellent service\n\n",
        "Nicholas Kok\n5 reviews·1 photo\nRated 5.0 out of 5,\nProfessional and friendly service provided by Wan Lin. Recommended!\n\n",
        "Amanda Yong\n2 reviews\nRated 5.0 out of 5,\nWas pleasantly surprised by the skills and techniques used by the masseurs here! Did a foot and shoulder massage and felt really refreshed afterwards!\n\n",
        "Koh Hong de\n2 reviews\nRated 5.0 out of 5,\nWill definitely return to Wan Lin to look for Zico (Masseur) again! Satisfied with the service they had provided earlier on!\n\n",
        "Shanel Yeo\n2 reviews\nRated 5.0 out of 5,\nVery good foot and shoulder massage. Felt really relaxed after the massage 👍🏻\n\n",
        "Khong Wei Ooi\nLocal Guide·82 reviews·36 photos\nRated 4.0 out of 5,\nCome few times and Ah hao is very good massager.\n\n",
        "Ann Christin\nLocal Guide·161 reviews·139 photos\nRated 5.0 out of 5,\nGreat service, good massages, clean environment.\n\n",
        "Eddie Z\n7 reviews\nRated 5.0 out of 5,\nBest massage i had in a long time, was in Singapore for holiday, looking forward to visit again on next trip\n\n",
        "Jaan M\nLocal Guide·17 reviews·2 photos\nRated 5.0 out of 5,\nVery relaxing, after 5 days doing more than 20k steps, foot massage was just so damn good. Thank you!\n\n",
        "Jermaine Lee\n4 reviews\nRated 5.0 out of 5,\nThe service was great, and it was convenient to get there too! I really enjoyed the foot and shoulders massage!\n\n",
        "Rebekka Fredrich\nLocal Guide·62 reviews·260 photos\nRated 5.0 out of 5,\nhad a 60min foot reflexogy. good price and professional staff. they knew what they are doing and could tell if there is a pain point where it comes from.\n\n",
        "tom papas\nLocal Guide·55 reviews·164 photos\nRated 5.0 out of 5,\nBest massage so far in singapore\n\n",
        "Chee Ho Yoon\n2 reviews\nRated 1.0 out of 5,\nI asked to crack my back and neck when I made a reservation. Massager didnt do anything. Never again!\n\n",
        "Mindy\nLocal Guide·23 reviews·18 photos\nRated 5.0 out of 5,\nMy favourite staple go-to-massage. Shouldn't be called Wan Lin should be 万岁\n\n",
        "mike c\nLocal Guide·58 reviews·12 photos\nRated 5.0 out of 5,\nVery good service. Ken was really on point and detailed.\n\n",
        "Jessie Jessie\n2 reviews\nRated 5.0 out of 5,\nI always find Pang for my foot massage ! 👍🏻👍🏻👍🏻👍🏻👍🏻\n\n",
        "Chin Keat Seng\nLocal Guide·61 reviews·57 photos\nRated 5.0 out of 5,\nMy always to-go center. Quality that you can trust.\n\n",
        "Sheralyn Aw\n61 reviews·14 photos\nRated 5.0 out of 5,\nMy favourite foot massage spot in the city\n\n",
        "stanley kan\n5 reviews·10 photos\nRated 5.0 out of 5,\nSlightly painful, but overall a good experience\n\n",
        "Alison Choo\n1 review\nRated 5.0 out of 5,\nFirst time trying after reading the reviews. I had a good massage.  My knots on my shoulder really loosen althought my body aches the next day. Will go back again.\n\n",
        "Bharat Patel\n3 reviews\nRated 5.0 out of 5,\nSuper massage and very professional\n\n",
        "Choong Kok Lee\n2 reviews·5 photos\nRated 5.0 out of 5,\nClean and comfortable settings. Went for 60 min back massage by Jackson. He has good technic and the amount of pressure is just right to relief stiffness and feeling relax at the same time.\n\n",
        "Andy Chen\nLocal Guide·82 reviews·351 photos\nRated 1.0 out of 5,\n(Translated by Google) I had a body massage for 2 hours. So bad experience that nothing massage skills, only power. It was hurt and uncomfortable.\nColleague recommended and booked in advance ⋯⋯More\n\n",
        "Khoo Yishao\n2 reviews·3 photos\nRated 5.0 out of 5,\n(Translated by Google) Been the Wan Lin massage months back, and really miss the massage there. Their masseurs are friendly and they can answer your queries regarding massage and wellness. Don’t worry to tell them to press harder if you …More\n\n",
        "도유정\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) I walked for a long time\nI visited! I got a foot massage for an hour, but my first love was so painful that my tears stinged. I asked you to kill me, but you didn't feel good. I thought …More\n\n",
        "정종숙\nLocal Guide·30 reviews·40 photos\nRated 4.0 out of 5,\n(Translated by Google) 10 minutes on shoulder + 30 minutes on foot Singapore $ 35, good massage, but not cheap. I am satisfied with the exhibition business trip! …More\n\n",
        "CookingNurseSeungseung Baek\n16 reviews·50 photos\nRated 5.0 out of 5,\n(Translated by Google) It was so good! Will visit again next time!\n\n(Original)\n너무 좋았음! 다음에 다시 방문예정!\n\n",
        "Kisara k\nLocal Guide·260 reviews·1,833 photos\nRated 4.0 out of 5,\n\n\n",
        "Meryn Kim\n18 reviews\nRated 5.0 out of 5,\n\n\n",
        "Alice Goh\n9 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Tan Wei Kee\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Mike Robinson\n13 reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6338 1355\">6338 1355</span>",
    "Website": "https://www.wanlinhealthcare.com/"
}