{
    "Name": "Wil Essentials Foot Reflexology & Body Massage",
    "Products": null,
    "Address": "#01-316 Elias Rd, Blk 625 Elias Mall, Singapore 510625",
    "Opening Hours": "Saturday 10am–10pm\nSunday 10am–10pm\nMonday 10am–10pm\nTuesday 10am–10pm\nWednesday 10am–10pm\nThursday 10am–10pm\nFriday 10am–10pm\nSuggest new hours",
    "Rating": "4.8\n106 reviews",
    "Reviews": [
        "jess yong\n1 review\nRated 5.0 out of 5,\nHad one hour full body massage. It was great and relaxing  . Staff are friendly and pleasant.\nOverall it is a great price for the service being offered !\n\n",
        "Richard Liew\n9 reviews\nRated 5.0 out of 5,\nI was having lower back pain and try a 1hrs massage.\n\nTo my surprise....i feel better and can walk without limping after 1 session.\n\nWill come back again.\n\nPricing is reasonable too\n\n",
        "Jacqueline Goh\n8 reviews·6 photos\nRated 5.0 out of 5,\nGood service provided! Massage on point. They have male & female masseurs so do state clearly when making booking.\n\n",
        "jess yong\n1 review\nRated 5.0 out of 5,\nHad one hour full body massage. It was great and relaxing  . Staff are friendly and pleasant.\nOverall it is a great price for the service being offered !\n\n",
        "Richard Liew\n9 reviews\nRated 5.0 out of 5,\nI was having lower back pain and try a 1hrs massage.\n\nTo my surprise....i feel better and can walk without limping after 1 session.\n\nWill come back again.\n\nPricing is reasonable too\n\n",
        "Jacqueline Goh\n8 reviews·6 photos\nRated 5.0 out of 5,\nGood service provided! Massage on point. They have male & female masseurs so do state clearly when making booking.\n\n",
        "Kum Peng Shian\nLocal Guide·14 reviews·6 photos\nRated 5.0 out of 5,\nAfter coming to Wil Essentials, I've never step foot on another massage parlour ever since. It is not for the lighthearted, you will feel the sore for days to come but come out rejuvenated. Each move pushes deep into your muscles. They also offer an affordable price compared to other places. Wil is the place of my choice as long as I am still staying nearby.\n\n",
        "Shawn lee\n1 review\nRated 1.0 out of 5,\nAfter the massage I feel very uncomfortable/pain and my soreness get worst. My head start to pain After I leave the place. This is the first time I encounter this After a massage.\n\n",
        "Mohammad Said Suib\n1 review\nRated 5.0 out of 5,\nHi,I am a regular customer with the Essential, once every weeks I'll turn up for my reflexiio or half body massage.\nTo my personal point of view the Masseuse's very expert & friendly.\n\nDo, sometime I am fatigue & exhausted after a hard work,and  throughout my masseuse for 1hrs,it really relief my pain & body ache.Thank you to all the Essential Masseuse.\n\n",
        "Tracy Lim\n1 review\nRated 5.0 out of 5,\nA good and clean place for massage. Every of the massage therapists are experienced. Price is reasonable too. Do try it out if u are near Elias mall, u won’t regret it!\n\n",
        "Ainur Othman\n2 reviews\nRated 5.0 out of 5,\nI have been to Wil Essentials Foot Reflexology and Body Massage several times now. The masseuses are competent and friendly. Service is always great there. Special thanks to Chiraporn\n\n",
        "Wensheng Tan\n6 reviews\nRated 5.0 out of 5,\nVery good and strong massage by Ah Tian (hopefully I got his name correct ), he is insanely strong and pressed perfect, definitely knows what he’s doing. Was abit sceptical to see 89 reviews and a average of 4.9 stars but wow having come here I’ve come to know why they deserve it. Place is very small and cozy but well lit. Prices are very good too and only con I can see is lack of a private room and oil massage which I understand due to the size of the place. However, masseuse skill is top notch. Definitely coming back again. Hope opening hours will extend pass 10 next time! 👍👍👍\n\n",
        "Willy Lim\n2 reviews·3 photos\nRated 5.0 out of 5,\nGood masseurs with skills & experiences. Good customer service. Quiet & peaceful ambiance. A great place to relax. Most importantly now they’re following strictly the covid safety measures, I feel safe while relaxing here 😀\n\n",
        "Kuan Ming Tan\nLocal Guide·31 reviews·208 photos\nRated 1.0 out of 5,\nNot comfortable, very pain, the worker non stop chatting through out the whole session. My muscle sore for few days after massage.\n\n",
        "Muhd Nasir Mohd Refunggi\n1 review\nRated 5.0 out of 5,\nOther place might just give you normal basic massage, but for wil essentials it gives you the best deep tissue, on point massage. Personaly i always go to chiraporn. Best of the best. My masseur for more than 10yrs.\n\n",
        "gavin L\n8 reviews·2 photos\nRated 5.0 out of 5,\nGoogled for massage near our home and the positive reviews really lived up to its name! Seems like we've found a real gem! My wife and I were really impressed by Alvin & Tian's massage. They were extremely meticulous in massaging out the knots and lymph nodes and we felt very light and good after the massage. Would definitely return!\n\n",
        "Sandra Keasberry\n1 review·1 photo\nRated 5.0 out of 5,\nFinally found a place for great foot reflexology in Pasir Ris. All the masseuse are experienced. Lady boss Sherry is also super friendly. Shop is clean and smells great.  My husband is very fussy about his massages, must be relaxing enough that he’s fallen asleep for the last 20 mins. Will try their body massages next.\n\n",
        "Yap Abby\n1 review\nRated 5.0 out of 5,\nI have a locked tendon muscle on my back and neck the masseuger very professional and helped me to clear the tendon makes it soft and flexible making my blood circulation cleared. I feel very relaxed healthy again.Satisfied and started to visit once to twice a month. Loved it !\n\n",
        "Jolene Quek\n4 reviews\nRated 5.0 out of 5,\nLocated at a small neighbourhood heartland mall, am impressed with the massage service provided.\nThe masseur was spot on with all my aching points and she even massaged the lymph nodes spots which alot of massage places do not do so.\nThe lady boss is very friendly and nice to speak to.\nThe price is very reasonable and very value for money!\nWill definitely be back to try other masseurs' touch.\n\n",
        "Eunice Tan\n36 reviews\nRated 3.0 out of 5,\nHad 1 hr body massage. Area looks small but it looks clean. Would suggest when the Masseuse doing massage, should not chat across with other Masseuse as it is kind of * noise* hazard for customer who comes for body relaxation. Overall the massage is on reasonable price.\n\n",
        "Stephanie Chua\n6 reviews\nRated 5.0 out of 5,\nSeriously hidden gem that is under rated to relieve your aching body! Genuine review from a paying customer. Was surprised at its cleanliness and professionalism of the staff there! Everyone was friendly and welcoming! Real value for $$ ❤️ highly recommend Ming for his professionalism!\n\n",
        "Jasmine Yap\n1 review\nRated 5.0 out of 5,\nVery good! The masseurs there are top notch, my pain and tension are always relieved every time I go down❣️    \n\n",
        "Neo Celine\n4 reviews\nRated 5.0 out of 5,\nSo glad I can have a good massage periodically near my place at Pasir Ris .... Am\nAlways looking forward to my sessions at Will Essentials Foot Reflexology & Body Massage. Nice & clean environment ... most importantly with their experienced masseuse/masseur !\n\n",
        "Kris Chua\n2 reviews\nRated 5.0 out of 5,\nFound this place using goggle map. I highly recommend it. Prices are reasonable and they do a good job! I always ask for Ms Pon. She's really good.\n\n",
        "iammummy\n3 reviews\nRated 5.0 out of 5,\nWe decided to have an impromptu massage and found Wil on Google. With such good reviews, we thought it's worth the try. And oh boy!... We were not dissapointed!\nAh Hui did my foot massage and my feet felt totally relieved. My hubby had a body massage and was praising Alvin all the way home. Lady boss was super friendly. Thank you Wil for an awesome experience! We'll definitely be back.\n\n",
        "NANA\n5 reviews\nRated 5.0 out of 5,\nBodyaching from head to toe. Decide to try Wil Essential after reading all the reviews. After a 2 hrs massage, i feel very light. Thank you Alvin for the wonderful massage! Will come again 👍👍👍\n\n",
        "evonchai\n1 review·1 photo\nRated 5.0 out of 5,\nThe service is super good. The massage master is really experienced. I’m very comfortable. I will come back wil essentials foot reflexogy @body massage\n\n",
        "Leslie\n1 review\nRated 5.0 out of 5,\nDidn't know my body was so stiff until I had a massage here! Staff was very friendly and professional. Felt relaxed after the whole session 😁\n\n",
        "Zee\n1 review\nRated 5.0 out of 5,\nHighly recommended! I randomly made an appt for 60min body massage and was surprised with the quality of their deep tissue massage. I slept so well that night and most importantly didnt suffer from post massage pain. I have been going there regularly eversince. The lady boss, Sherry is very friendly n helpful in setting up appt to suit my schedule.\n\n",
        "HC Sim\n8 reviews\nRated 5.0 out of 5,\nA total new experience. By far the best deep tissue massage I have had. Masseur was undoubtedly highly skillful and very knowledgeable. Understands my condition and needs.They made it a point to explain and also freely share their knowledge along the way. Appreciate that they are not pushy but instead encouraged to return for subsequent sessions only when I feel my body is ready. Worth the intense pain because I can feel the overall improvement in my total well-being after two sessions.\n\n",
        "Catherine Tan\n1 review·1 photo\nRated 5.0 out of 5,\nIt is a good try at Wil Essentials for the first time of foot massage with my husband.\n\nI like it!\n\nWith immediate, I booked body massage for the next day, and really another good experience before I back for work after CNY!\n\nWill be back again soon.\n\n",
        "Palatrick Koh\n5 reviews·1 photo\nRated 5.0 out of 5,\nThis is my first time going for foot reflexology in Singapore as the shop is very near my house,\nsince it’s newly open and also the price is very cheap. I gave it a try. The shop is very clean, leave your shoes outside and I like the how clean and tidy the floor is, it really makes me want to lay down on the floor. The ambience smells great, relaxing and brings up my mood. So I went for 30 mins Foot massage and the masseuse named “啊天” was indeed really very good at it. He knows how to use the correct amount of strength to press onto my feet and this is the first time I ever say “Shiok!” while stretching my leg after my 30 mins session. Lady boss Sherry was very friendly, humble, open minded and our conversation strucked me to stay longer to have a chat with her. To be honest, my own opinion is that I would prefer an open concept massage so we are able to socialise with the other customers and do random talks, it really feels great not just for your feet but also your mood. I went out happily, satisfied and I would definitely bring my whole family down to the outlet. It’s my first but won’t be my last. I will be trying their body massage soon and I will update the review again. Thank you Wil Essential for launching an outlet near my place. Don’t forget to leave a small tip for your masseuse, appreciate them.\n\n",
        "Faseha Haroon\n3 reviews·5 photos\nRated 5.0 out of 5,\nFound them on google and saw the good reviews and the reviews were right! Had a really good foot massage here with my husband. They really focus on the knots and pressure points. Will definitely come again next time!\n\n",
        "Siti Salha Simahil\n1 review\nRated 5.0 out of 5,\nThe massage was absolutely of the highest quality and the masseuse was very knowledgeable about her job and knew how to relieve the tension and aches in my body and leg. Truly felt a lot better after going for the full body and leg reflexology,  and would definitely visit again.\n\n",
        "Jammy Tee\n1 review·9 photos\nRated 5.0 out of 5,\nSeldom leave reviews but this massage parlour definitely deserves a good one. Hard to find such good masseuse in Singapore. They really massage deep into your muscles and acupuncture points. Help to ease your fatigue and improves your blood circulation flow. Really thumbs up.\n\n",
        "Wang Chen Fatt\n2 reviews\nRated 5.0 out of 5,\nFirst time go to this shop after recommended by my neighbors due to my headache. I was so surprised after first massage I received by a pretty chubby lady that works there my headache gone immediately. The shop environment was very good with aromatic scent, and all the workers was so friendly. The lady boss there was so busy serving all the customer who waiting to make sure they feel comfortable. Very happy 😊 with this place. Feel like coming home, no stress and all the workers skill was so good. Highly recommended.\n\n",
        "Jasmine Tan\n5 reviews\nRated 5.0 out of 5,\nA hidden gem! Excellent massage quality provided at very reasonable prices. Clean and calm environment. Definitely my go-to massage spot from now to a very long time :)\n\n",
        "Su Boey\n7 reviews\nRated 5.0 out of 5,\nFinally a neighbourhood massage place with standard! I had a foot reflexology last weekend. Masseur strength was just right. Not too painful and weak. Place looks clean, they'll sanitise the seat after each customer.\n\n",
        "Gi Gi Wen\nLocal Guide·17 reviews·1 photo\nRated 5.0 out of 5,\nTried the foot and shoulder and neck massage. Turned out it included  back massage also. The massuse was very skillful,  right to the points and cobsustwnt strength from start to end. Really good experience!\n\n",
        "Vel Loh\n2 reviews\nRated 5.0 out of 5,\nThe shop is neat n clean. Enjoyed my massage service by Ms Pon.\n\n",
        "Douglas Seah\nLocal Guide·402 reviews·1,070 photos\nRated 5.0 out of 5,\nBest in Pasir Ris! All the masseurs are top notch and rarely change. Consistently good after visiting this place many times. Clean and bright unlike some others which are dark and seem very dirty and unkept.\n\nPricing is good as well. Consistently good for the past 2 years I’ve been here. Hope this doesn’t change.\n\n",
        "Vivien Tan\n5 reviews\nRated 5.0 out of 5,\nThe masseur is spot on for all the acupoints. Extremely good quality massage. I've never experience such good massage in Singapore.\n\n",
        "Naj Maricar\n1 review\nRated 5.0 out of 5,\nWarm & friendly staffs, good massage & very comfortable\n\n",
        "Faliq Sudhir\n1 review·4 photos\nRated 5.0 out of 5,\nHi, to be really honest i am very used to getting massage on a regular basis when i was playing soccer full time to release the tension, tight muscles and alignments. These is definitely the closest to it. Strong and detailed. Its been close to 4 years since i last had these good of a massage. I definitely recommend my friends n family members\n\n",
        "Peter Williams\n5 reviews·14 photos\nRated 5.0 out of 5,\nAwesome reflexology. Deep pressure and massage. Professional and calm and tranquil. So glad to have found Wil. This will  definitely be a regular occurrence! I’ve had a lot of reflexology and this is quality.\n\n",
        "JINGCAI DAI\n3 reviews\nRated 5.0 out of 5,\nVery competitive price & value for money in the neighbourhood compared to my previous experience in other malls. I must say their masseur are pro and 按得很尽很到位! Already recommending my wife and friends. 👍🏻\n\n",
        "Janice Toon\n2 reviews\nRated 5.0 out of 5,\nGlad to have Good masseurs who knows their trade well in the neighbourhood. The shop places cleanliness to top priority and nice aromatherapy smell makes me feel happy. The lady boss, Sherry is very friendly and makes her customers at ease.\n\n",
        "Vincent Quek\n1 review\nRated 5.0 out of 5,\nThe masseurs have been massaging us weekly for years. Wil Essential only take in well qualified masseurs. If you are looking for a place to relax and enjoy good massage, Wil Essentials is the place to go!\n\n",
        "Charmaine Lee\n3 reviews\nRated 5.0 out of 5,\nSkilful masseuse. My muscles are so relaxed after the  session. Very friendly environment. Place smells nice and the massage oil used smells great too! Will definitely recommend to my friends and family!\n\n",
        "Sam Tay\n2 reviews\nRated 5.0 out of 5,\nFinally found a place with great deep tissue massage by their experienced staff. Aching muscles are now relieved. Place is cozy and comfortable. Have already book for my next session 2 weeks later.\n\n",
        "Rhee Sidhu\n2 reviews\nRated 5.0 out of 5,\nGood masseuse, they provide great professional and friendly service. Ambience is so calming gives me a great pleasure and total sense of equilibrium when I am there. My kid enjoys the massage too. Overall I will rate above 5* service... top on Service , Ambience and customer oriented. Thank you for always clearing my Aches ....\n\n",
        "Lee Mengai\n3 reviews\nRated 5.0 out of 5,\nFirst time I’m posting a review because this place is really good! Perfect for those who are looking for fuss free and professional massage. Much thanks to Alvin and Ah Tien for their amazing skills!\n\n",
        "Billy Lim\n1 review\nRated 5.0 out of 5,\nOne of the best places to go for massage. Very friendly staffs, clean and hygienic environment. The major plus point is that all their massueues are well trained with great skills. 👍 So no need to worry , any massueue u get, will also be great :)\n\n",
        "Peter Liew\n2 reviews\nRated 5.0 out of 5,\nAll the masseurs were focus iin their work and professional in their delivery. I have been to many massage shops for many years and this shop is one of the best!!. Two thumbs up!\n\n",
        "Doreen L\nLocal Guide·72 reviews·8 photos\nRated 5.0 out of 5,\nUnexpectedly good, was turned away by Donglin so came to try this shop, turns out even better and I'm going to frequent them from now on\n\n",
        "Tee Chee Chiang\n1 review\nRated 5.0 out of 5,\nAfter more than 30 years of searching high & low for a good deep tissue massage, I finally found Will Essentials Foot Reflexology & Body Massage offer the Best Shiatsu Full Body massage . My health has improved tremendously and all of them are highly skills and very experience! It’s the ONLY place to go for it , no second thought...\n\n",
        "Fashikah\n4 reviews\nRated 5.0 out of 5,\nVery experienced staff, know what they are doing and all the pressure points. Really effective massage because the pressure is really strong!! Muscles feel more relaxed.\n\n",
        "Dj Raveator\n8 reviews\nRated 5.0 out of 5,\nLovely boss with extremely dedicated and hardworking masseurs. Deeply knowledgeable on the points that I had bad ache at when I was there and amazingly all were gone after the massage. Rlly recommend this place to everyone. Definitely will come back again and regularly\n\n",
        "Dorothy Choo\n3 reviews\nRated 5.0 out of 5,\nTried their foot and back massage today. The masseur was professional and friendly. The place is also clean! They are currently giving away a free mini aroma diffuser for any one-hour massage.\n\n",
        "Desmond Lim\n4 reviews\nRated 5.0 out of 5,\nVery professional. One of the better deep tissue massages I have had so far. Definitely need more time and I will come for the leg massages next time!\n\n",
        "Ridzwan Kassim\n3 reviews\nRated 5.0 out of 5,\nTried their 1 hour body massage. My body feels light after couple of days and it is no doubts due to their expertise in taking good card of their customer\n\n",
        "Nur Hidayah\n2 reviews\nRated 5.0 out of 5,\nVery friendly staff. Love how they would checked if the massage pressure was good or too strong. And the ambience was Calming and relaxing.\n\n",
        "Doris Raj\n4 reviews·1 photo\nRated 1.0 out of 5,\nShocking!!!! There is no privacy for males or females. There is one open crammed space with 4 or 5. Females and males being given full body massage right beside each other. I cancelled my appt and walked out shocked!!!!!\n\n",
        "LALAMYY\n9 reviews·1 photo\nRated 5.0 out of 5,\nDid my first 30 minutes massage at this place by Mr Alvin. Very professional and skillful, compare to the one I did in West plaza, would highly recommend, made early appointment and its worth the price!\n\n",
        "Clara Lee\n3 reviews\nRated 5.0 out of 5,\nhave always loved their aromatherapy products and anti microbial solution. i’ve not had such good massage in pasir ris for a while and very much value for money!\n\n",
        "Jesus is Lord\nLocal Guide·195 reviews·5,949 photos\nRated 5.0 out of 5,\nI have a locked tendon muscle on my back, Alvin masseuger helped me to clear the tendon makes it soft and flexible making my blood circulation cleared. I feel healthy again\n\n",
        "Priscilla Pang\n1 review\nRated 5.0 out of 5,\nGreat massage at affordable prices. Super convenient within the Pasir Ris neighbourhood. The owner Sherry is also very friendly and helpful! Would definitely recommend!!\n\n",
        "Balthier Cylus\n4 reviews\nRated 5.0 out of 5,\nI've been a regular customer for this shop since it's Grand Opening. The staff are respectful and very polite. They do sell some of the Essential oils and machines there that are affordable in terms of pricing.\n\n",
        "Benn Yeo\n1 review\nRated 5.0 out of 5,\n🦊Friendly staff,Excellent massage and reflexology services and tranquil ambience complete with aromatherapy supplies,would recommend this place to anyone who would like to do your reflexology and massage or just to relax while getting your aromatherapy supplies! Definitely my go to place when in need for a good massage and reflexology!👍🏽⭐️⭐️⭐️⭐️⭐️⭐️👍🏽\n\n",
        "Retronala\nLocal Guide·141 reviews·61 photos\nRated 5.0 out of 5,\nGreat place to have a good body or foot massage! Been here a few times and all staff here are good. Lady boss is friendly as well!!\nCall to make appt to avoid disappointment!\n\n",
        "Michelle Lim\n3 reviews·1 photo\nRated 5.0 out of 5,\nAlways a go to massage place. Clean and neat with top notch service.\n\n",
        "Celeste Chin\n3 reviews\nRated 5.0 out of 5,\nVery relaxing massage especially with the essential oils. Good and experience masseuse who is able to relief stress on targeted spots.\n\n",
        "Ck Lau\n3 reviews\nRated 5.0 out of 5,\nNice place and friendly staffs, good foot massage skills to ease the tightness/pain in my legs.\nWill recommend to anyone who need body massage or foot massage.\n\n",
        "Sean Chew\nLocal Guide·147 reviews·233 photos\nRated 5.0 out of 5,\nClean place, smell good, massage skill is POWER. Staff are polite and friendly.\n\n",
        "Gerard Chew\n2 reviews\nRated 5.0 out of 5,\nOne of the best massages I’ve experienced .  Very good quality and extremely thorough.  Will be back..\n\n",
        "Elenna Lai\n3 reviews·1 photo\nRated 5.0 out of 5,\nBest massage so far in Singapore!\n\n",
        "Kunaseelan Kathannan\n1 review\nRated 5.0 out of 5,\nWell trained and very professional staff. U have a problem they handle it very well and  also advice you on how to take care of it. Price is very reasonable compared to many places.\nWorth every cent spent there.\nOwners are also very pleseant and sincere people.\nThank you guys for the quality service.\nGod Bless\n\n",
        "Mark Low\n7 reviews·5 photos\nRated 5.0 out of 5,\nVery good experience! Good pressure point techniques applied by the masseur. Prices are reasonable too.\n\n",
        "Mae Heng\n3 reviews\nRated 5.0 out of 5,\nEffective pain management, much better than any panadol extra. Razi is super at relieving my pain, especially my stiff neck & neck pains. I’ve improved so much.\n\n",
        "josephine yap\n3 reviews\nRated 5.0 out of 5,\nVery good massage! Rids my aches and reduces my heatiness when I’m about to get a fever. Definitely recommend\n\n",
        "Ken Wong\n3 reviews\nRated 5.0 out of 5,\nFelt so much better after the massage  as I got a frozen shoulder. Will be back again.\n\n",
        "Jessica Ong\n1 review·1 photo\nRated 4.0 out of 5,\nNice ambience and friendly staffs\nAlvin is quite skilful. Will definitely book another appt again.\n\n",
        "Zhihao Tan\nLocal Guide·79 reviews·7 photos\nRated 5.0 out of 5,\nHidden gem in the neighbourhood.\n5/5 for ambience\n5/5 for cleanliness\n10/5 for the massage (Razi was the one who helped me. )\n\nHighly recommended!\n\nWill definitely be back\n\n",
        "harry boy\n1 review\nRated 5.0 out of 5,\nA good place for massage(deep tissue massage),,friendly and skillful  staff and a very nice lady boss there (Sherry).Recommended\n\n",
        "liting ong\n1 review\nRated 5.0 out of 5,\nMasseurs was friendly and skilled. Good place for relieved of pain. Will patronize the place regularly...already booked for the next visit.\n\n",
        "Patrick Tan C T\n2 reviews\nRated 5.0 out of 5,\nNice place to get your body, foot, hand shoulder relax with all those experience staff providing you the services. Will recommend to this cosy place.\n\n",
        "Sng S J\n2 reviews\nRated 5.0 out of 5,\nWas unexpectedly good. Friendly customer service. It is best to let your masseuse know what you're looking for.\n\n",
        "Adrian Koh\n1 review\nRated 5.0 out of 5,\nHighly recommend this place! Reasonable pricing and nice ambience. Will recommend Razi for a back massage if you are heading there:)\n\n",
        "Shirrene Choo\n3 reviews\nRated 5.0 out of 5,\nGreat place, clean and cosy. Masseurs are friendly and skilled. All pains relieved!\n\n",
        "Sir Sowy\n1 review\nRated 5.0 out of 5,\nI love Wil essentials.The staff there are nice and the massages are the best👍🏻\n\n",
        "Noor Zabidah\nLocal Guide·22 reviews·1 photo\nRated 5.0 out of 5,\nPrice reasonable and totally worth it... Need to make appointment in advance as it always full... 👍👍👍\n\n",
        "Tan Steven\n2 reviews·1 photo\nRated 5.0 out of 5,\nFriendly lady boss and good massage.from professionals.\n\n",
        "Daphne Ong\n1 review\nRated 5.0 out of 5,\nFriendly customer service. Clean environment & smells good! Reasonable price!\n\n",
        "J A S O N L I M\n8 reviews\nRated 5.0 out of 5,\nHad the deep tissue massage, really relaxed now!\n\n",
        "Terence Lee\n7 reviews·2 photos\nRated 5.0 out of 5,\nGood service and friendly folks. You really can relax in the place as they make you feel at home.\n\n",
        "Pam Yeo\n3 reviews\nRated 5.0 out of 5,\nSuper strong hands ..totally fully recharged like never before...superb !!\n\n",
        "Carpe Diem\n6 reviews\nRated 5.0 out of 5,\nNice ambience and great massages at a good price\n\n",
        "raks s\n44 reviews·25 photos\nRated 5.0 out of 5,\nVery friendly and excellent service. Professional and reasonably priced.\n\n",
        "Koh Seow Chin\n1 review\nRated 5.0 out of 5,\nStaff are skillful and friendly. Price is reasonable.\n\n",
        "Alfa Chan\n1 review\nRated 5.0 out of 5,\nEase my neck pain with affordable price!\n\n",
        "Kelvin Lee\n2 reviews\nRated 5.0 out of 5,\nGreat experiences and very professing staff.\n\n",
        "Carmen Foo\n7 reviews·2 photos\nRated 2.0 out of 5,\nMassage is too hard for me\n\n",
        "Dylan Ang\n1 review\nRated 5.0 out of 5,\nGreat massage\n\n",
        "Kerry Chen\n1 review\nRated 5.0 out of 5,\nGood masseusse!\n\n",
        "Sun War\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Edwin Lau\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Lai Sheng Lee\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Aaron Small\n5 reviews\nRated 5.0 out of 5,\n\n\n",
        "tysus kok\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 6970 0239\">6970 0239</span>",
    "Website": "https://wil-essentials-foot-reflexology-body-massage.business.site/?m=true"
}