{
    "Name": "Xiaoxi Deep Tissue Massage Centre",
    "Products": null,
    "Address": "144, Upper Bukit Timah Road, #02-31, Beauty World Centre, 588177",
    "Opening Hours": "Saturday 10am–9pm\nSunday 10am–9pm\nMonday 10am–9pm\nTuesday 10am–9pm\nWednesday 10am–9pm\nThursday 10am–9pm\nFriday 10am–9pm\nSuggest new hours",
    "Rating": "4.3\n68 reviews",
    "Reviews": [
        "Kenneth W\nLocal Guide·90 reviews·61 photos\nRated 4.0 out of 5,\nBeen there a few times. Can be painful as it's really deep tissue massage as the shop name says. My arm pain did improve but didn't really help my wife's frozen shoulder. She went X-ray and found other issues. So in summary it may or may not help. Depends on the issue. Service wise, they are friendly but can chat too much among themselves. But they won't slow down even you are in pain. Guess it's part of their training to keep working on the issue to unblock the blockage and improve flow. So also depends on your pain tolerance. Not for everyone.\n\n",
        "Elena Yeo\n2 reviews\nRated 2.0 out of 5,\nHeard about this massage place and read all the good reviews so gave it a try thinking that I have a high pain tolerance. The 1hr massage was excruciating and I had tears in my eyes! xD they really know how to rub out your pain and problem points. My husband went as well and he enjoyed it. However, a few hours after the massage, the muscles that were massaged over began to feel very sore and swollen, and it was so painful that it was difficult to get up this morning. The problem areas that were rubbed are also bruised and swollen now, not sure if this is a natural outcome from these deep tissue treatments??am hesitant to go back again.\n\n",
        "Maximilian Jackson\nLocal Guide·48 reviews·28 photos\nRated 4.0 out of 5,\nXiao Xi deep tissue massage works miracles. They really know their stuff. Everyone you get is well trained and is able to work on the deep tissue. Highly recommended.\n\n",
        "Kenneth W\nLocal Guide·90 reviews·61 photos\nRated 4.0 out of 5,\nBeen there a few times. Can be painful as it's really deep tissue massage as the shop name says. My arm pain did improve but didn't really help my wife's frozen shoulder. She went X-ray and found other issues. So in summary it may or may not help. Depends on the issue. Service wise, they are friendly but can chat too much among themselves. But they won't slow down even you are in pain. Guess it's part of their training to keep working on the issue to unblock the blockage and improve flow. So also depends on your pain tolerance. Not for everyone.\n\n",
        "Elena Yeo\n2 reviews\nRated 2.0 out of 5,\nHeard about this massage place and read all the good reviews so gave it a try thinking that I have a high pain tolerance. The 1hr massage was excruciating and I had tears in my eyes! xD they really know how to rub out your pain and problem points. My husband went as well and he enjoyed it. However, a few hours after the massage, the muscles that were massaged over began to feel very sore and swollen, and it was so painful that it was difficult to get up this morning. The problem areas that were rubbed are also bruised and swollen now, not sure if this is a natural outcome from these deep tissue treatments??am hesitant to go back again.\n\n",
        "Maximilian Jackson\nLocal Guide·48 reviews·28 photos\nRated 4.0 out of 5,\nXiao Xi deep tissue massage works miracles. They really know their stuff. Everyone you get is well trained and is able to work on the deep tissue. Highly recommended.\n\n",
        "Hye\nLocal Guide·32 reviews·10 photos\nRated 4.0 out of 5,\nThe tuina here is super painful but helpful. Usually they only focus on 1or 2 parts. Means u need a 2hrs session to get your full body tuina. I'm fine with space as long as they do change the sheet every time.\n\n",
        "Cheow Mong Chan\nLocal Guide·125 reviews·119 photos\nRated 5.0 out of 5,\nWent for tuina session. 1.5 hrs extend to 2 hrs.\nMy masseuse was Ah Kun. She was very skillful in massaging blocked acupuncture points that I didn't even know was blocked (super painful i almost cried out). If you don't have a high pain threshold, ask the masseuse to go softer. Other customers there were crying in pain.\n\nCall beforehand cause quite a lot of bookings and customers. Haven't tried the foot massage but nobody crying for help there.\n\nAs many mentioned, place was cramp, no frills, not for fussies. Go in, massage and get out.\n\nMy wife loved it and immediately booked another session next week. We paid $100 per pax for 2 hrs tuina.\n\n",
        "Henry Choo\nLocal Guide·9 reviews·19 photos\nRated 4.0 out of 5,\nTaking the advice from earlier reviews, went down after making a  morning appointment for shoulder pains I've been enduring for several weeks. The place was already quite packed at 10am and there was intermittent chatter amongst the therapists during the session (which I was mentally prepared for). Most importantly, the therapist seems well versed in understanding the cause of my shoulder pain and also recommended exercises for me to help with recovery (in Mandarin). The massage was uncomfortable to the point of almost being excruciating, but my shoulder dexterity and pain improved significantly after the treatment. The only reason for docking 1 star is because the place felt a little cramped.\n\nI'd recommend this place especially if you are seeking treatment for specific muscle injuries, but be prepared to endure discomfort.\n\n",
        "Nicole Liz\nLocal Guide·65 reviews·4 photos\nRated 3.0 out of 5,\nXiao Xi is a very experienced therapist who’s knows how to treat injuries as well as common pain. The environment may not be relaxing as they speak to each other through the curtains, but her skills are definitely worth going for.\n\nUpdate: gave 5 stars at first but bumping it down because now that she gets more customers she doesn’t take appointments seriously and doesn’t put in the effort to massage properly. Went there on a Saturday and she just rushed through and was very rough.\n\n",
        "Daren\nLocal Guide·25 reviews·14 photos\nRated 4.0 out of 5,\nThey really know your pain points. The first time I went there, it was horrible experience. Do not go near their closing time. The lady felt a little distracted and felt like she just wanted to get the job done and go home.\n\nI did give it a second try in the early afternoon and it was a rather pleasant experience. I had a stiff neck and a strained shoulder. The lady did a good job in kneading that knot at the back of the neck.\n\nGo for mid day sessions.\n\n",
        "Eve Lim\nLocal Guide·18 reviews·34 photos\nRated 5.0 out of 5,\nThey are well-known in bukit timah area. Been going to their place for many years.\nHappy with them.\n\n",
        "Vanessa Lee\n16 reviews·10 photos\nRated 5.0 out of 5,\nXiaoxi's staff are always very good with pinpointing the troubled spots in my body and yes of course, no pain no gain. But after that your body loosens up. Swing by here to pamper yourself, but remember to call to book appointment as here is always packed. Take note: now with SMM, only one foot reflexology session per slot.\n\n",
        "Enaejiえなえじ\nLocal Guide·24 reviews\nRated 5.0 out of 5,\nThey really know the spot that I needed. Thank you. I will come again next time.\n\n",
        "Jonathan Chan\n1 review\nRated 2.0 out of 5,\nGood massage but extremely very poor management skills.\n\nMasseur will squeeze in every appointments possible. I had to wait 30mins even when appointment was made.\n\nMasseurs also double-up as the receptionist so you get alot of shouting across the 'rooms'\n\n",
        "Ang Vicki\nLocal Guide·80 reviews·72 photos\nRated 1.0 out of 5,\nCheap price comes with non-pro skills.  The stroke on my left leg was entire different from the right leg. Location where I told her to soften up, she will add strength till I need to withdraw my leg from her. Throughout the period, she was only interested to grap her next customers and add up as a receptionist. There is no massage, only touch here and there. Try Kenko, then you can tell different.  Kenko is like the therapist are well versed & educated on where to press & message ( till you can fall asleep). Xiao xi therapist is like very make shift, as long I touch your legs, it is considered as massage. Most of the therapist's time are trying to fill their slots as much as possible, earning the quickest way with the least effort. I won't waste my money on this place any more. Complete waste of time.\n\n",
        "Aria Mangunkusumo\n2 reviews\nRated 3.0 out of 5,\ngreat massage technique. but it was very chaotic: noisy and crammed. Masseur were kept talking with each other during sessions and although the place was crammed, they speak in high volume (read: noisy).\n\n",
        "Wei Wei\n3 reviews·8 photos\nRated 5.0 out of 5,\nSpot on Tuina therapy if you are in need of hardcore deep tissue massage!\n\n",
        "ruben S.R\n6 reviews\nRated 1.0 out of 5,\nThe guy was playing piano with my leg. So pathetic massage. As if he was forced to do it. Terrible service. Don't recommend if you are looking for a proper foot massage.\n\n",
        "Zynthia Lim\n1 review\nRated 5.0 out of 5,\nXiaoxi is a very experienced therapist.  I have this pain for more than 4 months and none of the therapists that I have gone to was able to help me until someone recommended me to Xiao Xi.  She knew where my pain was and after one treatment I felt better.  Good job!\n\n",
        "Christine Quah\nLocal Guide·125 reviews·10 photos\nRated 1.0 out of 5,\nAh Mei is a lazy therapist with a very poor attitude. Her massage technique was terrible and refused to adjust the pressure even when I repeatedly asked. She ended up shouting at me when I gave feedback to the boss after the message. I paid full price for a horrible massage that did nothing for me.\n\n",
        "Brian Tiong\n6 reviews·2 photos\nRated 5.0 out of 5,\nRecommended by a friend, Good sports massage relived a back pain that was nagging for months. Looks like most people come for sports related injuries.\n\n",
        "Timotheus Ooi\n15 reviews·5 photos\nRated 5.0 out of 5,\nMy favourite massage place. Really skilled chinese therapists who can speak enough english for anyone. They provide a strong massage with expert techniques to get rid of trigger points and pain at a reasonable price.\n\n",
        "Lisa Perry\n3 reviews\nRated 5.0 out of 5,\nA place for the non fussy. If you are looking for deep tissue and have high tolerance for pain. Look for May.  Overall satisfied.\n\n",
        "Phillip Panton\nLocal Guide·25 reviews·111 photos\nRated 5.0 out of 5,\nHad neck back pain got a very hard and painful massage which sorted the problem completely. Highly Recommended, $50 for 1 hr reasonable pricing staff friendly with sufficient english.\n\n",
        "Grace Wong\nLocal Guide·47 reviews·100 photos\nRated 5.0 out of 5,\nVery effective. I come whenever I pull a muscle\n\n",
        "Millie Tan\nLocal Guide·70 reviews·161 photos\nRated 4.0 out of 5,\nMy always go to place for massage. Their deep tissue massage never fails to relieve my aches. Highly recommended. Best to call to book appointment before you go.\n\n",
        "PF Ng\n61 reviews\nRated 4.0 out of 5,\nGood deep tissue massage at reasonable prices. Very popular. Make sure you call for an appointment as they are fully booked most times.\n\n",
        "Pamela Tan\nLocal Guide·24 reviews\nRated 5.0 out of 5,\nSkilled masseuses knead out all the knots in my body. Recommended to call ahead to make appointments as they can get quite full at times.\n\n",
        "Tammie Siew\n2 reviews\nRated 5.0 out of 5,\nMany great specialists. Knows exactly where the right place to target is - even when I didn’t know myself. Good for issues from office work Eg neck strain, poor posture back strain as well.\n\n",
        "San-Ju Tan\n5 reviews\nRated 5.0 out of 5,\nThey have many good tuina specialists.\n\nGood for sprain, muscle ache, frozen shoulder and tennis elbow etc.\n\nBook in advance is best.\n\n",
        "Fiona Goh\n9 reviews·3 photos\nRated 5.0 out of 5,\nStrong massage! Helped to relieve my neck pain and even gave me recommendations to do stretching exercise to improve my stiff body.\n\n",
        "Peter Low\nLocal Guide·203 reviews·78 photos\nRated 4.0 out of 5,\nquite occupied, skillful technique,  know them more than 10 years, can't remember, that time they are still with lau wu, but gone already.....\n\n",
        "Alfred Ang\n8 reviews\nRated 4.0 out of 5,\nSkillful and reasonable pricing\n\n",
        "Jordyn K\n30 reviews·24 photos\nRated 4.0 out of 5,\nNo frills massage, pretty good for its price. Will come back.\n\n",
        "JOLEEN HUI XIANG NG\nLocal Guide·14 reviews·6 photos\nRated 5.0 out of 5,\nThey really press into your main stress points. Painful but it's heals after.\n\n",
        "smeowly\n7 reviews\nRated 5.0 out of 5,\nmy favourite sports massage centre for sore and knotted muscles.\n\n",
        "Gamer King\n1 review\nRated 5.0 out of 5,\nGood strength for massage from a man.\n\n",
        "Cheryl\nLocal Guide·52 reviews·40 photos\nRated 5.0 out of 5,\nCame twice, different therapists and both are good\n\n",
        "Andy Ong\n9 reviews\nRated 5.0 out of 5,\nStraight forward no frills treatment for my injuries\n\n",
        "Daniel Liu\nLocal Guide·18 reviews·20 photos\nRated 5.0 out of 5,\nPainfully satisfying! I have been gg there for years.\n\n",
        "Allan Tan\nLocal Guide·30 reviews·21 photos\nRated 4.0 out of 5,\nGood masseurs.. Good skills and good results...\n\n",
        "Portrait Images\n2 reviews\nRated 1.0 out of 5,\nVery lousy. Low pressure. No skill.\n\n",
        "Rick Koh\nLocal Guide·142 reviews·87 photos\nRated 5.0 out of 5,\nAlways good. Been here for years.\n\n",
        "Meredith Tan\n16 reviews\nRated 5.0 out of 5,\nPain+++ but no regrets\n\n",
        "Catherine Ong\nLocal Guide·21 reviews·39 photos\nRated 5.0 out of 5,\nA very good place for therapy!!\n\n",
        "Eric Chan\nLocal Guide·36 reviews·83 photos\nRated 4.0 out of 5,\nGood recovery massage\n\n",
        "Cas L\nLocal Guide·6 reviews·79 photos\nRated 5.0 out of 5,\nGood massage\n\n",
        "coolJasminebaby jascoolgirl\n16 reviews·21 photos\nRated 5.0 out of 5,\nNice massage services\n\n",
        "Jitender Verma\nLocal Guide·134 reviews\nRated 5.0 out of 5,\nFull relaxing\n\n",
        "ricky lee\n14 reviews·13 photos\nRated 5.0 out of 5,\nValue for $.\n\n",
        "Team Orca\nLocal Guide·140 reviews·5 photos\nRated 5.0 out of 5,\nThe hard kind\n\n",
        "최규태\nLocal Guide·145 reviews·2,286 photos\nRated 5.0 out of 5,\n(Translated by Google) I use it for treatment of herniated disc, but it works great.\n\n(Original)\n허리디스크라 치료목적으로 다니고 있는데 효과 좋아요\n\n",
        "engthiam lim\nNo Past Reviews\nRated 3.0 out of 5,\n\n\n",
        "Darryl Liew\nLocal Guide·24 reviews·129 photos\nRated 5.0 out of 5,\n\n\n",
        "Deep C S C\n3 photos\nRated 5.0 out of 5,\n\n\n",
        "AikPing Lim\nLocal Guide·28 reviews·147 photos\nRated 4.0 out of 5,\n\n\n",
        "Darren Chiang\n11 reviews·1 photo\nRated 5.0 out of 5,\n\n\n",
        "Liyun Liyun\n4 reviews·34 photos\nRated 1.0 out of 5,\n\n\n",
        "Michael\n7 reviews\nRated 5.0 out of 5,\n\n\n",
        "Serena Tham\nLocal Guide·53 reviews·396 photos\nRated 3.0 out of 5,\n\n\n",
        "Soon Chye Teo\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Jian-Jun Liu\nNo Past Reviews\nRated 4.0 out of 5,\n\n\n",
        "Bingming Thum\nLocal Guide·48 reviews·209 photos\nRated 5.0 out of 5,\n\n\n",
        "Ang hwa\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Andrew Leong\nLocal Guide·16 reviews·15 photos\nRated 5.0 out of 5,\n\n\n",
        "Hong Chuan Chia\nLocal Guide·17 reviews·88 photos\nRated 5.0 out of 5,\n\n\n",
        "Leong\n3 reviews\nRated 5.0 out of 5,\n\n\n",
        "Shengwen Chua\n7 reviews·16 photos\nRated 5.0 out of 5,\n\n\n",
        "Shawn Wong\n2 reviews·11 photos\nRated 5.0 out of 5,\n\n\n",
        "Amanda Tan\n6 reviews·11 photos\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "6778 2098",
    "Website": "Info is not retrievable"
}