{
    "Name": "Xin Hao Foot Reflexology & Massage",
    "Products": null,
    "Address": "Bishan Street 11, #01-426 Block 505, Singapore 572505",
    "Opening Hours": "Saturday 10am–6pm\nSunday 10am–6pm\nMonday 12–7pm\nTuesday 12–7pm\nWednesday 12–7pm\nThursday 12–7pm\nFriday 12–7pm\nSuggest new hours",
    "Rating": "4.9\n23 reviews",
    "Reviews": [
        "limpeh Isme\n3 reviews\nRated 2.0 out of 5,\nTried this massage down my block over the weekend.\n\nPlace is neat, clean and smells good. Danny is polite and soft-spoken. This is where the \"positives\" end.\n\nGaps: Massage lacks strength and techniques. Rather random and aimless. Massage style is \"piano\" type, soft touch. On top of this, the session ended about 10mins earlier than stipulated time. Only realized after i paid the cash and left.....\n\nVery disappointing experience 😞\n\n",
        "MN TAN\n1 review\nRated 5.0 out of 5,\nFist time trying out this place. Very clean, quiet and comfortable place. The owner is very friendly and provides therapeutic massage at an affordable price. Highly recomended.\n\n",
        "Aurelia\nLocal Guide·46 reviews·21 photos\nRated 5.0 out of 5,\nDanny was very friendly and patient. He massages well and got rid of all those \"knots\" out of me! I would recommend his place for a good and affordable massage.\n\n",
        "limpeh Isme\n3 reviews\nRated 2.0 out of 5,\nTried this massage down my block over the weekend.\n\nPlace is neat, clean and smells good. Danny is polite and soft-spoken. This is where the \"positives\" end.\n\nGaps: Massage lacks strength and techniques. Rather random and aimless. Massage style is \"piano\" type, soft touch. On top of this, the session ended about 10mins earlier than stipulated time. Only realized after i paid the cash and left.....\n\nVery disappointing experience 😞\n\n",
        "MN TAN\n1 review\nRated 5.0 out of 5,\nFist time trying out this place. Very clean, quiet and comfortable place. The owner is very friendly and provides therapeutic massage at an affordable price. Highly recomended.\n\n",
        "Aurelia\nLocal Guide·46 reviews·21 photos\nRated 5.0 out of 5,\nDanny was very friendly and patient. He massages well and got rid of all those \"knots\" out of me! I would recommend his place for a good and affordable massage.\n\n",
        "HuiQi Tan\n1 review\nRated 5.0 out of 5,\nDanny's shop is very cozy and I had a really relaxing foot massage. Highly recommended\n\n",
        "Lee Vonne\n6 reviews\nRated 5.0 out of 5,\nA great massage place in the neighbourhood of Bishan. Danny was friendly and his massage skills are consistent and good. Highly recommended.\n\n",
        "Lim Yi Qin *\n1 review\nRated 5.0 out of 5,\nHad a massage at this shop, surprising ly massage was  satisfying good. Will be back again.\n\n",
        "June Chua\n1 review\nRated 5.0 out of 5,\nProfessional and feels really relaxed after the massage.\nreally good experience overall!\n\n",
        "BossDaddγ AjiK\n1 review\nRated 5.0 out of 5,\nHighly Recommended. Mr Danny knew where is the most stiffness part of the body. Went throughout alot of massage in Singapore , by far This the best service. Affordable/Good Hospitality. Recommended 10/10..\n\n",
        "Chen Zhoulin\n1 review\nRated 5.0 out of 5,\nProfessional and friendly. Enjoyed my massage. Highly recommended!\n\n",
        "Zi Rui Tan\n3 reviews·1 photo\nRated 5.0 out of 5,\nWent without expectation but was honestly pleasantly surprised! Owner was very friendly and the massage was great. His pressure is perfect for me and I definitely felt better when it was done. The place is really clean and cosy. Will definitely be back again :)\n\n",
        "Mag\nLocal Guide·19 reviews·20 photos\nRated 5.0 out of 5,\nDidn’t expect much from a small neighbourhood massage place but it turned out one of the best experiences I’ve had so far! The masseur / owner was very skilful and friendly. Throughout my 40 mins back and shoulder massage, the pressure force was consistent and on point. I always have sore lower back due to prolonged sitting, but it feels very relieved after the session. Highly recommended and definitely will be back again!\n\n",
        "Shaun Lim\n4 reviews·2 photos\nRated 5.0 out of 5,\nClean and professional outfit that offers great massages at a reasonable price. Owner is a friendly chap that knows when to make small talk and when to give the customer space. Would definitely recommend.\n\n",
        "Chia Min Da\n2 reviews\nRated 5.0 out of 5,\nExcellent and dedicated massage and reflexology service done by a well trained profession. He managed to solve my recurring aching issue. Friendly and great service too. Highly recommended if you are staying near Bishan area!\n\n",
        "Thai Khue Tran\nLocal Guide·13 reviews·8 photos\nRated 5.0 out of 5,\nDanny is friendly and good. His massage is consistent and helps release muscle stress. Recommended.\n\n",
        "Benny Lee\n10 reviews\nRated 5.0 out of 5,\nOwner is friendly and provide therapeutic massage at affordable price! A great place to drop by if you are around Bishan vicinity.\n\n",
        "Jeremy Chan\nLocal Guide·44 reviews\nRated 5.0 out of 5,\nSurprisingly good massage. Wasn’t expecting much from a neighborhood joint. But turn out very good! Recommended!\n\n",
        "Desmond Ong\n2 reviews\nRated 5.0 out of 5,\nMassage is good. Boss is friendly. Highly recommended!\n\n",
        "Seah Geok huay\n1 review\nRated 5.0 out of 5,\nMasseur skill is good\n\n",
        "Jessie Wong\n4 reviews·3 photos\nRated 5.0 out of 5,\ngood massage ☺️\n\n",
        "Bao Rong Cham\n38 reviews·24 photos\nRated 5.0 out of 5,\nEnjoyed the massage.\n\n",
        "Julia J\n5 reviews·3 photos\nRated 5.0 out of 5,\n(Translated by Google) The location is easy to find, close to Bishan subway station, and the owner is also very nice. People are very easy-going and easy to chat! What surprised me was that the owner turned out to be a Singaporean who loves freedom! The shop is very quiet, so the owner will do it himself! The surrounding environment is also very relaxing, and the technology is also great! Will go again when I have time!\n\n(Original)\n位置很容易找，靠近碧山地铁站，店主人也很好，。人很随和很容易聊！让我意想不到的是店主竟然是爱自由的新加坡本地人！店里很安静，就店主一个人自己做！周围的环境也很让人放松，技术也是很棒！有时间会再去！\n\n",
        "Samuel Lee\nLocal Guide·12 reviews·13 photos\nRated 5.0 out of 5,\n\n\n",
        "Esther Lee\n7 reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "<span aria-label=\"Call phone number 9740 1205\">9740 1205</span>",
    "Website": "http://www.facebook.com/xinhaofootreflex"
}