{
    "Name": "Xpress Foot Wellness Punggol  Foot Reflexology",
    "Products": {},
    "Address": "681 Punggol Dr., #04-09 Oasis Terraces, Singapore 820681",
    "Opening Hours": "Sunday 10:30am–9:30pm\nMonday 10:30am–9:30pm\nTuesday 10:30am–9:30pm\nWednesday 10:30am–9:30pm\nThursday 10:30am–9:30pm\nFriday 10:30am–9:30pm\nSaturday 10:30am–9:30pm\nSuggest new hours",
    "Rating": "3.8\n44 reviews",
    "Reviews": [
        "MX Yan\n3 reviews\nRated 5.0 out of 5,\nThe masseur Anne is so patient and professional. Communicated with me where I feel pain and applied pressure at the right spot.\n\nReceptionist friendly and I really like how this place is fuss-free and no persuasion to sign on any package at all.\n\nSuch a pleasant experience.\n\nWill be back!\n\n",
        "Ku Mo\n2 reviews\nRated 1.0 out of 5,\nI asked for back massage but the male massager called Brian said my shoulder stiff and only massage neck and shoulder. No hand, arm and he tapped back few times only. I have a problem with my back so I wanted back massage.  I wanted to complain but because there is next appointment no time.\n\n",
        "Yi Xin Yuen\n2 reviews\nRated 5.0 out of 5,\nChance upon this place. My therapist is Qingyun. He is knowledgeable and accurate on pressure points. Also tried body massage and feel refreshed at the end of the session.\n\n",
        "MX Yan\n3 reviews\nRated 5.0 out of 5,\nThe masseur Anne is so patient and professional. Communicated with me where I feel pain and applied pressure at the right spot.\n\nReceptionist friendly and I really like how this place is fuss-free and no persuasion to sign on any package at all.\n\nSuch a pleasant experience.\n\nWill be back!\n\n",
        "Ku Mo\n2 reviews\nRated 1.0 out of 5,\nI asked for back massage but the male massager called Brian said my shoulder stiff and only massage neck and shoulder. No hand, arm and he tapped back few times only. I have a problem with my back so I wanted back massage.  I wanted to complain but because there is next appointment no time.\n\n",
        "Yi Xin Yuen\n2 reviews\nRated 5.0 out of 5,\nChance upon this place. My therapist is Qingyun. He is knowledgeable and accurate on pressure points. Also tried body massage and feel refreshed at the end of the session.\n\n",
        "Jess Ong\n2 reviews\nRated 5.0 out of 5,\nHad been having a stiff neck for a few days and went for an upper back + foot reflexology combo. Qingyun was my masseuse . I felt so much better and found myself naturally sitting up straight after his massage. I like very strong massages and he definately has the strength. He was also very caring and gave tips/reminders on my posture. Thumbs up.\n\n",
        "Taufiq Zailani\n1 review\nRated 1.0 out of 5,\nJust ended my 1 hour body massage. All the way that masseuse was using his elboy and there is no oil at all. I thought there is cos usually they will use right? All the way massage my body but there is no massage on the legs or at all. Wasted my 58$ for a 1 hour session. Will definitely not recommend this to other people in the future. Sorry\n\n",
        "Alicia Cheng\n14 reviews·5 photos\nRated 5.0 out of 5,\nAcrually I recommend Qingyun to my friend based on Google review but I have yet to try.  Tried his services yesterday and had a good sleep.  Had bad headache and somehow it was gone by after foot reflexology.  Hmm will go out again for his services.\n\n",
        "Xue Ping Yeo\n1 review\nRated 5.0 out of 5,\nMy first visit to this outlet and I love the environment and very relaxing. I would highly recommend this outlet and my masseur is Qing Yun from China and he is very friendly and professional in his skills and services. One of the best foot masseur I've tried. I will definitely back again. Thank you 😊\n\n",
        "Danish Matin\n1 review\nRated 1.0 out of 5,\nPoor service. I pay for 1 hour for a full oil massage and not even a single oil was being used during the session. Massage should be using hand and this guy from the start until the session ended, he using elbow to press on my body until my body feel so painful after the massage.\n\n",
        "Izwandy Anwar\nLocal Guide·5 reviews·1 photo\nRated 1.0 out of 5,\nI called their number to book an hour long appointment at 1145am.\n\nI reached at 1140am, and was caught by surprise when the counter lady told me that my massage will only start at 12pm as she saw a mistake in the booking timings. I told her that I could not take an hour starting from 12pm as my son finishes his playgroup session at 1245pm. I think it's only a professional courtesy to notify me in advance on her mistake, not when I've already arrived at their door step and after making payment.\n\nThe franchise's only saving grace: She did offer me to take up 40 minute massage instead of an hour and gave me back a refund.\n\n",
        "Jaya Kumar\n4 reviews\nRated 5.0 out of 5,\nHad enjoy a relaxing 60 mins body massage by Lisa and 60 mins foot massage by Raveen.\nGood amount of strength, Great skills and nice environment. Towels are change after the massage it’s good to do that during this covid. Thumbs up.\n\n",
        "Angelyn Tan\n3 reviews\nRated 5.0 out of 5,\nGood foot massage by Qingyun and David. On point when massaging my foot and back. My partner and me will continue to have our weekly massage by Qingyun.\n\n",
        "Sara Bedazzled\n1 review\nRated 1.0 out of 5,\nHad a bad massage done by Ann. Supposed to be a full body massage but she did my back only didn't cover my front and when asked she said she wasn't aware. Full body suppose to be full body and not just the back. Her massage was poorly done too till I asked her to use strength. Sorry basically a lifeless chicken doing massage. I didn't want to say anything I just paid the full price which wasn't even worth it. I have done massage here with other masuese without any complaints.\n\n",
        "Sandy Lee\n2 reviews\nRated 5.0 out of 5,\nMy go-to place for weekly massages - great value and consistent skills.\n\n",
        "quennie low\n2 reviews\nRated 5.0 out of 5,\nThis was my first time getting foot reflexology. Frankly, it was quite painful. I never expected the foot massage this way. But the therapist told me i will feel netter\nAfter completing the massage, my feet were feeling very light and numb.\nAs it was my first time, i can't compare it or  call it good or bad.\nThe ambience was good, the staff was friendly.\n\n",
        "daisy yeo\n4 reviews\nRated 5.0 out of 5,\nWas surprised to discover this massage place which is so near my house. Massage was good and on point. I think my masseur was Lisa, and my friend's was Anne. I'll definitely come back again.\n\n",
        "Ryan T\nLocal Guide·43 reviews\nRated 2.0 out of 5,\nBeen here a few times and only once was the foot massage slightly above average. The rest were poor to average. The therapists are weak and gave soft massage even when told be harder.\n\n",
        "Chernice Goh\n3 reviews·1 photo\nRated 5.0 out of 5,\nDespite booking an appointment an hour before the massage they managed to gave me a slot . The person who was helping me to do the massage was also really awesome cant remember her name but she was the one who helped me with a body massage and she was so considerate throughout the massage session and she made sure she got all the spots where I was feeling really sore and she even asked if I was cold and I said yes , she went on to get another blanket/ towel to cover my body  . Would go back again 😍 ( for the same lady )\n\n",
        "Nikko Lee\n1 review\nRated 5.0 out of 5,\nDespite I'm late for my appointment on last sunday the staff counter lady was so nice to slot me in and push another booking to a later slot.  Really appreciate that so i decided to write a review for your company. Staff was friendly and the therapist was good even give me some health tips. Had a really wonderful massage. Thanks for the service.\n\n",
        "Peighton Velo\n10 reviews\nRated 1.0 out of 5,\nWas told on the phone and via whatsapp they’ll do prenatal massages even at 9 months pregnant. Than when trying to book they said no due to fear of complications. Sorry, but you guys are not doctors and I wouldn’t be trying to book a massage if my doctor wasn’t okay with it. Shouldn’t tell customers yes and then change minds.\n\n",
        "K L\nLocal Guide·49 reviews·42 photos\nRated 5.0 out of 5,\nHidden find! Clean and quiet.\n\nA friend recommended Rose and I was so glad that I had her as my masseur. just finished an hour foot and 40 mins body. The pressure was on point. You don’t even need to tell her where your pain points are. If you need a fix, she is the go to person. Would be back for more!!\n\n",
        "SZ M\n8 reviews·22 photos\nRated 5.0 out of 5,\nRecently I had back to back events at my workplacr that required lots of movement..from it my back and leg were super sore and needed massage..\n\nI went for Combo Foot and Back 40 mins each and attended by masseuse Yoyo.\n\nThe session went superbly great and my body felt light... n my feet felt good too!\n\n2 weeks after I had tired leg n neck, shoulders.... i booked Yoyo again and she did wonders!\n\nthank u Yoyo and I shall meet and hv u again!\n\n",
        "Cia Licia\n5 reviews\nRated 1.0 out of 5,\nI usually enjoy even average foot messages, but this is below that. Tried the back massage too, not going back again.\n\n",
        "Amri Hakim\nLocal Guide·67 reviews·48 photos\nRated 5.0 out of 5,\nThe masseuse was awesome. Gotten myself a foot massage. Worth every penny. Makes my feet lighter. Would come back again to do back massage.\n\n",
        "Jess Heng\n2 reviews\nRated 5.0 out of 5,\nThis my second visit and was so pleasantly served by Rose. I really enjoy her body massage it was good. will recommand my friends to your place. keep up the good work.\n\n",
        "Jeremy Heng\n1 review\nRated 5.0 out of 5,\nWent for foot reflexology for the first time. Foot felt lighter and comfortable after the session. Would go again.\n\n",
        "B M\n10 reviews\nRated 5.0 out of 5,\nBest place to be when you have stressed out body. I have been going to this place for months! My therapist is the best but I don't want to reveal his name here 😁. Thank you Mr X.\n\n",
        "Tan Tengkang\n3 reviews\nRated 5.0 out of 5,\nStrongly recommend Dylan and Ah kien for their massage. Good strength and right pressure point.\nWe will return back for more.\n\n",
        "tang colin\n2 reviews\nRated 5.0 out of 5,\nVisited twice.  One is shoulder and back massage,  another is foot massage . Satisfactory . Will try body massage.\n\n",
        "Siti masripah Dulun taban\n2 reviews\nRated 1.0 out of 5,\nI not be better after massage Full body, my body painfull and headache After that\n\n",
        "Abid Ali\n7 reviews·1 photo\nRated 1.0 out of 5,\nWay below average.. wasted 80 bucks for a 90min\n\n",
        "Kendrick Yeo\n5 reviews\nRated 5.0 out of 5,\nGood Massage. Strongly recommended.\n\n",
        "Ryan Hoe\n3 reviews\nRated 1.0 out of 5,\nLiterally the worst massage I had.\n\n",
        "cho Joey\n1 review\nRated 5.0 out of 5,\n(Translated by Google) I personally like the staff service of this massage shop. I also recommend the man named qing yun. He explained my problems when he massaged my feet and pressed my sore acupoints forcefully without taking my time. , I don’t like some massage parlors who take my time and help me press freely. I am very satisfied with the staff here. He is very dedicated to help me massage my feet. I am very grateful to qing yun for helping me solve my problem, and I will ask my friends to request his service next time. Really good 👍\n\n(Original)\n我个人很喜欢这间按摩店的员工服务，也推荐这家的员工叫qing yun的男士，他在帮我按摩脚部时解释我的问题和有力的按我酸痛的穴位也不吃我的时间，我不喜欢一些按摩院吃我的时间跟没什么力的帮我随便按，这里的员工我是很满意，他很用心帮我按摩我脚部的问题。我很感谢qing yun帮我解决我的问题，下次会叫我朋友们去request他服务。真的不错👍\n\n",
        "NUR DIANA\n2 reviews\nRated 5.0 out of 5,\n(Translated by Google) very good body massage done by mira. nice place to relax\n\n(Original)\npijat tubuh sangat baik dilakukan oleh mira. tempat yang bagus untuk bersantai\n\n",
        "Simon\n26 reviews·81 photos\nRated 5.0 out of 5,\n\n\n",
        "John Tan\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Mervyn Augustine\n1 review·1 photo\nRated 1.0 out of 5,\n\n\n",
        "JS TAN\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Mariyanto Aribowo\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Adrian Low\nLocal Guide·104 reviews·59 photos\nRated 5.0 out of 5,\n\n\n",
        "Meng Hong\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "Kim Lai\n1 review·7 photos\nRated 4.0 out of 5,\n\n\n",
        "Cheryl Lajara\nNo Past Reviews\nRated 1.0 out of 5,\n\n\n",
        "Aidl Tan\n1 review\nRated 4.0 out of 5,\n\n\n"
    ],
    "Phone": "8868 0202",
    "Website": "http://www.xpressfoot.com.sg/",
    "Message": "Info is not retrievable",
    "Review": "Too slow, moved on"
}