{
    "Name": "Xpress Foot Wellness @ Sengkang Mrt Station  Foot Reflexology  Massage",
    "Products": null,
    "Address": "5 Sengkang Square, #02-02, Singapore 545062",
    "Opening Hours": "Saturday 10:30am–9:30pm\nSunday 10:30am–9:30pm\nMonday 10:30am–9:30pm\nTuesday 10:30am–9:30pm\nWednesday 10:30am–9:30pm\nThursday 10:30am–9:30pm\nFriday 10:30am–9:30pm\nSuggest new hours",
    "Rating": "3.9\n24 reviews",
    "Reviews": [
        "John Tan\n1 review\nRated 5.0 out of 5,\nStaff are well trained and provide good massage skill.\nFirst time came to sengkang branch as i can say the lady therapist name candy is good. Small size but her strength is good will come back here if i pass by again.\n\n",
        "Svebwie Jan\n2 reviews·4 photos\nRated 1.0 out of 5,\nYou can never enjoy a proper massage here. Masseuse keeps talking with other staffs so loudly. And chats up the customers non stop. You can tell that the customers does not really want to chat either. When customers falls asleep, they will just piano massage no more effort. You know what I mean. I guess I'm right. The other reviews here says likewise.\n\n",
        "YUSOF ISHAK\n2 reviews\nRated 5.0 out of 5,\nGreat massage and I highly recommend. The foot and back massage was amazing. The therapist is able to accommodate to our request as we request more to deep pressure massage.\n\n",
        "John Tan\n1 review\nRated 5.0 out of 5,\nStaff are well trained and provide good massage skill.\nFirst time came to sengkang branch as i can say the lady therapist name candy is good. Small size but her strength is good will come back here if i pass by again.\n\n",
        "Svebwie Jan\n2 reviews·4 photos\nRated 1.0 out of 5,\nYou can never enjoy a proper massage here. Masseuse keeps talking with other staffs so loudly. And chats up the customers non stop. You can tell that the customers does not really want to chat either. When customers falls asleep, they will just piano massage no more effort. You know what I mean. I guess I'm right. The other reviews here says likewise.\n\n",
        "YUSOF ISHAK\n2 reviews\nRated 5.0 out of 5,\nGreat massage and I highly recommend. The foot and back massage was amazing. The therapist is able to accommodate to our request as we request more to deep pressure massage.\n\n",
        "Mustafa Zainudin\nLocal Guide·149 reviews·756 photos\nRated 5.0 out of 5,\nVery cosy & clean reflexology place. 1st time visit the place since its convenient at Sengkang mrt. The staff are friendly, registration was easy. The lady massues named CANDY was petite but very strong hands, slow & steady each she applies pressure on every stroke. Definitely will choose her again\n\n",
        "JAYVEN TAN\n1 review\nRated 5.0 out of 5,\nThe lady therapist massage strength is good.\nTried Katty and Linda both are good. My parents are really satisfied after the massage.\nPlace was clean and nice they change and clean the seat after another customer.\n\n",
        "Felicia Mak\n5 reviews\nRated 1.0 out of 5,\nBoth staffs and customers talking loudly. No peace and do really enjoy my experience anymore. It used to be a great cozy place to relax after work. This place is like a marketplace now.\n\n",
        "Yuslina Abdullah\n2 reviews\nRated 2.0 out of 5,\nMassage was good but the staff like to talking very loud! Bad service for front desk\n\n",
        "Maryann Rose\n2 reviews\nRated 5.0 out of 5,\nGreat massage, and great value. Good amount of strength applied during massage and  able to accommodate to our request. Definitely will be back.\n\n",
        "Fern Yit Lim\nLocal Guide·185 reviews·385 photos\nRated 1.0 out of 5,\nWas quite a nice place for very decent massage, gave it 5 stars. sadly the recent visit has not been pleasant. The employees were talking and joking to each other loudly and not paying much attention to the massage.\n\n",
        "Crystal Too\n1 review\nRated 3.0 out of 5,\nThe masseurs generally have good techniques and are willing to adjust accordingly to the customer's request.\n\nHowever, they tend to talk very loudly amongst themselves a lot even while attending to different people (e.g. talking about their earnings for the day, or the customers they had) at the customer service areas. Would also be better if they change the towels after each use as we noticed that they do tend to fold it back after use for the next customer on different occasions.\n\n",
        "Truly Yours\n4 reviews\nRated 3.0 out of 5,\nI like the masseurs (female ones) here as they use the right amount of strength for massage.  The price is ok.  Not exactly cheap nor too expensive.  Cannot compare to the cheaper price overseas of course.\n\nI’m disappointed on my recent visit.  They arranged a male masseur to massage for me without informing me.  I was shocked - I booked combo package of 40 mins foot and 40 mins back.  I told the receptionist that I only wanted a female masseur, and she argued that I never requested for a female one.  What kind of service is this?\n\nThe receptionist - by the name of Stella, should have asked me over the phone if I am ok with a male masseur before booking.  I had been here twice and they always gotten a female to massage for me.  I have no idea that a male masseur will also massage for female customers.\n\nIn the end, for a female one, I can only go for 60 mins foot/back.\n\nNot all female customers will be comfortable with a male masseur, and the receptionist ought to check with them before booking for them.  I do hope the owner can train the receptionist to be more sensitive.\n\n",
        "Tan Eunice\n13 reviews\nRated 2.0 out of 5,\nMassage is okie but the hygiene is not okie.Badly torn massage seat and don't seem clean. Need much look at especially during this period.\n\n",
        "Shivang Madaan\n5 reviews·5 photos\nRated 5.0 out of 5,\nVery Nice service they provide & very sweet people... Mr. Wong really do good job..\n\n",
        "Jimmy Ng\nLocal Guide·34 reviews·2,252 photos\nRated 1.0 out of 5,\nNo use strength at all.\nHe fell asleep then I fell asleep.\n\n",
        "Jitesh H\n2 reviews\nRated 5.0 out of 5,\nSimply brilliant and refreshing.....value for money as well\n\n",
        "Meng Hong\n2 reviews\nRated 5.0 out of 5,\n\n\n",
        "kartina falil tina\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n",
        "Ifah Mohd\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Amy Lim\n1 review\nRated 5.0 out of 5,\n\n\n",
        "Fayth Ong Hui Sin\n1 review\nRated 5.0 out of 5,\n\n\n",
        "HanBin Lim\nLocal Guide·5 reviews·4 photos\nRated 5.0 out of 5,\n\n\n",
        "Heng Min Zhi\nLocal Guide·87 reviews·381 photos\nRated 4.0 out of 5,\n\n\n",
        "DAVID LIM\n1 review\nRated 5.0 out of 5,\n\n\n",
        "JS TAN\nNo Past Reviews\nRated 5.0 out of 5,\n\n\n"
    ],
    "Phone": "8866 0202",
    "Website": "http://www.xpressfoot.com.sg/"
}